[
    {
        "title": "Kunwer Sachdev",
        "link": "https://en.wikipedia.org/wiki/Kunwer_Sachdev",
        "date": "N/A",
        "source": "Wikipedia",
        "snippet": "is an Indian entrepreneur and businessperson. He is also the mentor of Su-Vastika, an Indian power backup provider started by his wife, Khushbhoo Sachdev, in ...",
        "content": "Kunwer Sachdev, also known as theInverter Man of India,[1][2][3]is an Indianentrepreneurandbusinessperson. He is also the mentor of Su-Vastika, an Indian power backup provider started by his wife, Khushbhoo Sachdev, in 2019.[4][5]\n\nHe has been awarded one of 'India's Most Respected Entrepreneurs' by Hurun, amedia publishinggroup.[6]He is also a member of theGurugram Metropolitan Development Authority, agovernment agencyinGurugram,Haryana,India.[7]\n\nKunwer Sachdev was born to the late Krishan Lal Sachdeva, a section officer in theIndian Railways.[8]\n\nKunwar Sachdev completed his primary education at a government school in Delhi'sPunjabi Bagh. He had wanted to become a doctor since childhood, but he became abusinessman.[9]\n\nAfter completing his intermediate education, Sachdev joinedHindu CollegeinDelhiand graduated with a degree in Statistics. After this, he obtained the degree ofBachelor of Lawsfrom theUniversity of Delhi.[10][11][12][13]\n\nKunwer Sachdev has been featured in authorRashmi Bansal's bookConnect the Dots.[14]He was also featured in the bookBooming Brandby Harsh Pamnani.[15]\n\nIndian journalist Richa Anirudh interviewed Kunwer Sachdev during IBN Khabar's showZindagi Live.[16]He was also interviewed forET Now's showTee Time, where he talked about his supposed \"success mantra\".[17]\n\nKunwer Sachdev was awarded the 'Entrepreneur of the Year 2011' at the Entrepreneur India Awards.[18]"
    },
    {
        "title": "Kunwer Sachdev: The Inverter Man of India",
        "link": "https://kunwersachdev.com/",
        "date": "N/A",
        "source": "kunwersachdev.com",
        "snippet": "Explore the story of Kunwer Sachdev, the Inverter Man of India, and his journey in energy innovation and sustainability.",
        "content": "Kunwer Sachdev\n\nMy journey as an entrepreneur has been anything but ordinary. I never set out to build a multi-million-dollar company, nor did I have a blueprint for success. What I had was an insatiable curiosity, an unyielding determination, and the belief that problems exist only to be solved. Even at the age of 15, I started selling pens to shopkeepers with my brother, which gave me my first experience of sales, a skill that proved invaluable throughout my career.https://kunwersachdev.com/mr-kunwer-sachdev-the-inverter-man-of-india-journey/\n\nI started my career in theCable TV business, learning the ropes of entrepreneurship through sheer experience. I had no formal education in technology or business, yet I was fascinated by how things worked—how signals were transmitted, how machines functioned, how innovation could change lives. This curiosity became my biggest strength.\n\nIt was this same curiosity that led me to the world of power backup solutions. In the early days, people in India struggled withfrequent power cuts.Inverters and batteries were unreliable, inefficient, and often made with outdated technology. I saw a gap, an opportunity to create something better. With no background in electronics, I immersed myself in learning, experimenting, and innovating, and that’s howSu-Kam was born.\n\nBuilding Su-Kam was not easy. There were challenges at every step—from R&D and manufacturing to sales and service. But I believed in the power of perseverance and innovation. We introduced India’s first MOSFET-based inverter, India’s first DSP-based inverter, and many other groundbreaking technologies that changed the face of the industry.Su-Kam became more than just a company; it became a revolution. We not only built inverters, UPS systems, and solar solutions but also trained thousands of professionals, setting industry benchmarks.\n\nHowever, life has its twists and turns. Despite all the success, I had to step away from Su-Kam. But true passion never fades, and for me, innovation is not just about business—it is about making a difference. I knew my journey wasn’t over. That’s whenSu-vastika was born.\n\nWith Su-vastika, my vision is even larger. The world is moving towardssustainable energy, smart power backup solutions, and advanced energy storage systems. I am now focusing on creating patented technologies that will shape the future of power solutions—solutions that are not just reliable and efficient but also environmentally friendly and future-ready.\n\nToday, Su-vastika is leading the way in Lithium Battery Energy Storage, Solar Energy Innovations, and Automatic Power Backup Systems. We are not just creating products; we are building an ecosystem of knowledge, innovation, and global impact.The AI is the new mantra for products, and we are building AI into each product to make them smart.\n\nOutside of work, I find inspiration and balance in my personal passions—swimming clears my mind, whistling lifts my spirit, trekking fuels my adventurous side,Yoga keeps me fit and reading keeps my mind sharpand ever-curious. These interests aren’t just hobbies; they’re a reflection of the same passion, discipline, and love for exploration that I bring into my entrepreneurial journey.\n\nIf my journey has taught me anything, it is thatsuccess is not about what you achieve—it’s about the challenges you overcome, the knowledge you share, and the legacy you leave behind.Through Su-vastika, I want to continue pushing the boundaries of technology, inspiring the next generation of innovators, and proving that with determination, India can lead the world in power solutions.\n\nThe journey is far from over. In fact, it is only just beginning.\n\nThe future of DC systems in India The article discusses how Solar DC Systems could help solve India’s power crisis.\n\nजिद्द यालाच म्हणतात! पेन विकून खर्च भागवला, दुकानात काम करून उभी केली कोट्यवधींची कंपनी Authored Byप्रियांका वर्तक | महाराष्ट्र\n\nSuccess Story: कभी बसों में बेची पेन, शानदार आइडिया से किया कमाल, आज हैं 2300 करोड़ की कंपनी के मालिक\n\nThe story of Su-Kam and its founder, Kunwer Sachdev, is a notable one in the Indian business landscape, detailing both\n\nBeyond the Inverter: Unpacking the Entrepreneurial Journey of Su-Kam’s Founder We often see the finished product, the successful brand that\n\nKunwer Sachdev (born 16 November 1962) is an Indian entrepreneur who is the founder and Managing Director of Su-Kam. Popularly\n\nIndia vs USA: Growth vs Guilt — The Tale of Two Systems in Times of Economic Crises In 2008, theglobal\n\nIndia’s Innovation Paradox: When Will Failure Be Our Launchpad, Not Our Wrong doing? Kunwwer Sachdev    🔌 Inverter Man of\n\nKunwer Sachdev, Founder @ kunwwer.ai For years, I’ve witnessed the same story unfold — a story that tugs at my"
    },
    {
        "title": "Kunwer Sachdev Founder Su-kam",
        "link": "https://suvastika.com/author/kunwer/",
        "date": "N/A",
        "source": "Su-vastika",
        "snippet": "I'm the founder of brand Su-kam started the company in 1988. unfortunately, company went to bankruptcy and started with Su-vastika.",
        "content": "Kunwer Sachdev: The Visionary Entrepreneur Powering India's Future\n\nFrom the narrow lanes of Delhi to boardrooms across the globe, Kunwer Sachdev's journey is not just one of business success—it's a story of resilience, vision, and a relentless drive to solve real problems. Known as “The Inverter Man of India” and now fondly called “The Solar Man of India,” Kunwer is a man who dared to dream when the odds were stacked against him—and turned that dream into light for millions.\n\nA Spark Ignited Early\n\nKunwer Sachdev was born in a modest home in Delhi, where power cuts were a part of daily life. He wasn’t born into privilege, nor did he carry a degree from a fancy business school. What he had, however, was far more powerful—curiosity, courage, and clarity of purpose. He could see what others overlooked: the quiet suffering of families left in the dark and businesses crippled by unreliable electricity.\n\nWhile others adapted to the darkness, Kunwer chose to challenge it.\n\nBuilding Su-Kam: Lighting Up Lives\n\nIn 1988, with more grit than capital, Kunwer founded Su-Kam Power Systems. He didn’t just want to build a company—he wanted to solve a national problem. From inventing the world’s first plastic-body inverter to creating the iconic Home UPS, he turned Su-Kam into a beacon of innovation.\n\nUnder his leadership, Su-Kam wasn’t just a business—it was a movement. A movement that brought power, dignity, and stability to homes and villages across India. The company grew from a small setup to a global brand operating in over 90 countries, winning hearts and awards along the way.\n\nBut behind every product was a purpose. And behind every success, a sleepless night of hard work.\n\nA Story Worth Telling\n\nThe world took notice of this self-made man with a mission. Kunwer’s journey has been chronicled in some of India’s most inspiring books:\n\n- Booming Brands by Harsh Pamnani – capturing how he built Su-Kam into a trusted name from scratch.- Making Breakthrough Innovations Happen by Porus Munshi – highlighting his passion for solving India's energy crisis through bold, scalable ideas.- Connect the Dots by Rashmi Bansal – showcasing Kunwer as the everyday hero who built an empire without an MBA, but with the school of life as his teacher.\n\nEach page is a tribute to his belief: Innovation is for everyone. Especially the ones who need it most.\n\nReinventing for Tomorrow: Su-vastika & Kunwwer.ai\n\nEven after building one of India’s most successful power brands, Kunwer didn’t stop. His heart still beats for the future—and for those who need it the most.\n\nWith Su-vastika Systems Pvt. Ltd., he’s now tackling the next frontier: energy storage. Through lithium-ion batteries and Battery Energy Storage Systems (BESS), he’s helping India move towards a cleaner, more sustainable tomorrow.\n\nAnd now, with Kunwwer.ai, he’s stepping into the world of artificial intelligence—yet again ahead of the curve. His vision: to democratize innovation, using AI to bring smart solutions to energy, education, and business.\n\nMore Than an Entrepreneur\n\nKunwer Sachdev is more than just a successful businessman. He is a mentor, a dreamer, a changemaker. He believes that true success lies not in wealth, but in impact—in the number of lives touched, the villages lit up, the hope restored.\n\nWords to Live By\n\n“If your innovation solves a real problem, success will chase you. Not the other way around.”— Kunwer Sachdev\n\nLearn More\n\n- Google Profile: https://g.co/kgs/mo2qhXk- Wikipedia: https://en.wikipedia.org/wiki/Kunwer_Sachdev\n\n💡 Let’s connect.🌐 www.kunwersachdev.com📺 YouTube: Su-vastika Channel📸 Instagram: @kunwersachdev📘 Facebook: @kunwersachdevofficial💼 LinkedIn: Kunwer Sachdev🐦 Twitter: @kunwersachdev\n\nWhat Makes a Good Inverter UPS for Homes and Offices? In today’s world of unpredictable power supply, a reliable inverter UPS is more than a luxury—it’s a necessity. Whether you’re running a home office, managing critical household appliances, or ensuring peace of mind during outages, choosing the right UPS system can make a big difference. […]\n\nDitch the Lead-Acid, Embrace the Future: Su-vastika’s Retrofit Lithium Battery For years, lead-acid batteries have been the workhorses of inverters and UPS systems, providing backup power and off-grid functionality. But like any outdated technology, they come with their share of drawbacks: frequent maintenance, limited lifespans, and bulky size. Specially in Solar application of offgrid and […]\n\nWhat is Net Zero? Net Zero refers to achieving a balance between the amount of greenhouse gases (GHGs) emitted into the atmosphere and the amount removed. This means that whatever carbon dioxide (CO₂) or other GHGs we release must be offset by actions like planting trees, carbon capture technologies, or reducing emissions through renewable energy […]\n\nNet Zero and Its Implications for India with the Role of BESS and Su-vastika 1. Understanding Net Zero Net zero refers to balancing greenhouse gas (GHG) emissions with their removal from the atmosphere, a critical goal to limit global warming to 1.5°C under the Paris Agreement. Achieving this requires decarbonizing energy systems, enhancing efficiency, and […]\n\nEnergy: The New Currency, AI the Key to Its Vault In a world increasingly driven by sustainable solutions, energy has emerged as the new gold, copper, silver, and coal—a fundamental currency of our times. Just as lithium is the “white gold” of today’s batteries, energy storage is poised to become the cornerstone of our future […]\n\nIn battery technology, C1, C10, and C20 are terms used to describe the discharge rate of a battery. One can describe it as battery capacity based on the C rating as the battery capacity will vary with the variation of load applied on the battery. These ratings indicate how much current a battery can deliver […]\n\nRevolutionizing Battery Management: Su-vastika’s AI-Powered BMS for the Future The world is rapidly shifting towards sustainable energy solutions, and at the heart of this transition lies advanced battery technology. Lithium batteries, particularly LiFePO4 and NMC, have become the workhorses of this revolution, powering everything from electric vehicles to home energy storage systems. However, maximizing the […]\n\nThe Su-vastika Inbuilt Lithium Battery UPS or called Inbuilt Lithium Energy Storage System  https://suvastika.com/what-is-inbuilt-lithium-battery-energy-storage-system/ explained in this blog and  its mobile application for Android and iOS is a remarkable example of how modern technology is transforming power backup solutions. By integrating advanced features like real-time monitoring, digital warranty management, and complaint logging through a user-friendly […]\n\nSu-vastika’s Digital Warranty on Inverters, UPS, and More: Benefits for Users The Future of Warranties: Su-vastika’s Digital Warranty System. Su-svastika offers a unique “Digital Warranty” on their various products, including inverters, UPS, lithium UPS combos, lift inverters, energy storage systems (ESS), Lithium battery packs of different capacities, Solar inverters, Solar PCU, Solar Hybrid Systems, etc. […]\n\nWhat is solar hybrid PCU having MPPT technology. https://suvastika.com/what-is-ai-based-solar-pcu-and-how-does-it-work/ Su-vastika 2.5KVA Solar Hybrid PCU with MPPT integrated with Bluetooth and Wi-Fi connectivity, designed for smart energy management and user-friendly control via a dedicated mobile app: Key Features of the 2.5KVA Solar Hybrid PCU: MPPT Solar Charging: High Efficiency: MPPT (Maximum Power Point Tracking) optimizes solar panel output, ensuring […]\n\nHomeBrochuresExportTechnology PatentsDesign PatentsSafety ProcessTestimonialsBlogContact\n\nShed No 66D, Phase-6,Udyog Vihar, Gurugram,Haryana-122004\n\nEmail : info@suvastika.comToll-free : 1800-202-4423Sales : +91 9711 774744"
    },
    {
        "title": "Kunwer Sachdev (@Kunwer_Sachdev) / X",
        "link": "https://x.com/kunwer_sachdev?lang=en",
        "date": "N/A",
        "source": "X · Kunwer_Sachdev",
        "snippet": "Founder Su-kam Power Systems Ltd and after the banks took the company to NCLT, I joined as a mentor to Su-vastika Power Systems Ltd.",
        "content": "❌ Error extracting article: 400 Client Error: Bad Request for url: https://x.com/kunwer_sachdev?lang=en"
    },
    {
        "title": "Kunwer Sachdev Voices",
        "link": "https://timesofindia.indiatimes.com/blogs/author/kunwer-sachdev/",
        "date": "N/A",
        "source": "Times of India",
        "snippet": "The author is Entrepreneur, Innovator, Founder: Su-kam, Mentor: Su-vastika. Less. Kunwer Sachdev VOICES. Go to the profile of Kunwer Sachdev.",
        "content": "We encourage you to review ourTerms of Service, andPrivacy Policy.By continuing, you agree to the Terms listed here. In case you want to opt out, please click \"Do Not Sell or Share My Personal Information\" link  in the footer of this page.\n\nWe won't sell or share your personal information to inform the ads you see. You may still see interest-based ads if your information is sold or shared by other companies or was sold or shared previously.\n\nThe author is Entrepreneur, Innovator, Founder: Su-kam, Mentor: Su-vastika.Less\n\nKunwer Sachdev\n\nMay 6, 2023, 10:19 PM  IST\n\nJob descriptions play a critical role in the hiring process as they serve several vital functions, like defining the scope of the job. Generally, most organizations in India fail to make a job description with…\n\nMay 6, 2023, 10:19 PM  IST\n\nKunwer Sachdev\n\nAugust 6, 2022, 5:13 PM  IST\n\nUnion rural development and panchayati raj minister Giriraj Singh said at a recent conference, that India is increasing its reliance on renewable energy, intending to supply 50% of the nation’s electrical needs from renewable sources…\n\nAugust 6, 2022, 5:13 PM  IST\n\nKunwer Sachdev\n\nFebruary 6, 2022, 9:33 PM  IST\n\nA patent is an exclusive right to an inventor for a product, design, invention, or process that generally provides a new way of doing something or offers a new technical solution to a problem. It…\n\nFebruary 6, 2022, 9:33 PM  IST\n\nInterested in blogging for timesofindia.com? We will be happy to have you on board as a blogger, if you have the knack for writing. Just drop in a mail attoiblogs@timesinternet.inwith a brief bio and we will get in touch with you.\n\nTOI Edit Page,Voices\n\nErratica,TOI Edit Page,Tracking Indian Communities\n\nJuggle-Bandhi,TOI Edit Page\n\nTOI Edit Page"
    },
    {
        "title": "KUNWER SACHDEV | DIN : 00002083",
        "link": "https://www.indiafilings.com/search/kunwer-sachdev-din-00002083",
        "date": "N/A",
        "source": "IndiaFilings",
        "snippet": "KUNWER SACHDEV bearing DIN number 00002083 is currently the director of ENECO SYSTEMS LIMITED, SUKAM SYSTEMS PRIVATE LIMITED, SU-KAM TELECOM INFRASTRUCTURE ...",
        "content": "❌ Error extracting article: 403 Client Error: Forbidden for url: https://www.indiafilings.com/search/kunwer-sachdev-din-00002083"
    },
    {
        "title": "Meet 'inverter man of India', whose one mistake led to ...",
        "link": "https://www.dnaindia.com/business/report-meet-inverter-man-of-india-kunwer-sachdev-whose-one-mistake-led-to-downfall-of-26-year-old-company-he-is-3111928",
        "date": "Oct 7, 2024",
        "source": "DNA India",
        "snippet": "Kunwer Sachdev, known as the 'Inverter Man of India,' made a significant impact on the country with his company, Su-Kam. Founded 26 years ...",
        "content": "BUSINESS\n\nHis journey from creating a revolutionary product to losing his company and rebuilding his career shows resilience\n\nShivam Verma\n\nUpdated :Oct 07, 2024, 09:46 AM IST\n\nKunwer Sachdev, known as the ‘Inverter Man of India,’ made a significant impact on the country with his company, Su-Kam. Founded 26 years ago, Su-Kam was the first to manufacture power backup inverters, solving India's power crisis during the 1990s. Sachdev’s innovative inverters became household essentials, not just in India but also in countries like Nepal, Bangladesh, and parts of Africa.\n\nHowever, Su-Kam faced a downfall when it was declared bankrupt after defaulting on a Rs 240 crore loan. Although the company had assets to repay the loan, legal troubles arose, leading to its closure. Distributors and customers were left without service, and Sachdev’s reputation was severely affected.\n\nDespite these challenges, Sachdev did not give up. His wife, Khushboo, encouraged him to start a new venture. Together, they launched Su-vastika, providing services to customers and applying for patents on innovative products.\n\nSo far, six out of the 60 patents applied for have been granted. Sachdev continues to serve as a mentor, bringing his years of experience to the new company.\n\nSachdev’s journey from creating a revolutionary product to losing his company and rebuilding his career shows resilience. Su-vastika now offers a range of services to dealers and customers, keeping Sachdev’s legacy alive in the power backup industry.\n\nSocial worker Ritu Narang wins 'Spirit of Yoga' award at DNA Women Achievers Awards 2025\n\nVersha Verma, Lucknow-based judo player and poet, wins 'Humanitarian of the Year' at DNA Women Achievers Awards 2025\n\n13 soldiers killed, 6 children injured in suicide bombing in Pakistan, here's what we know so far\n\nPankaj Bhadouria wins Super Chef of the Year award at DNA Women Achievers Awards 2025\n\nPadma Shri Dr Soniya Nityanand wins 'Light of India' award at DNA Women Achievers Awards 2025\n\nWarren Buffett takes big decision, donates Rs 51000 crore in Berkshire Shares to..., reason is...\n\nSuparna Sarkar wins Breaking Barriers award at DNA Women Achievers Awards 2025\n\nViral Video: Owner of Mahindra Scorpio parks car in an unusual place, internet jokes, 'Show room feeling'\n\nMLC 2025: Shimron Hetmyer does THIS against Kieron Pollard on last ball during Seattle Orcas vs MI New York match\n\nTrapped in Rs 499 EMIs: The silent financial crisis of India’s young generation\n\nShah Rukh Khan's KKR star batter to join Uttar Pradesh education department, Yogi govt to give him salary of Rs..., he is...\n\nSwati Kapoor, who provides 'Thaal Sewa' to over 1200 people daily, wins 'Social Worker of the Year' at DNA Women Achievers Awards 2025\n\n'Kashi Ki Didi' Ranjubala Singh wins 'Warrior Spirit' award at DNA Women Achievers Awards 2025\n\nICAI to cap individual CA annual audits to 60, from..., president says, ‘CA can also carry out...’\n\nWho is Elizabeth MacDonough? Senate Parliamentarian blocking US President Donald Trump's 'Big, Beautiful bill', can delay the bill beyond deadline of....\n\nAkshara Singh wins Powerhouse Performer of the Year at DNA Women Achievers Awards 2025\n\nKavya Maran's SRH star player grooves to THIS viral song in rickshaw in England, video goes viral, watch\n\nCricketer Virat Kohli has a massive earning from social media, his one Instagram post earns him Rs..., know his latest venture\n\nMeet actress who worked with Kareena Kapoor, Hrithik Roshan, Madhuri Dixit, faced casting couch in the South, received email demanding..., her name is..\n\nBad news for Team India as Jofra Archer likely to return for IND vs ENG match at Edgbaston\n\nBig tension for China, India signs this big deal with Sri Lanka, aim is to..., it will ensure...\n\nDonald Trump wanted Princess Diana to be..., regrets this one thing about her who once said, ‘he gives me...’\n\nThis family keeps 900-year-old heritage of sarees alive, price starts from Rs 1.5 lakh, has this link with Mukesh Ambani's wife Nita Ambani, it is...\n\nThis is world's most valuable company, not owned by Mukesh Ambani, Gautam Adani, Elon Musk, Mark Zuckerberg, Jeff Bezos, total market value is..., name is...\n\nJasprit Bumrah to miss crucial Edgbaston Test? Here's what we know so far\n\nShefali Jariwala's death 'suspicious'? Police launch preliminary investigation as husband Parag Tyagi makes first appearance with..., search her house, question..\n\nMeet royal princess who travelled world, founded organisation that helps..., owns biggest hotel chain in....\n\nChinese flight forced to make emergency landing due to...., passengers say 'plane started shaking...'\n\nIndia's Brahmos vs US' Tomahawk: Know which is more powerful cruise missile\n\nAnother big move by Kumar Mangalam Birla, set to acquire this American company for Rs 10740 crore, it is..., plans to...\n\nOver 3500 Indian millionaires are expected to relocate abroad in 2025 with their staggering wealth of Rs...., migrating to...\n\nIleana D’Cruz welcomes second child with Michael Dolan, names him..., shares first photo\n\nWho is Parag Tyagi? Shefali Jariwala’s husband first met her at dinner party, worked with Amitabh Bachchan in..., has special connection to Sushant Singh Rajput\n\n‘Was under pressure...’: Shefali Jariwala suffered from this neurological disease for 15 years\n\nCommon links between Shefali Jariwala and Sidharth Shukla's death revealed: Cardiac arrest, Bigg Boss 13, and...\n\n'6,6,6,6,6...': Vaibhav Suryavanshi's explosive batting helps India U19 to register comfortable win over England U19\n\nWho is Queen Maxima, lady whose NATO Summit photos went viral, allegedly mocked Donald Trump due to...\n\nKaanta Laga, Bigg Boss 13 fame Shefali Jariwala dies at 42, cause of death revealed to be..., suffered since age of 15 from..\n\nDonald Trump wants full removal of trade barriers in India deal, says Unthinkable, but...'\n\nBad news for Bangladesh, Modi govt bans import of these items via land routes amid strained ties, list includes...\n\nMeet woman, who took inspiration from Virat Kohli's hard work, studied for over 12 hours a day, cracked UPSC exam in first attempt with AIR..., her name is...\n\nAhead of assembly elections, Bihar becomes 1st Indian state to allow e-voting through app, but only available for..., step-by-step guide to register\n\nThis expressway to get India's first AI-powered smart traffic system, can catch violators by detecting..., know complete features\n\nIndia to boost its air defence with Tejas Mk-1A, know their match against F-16, JF-17, Rafale fighter jets\n\nNeeraj Chopra achieves BIG milestone, reclaims number one spot in javelin throw rankings, Pakistan's Arshad Nadeem is at...\n\nIran calls out US President Donald Trump's 'disrespectful' tone towards Supreme Leader Ali Khamenei, says, 'Put aside or...'\n\nDonald Trump issues big warning to Iran, says he will bomb Tehran again ‘without question’ if it continues to...\n\nShefali Jariwala, Kanta Laga and Bigg Boss 13 fame, passes away at 42: Report\n\nDiscover actual location of Panchayat's Phulera Village, X user shares real pictures, now going viral, it is in...\n\nBigg Boss 17 couple Aishwarya Sharma, Neil Bhatt headed for divorce? Actress breaks silence: 'Just because someone is...'\n\nMeet actress, class 12 topper, once a UPSC aspirant, later landed roles alongside John Abraham, Shahid Kapoor,\n\nKannappa box office collection day 1: Akshay Kumar, Prabhas, Mohanlal, Vishnu Manchu-starrer fails to get double-digit opening, earns just Rs...\n\n'It's not easy to...': Ex-India coach fires back at Yashasvi Jaiswal's critics after Leeds fielding nightmare\n\nComplaint filed against this Indian actor for supporting Diljit Dosanjh, Pakistani artists: 'Why these double standards...'\n\nNeeraj Chopra’s BIG surprise to fan after his NC Classic event wish, he offers him...\n\nViral video: IndiGo passenger caught trying to steal life jacket: 'Indians can't be defended'\n\n'Sahi track pe...': Prithvi Shaw reveals Sachin Tendulkar's powerful message sparking his revival\n\nNot Aamir Khan, Ranbir Kapoor, Alia Bhatt, Deepika Padukone; this Bollywood actor has been invited to join the Academy for Oscars 2026 voting\n\nViral video: Australian vlogger criticised for highlighting Delhi's Ghazipur garbage dump, WATCH\n\nGautam Adani’s Adani Power gives massive order of Rs 6500 crore to this company for the construction of...\n\nMeet man who, studied at IIT Kanpur, now joins Meta’s Superintelligence team after leaving OpenAI, he is...\n\nDNA TV Show: Months after RG Kar horror, another rape at Kolkata's Law College puts TMC in docks\n\nVaibhav Suryavanshi dons Virat Kohli's iconic No.18 jersey, smashes 48 off just 19 against England U19 in 1st Youth ODI\n\nJitendra Kumar is highest-paid actor in Panchayat Season 4, know how much Sachiv Ji earned in 8 episodes, net worth is...\n\nIran-Israel War: Iran's BIG statement on talks with US, says, 'Would like to state clearly that...'\n\n'Is it legal': Frustrated by housing prices, man asks if he can live on houseboat full-time\n\nIran’s Ali Khamenei declares ‘victory’ says ‘US intervention prevented Israel from...’, criticises Donald Trump of...\n\nNo India vs Pakistan in Asia Cup 2025? Broadcaster's social media poster sparks speculations\n\n‘Raw talent’: Man dances like MJ to ‘Chaiyya Chaiyya’ with kids, viral video hits 19 million views, WATCH\n\nZohran Mamdani’s old video slamming PM Modi goes viral, calls him..., netizens condemn remarks, ‘spreading fake news’\n\nHe is world's richest beggar, owns two flats in Mumbai, his net worth is...\n\nIran-Israel War: India's FIRST statement after ceasefire between Iran, Israel, says, 'Iran's perspective and thinking...'\n\nMillionaire migration 2025: 10 countries wealthy people are choosing to call home, check list\n\nThe Family Man Season 3 first look: Jaideep Ahlawat, Nimrat Kaur join Manoj Bajpayee; Prime Video show to release on...\n\n'There was threat': Rohit Sharma's shocking hotel revelation before T20 World Cup 2024 match vs Pakistan\n\nWill Donald Trump deport Zohran Mamdani? Indian-origin Democrat can become first Muslim mayor of...\n\nKolkata Law College Rape: TMC MP Kalyan Banerjee's SHOCKING advise to women, says, 'they should be...'\n\nTHIS Islamic nation plans to implement four-working-day system from..., employees will get three week offs! Not Pakistan, Saudi Arabia, Iran, it is...\n\n‘DeepSeek not been able to provide...’: German Federal agency pushes Google, Apple to remove China’s AI service, gives warning of...\n\nKalki 2 in the works? Amitabh Bachchan drops BIG hint about sequel of Prabhas, Deepika Padukone film: 'If they were to...'\n\n'If Lord Ganesha did not let Shiv Ji...': Pavitra Punia objects to male priests changing clothes of goddesses in temples\n\nIND vs ENG Edgbaston Test: Rishabh Pant set to join elite list of players including Sir Don Bradman if...\n\nSay no to frizz this rainy season: 7 effortless ways to keep your hair sleek\n\nTHESE countries helped Israel build atom bombs! How did India,  Nehru keep Jewish state on sidelines? Tel Aviv has... nuclear bombs\n\nJeff Bezos and Lauren Sanchez's pre-wedding party hit by heavy rain, thunderstorm, star-studded event cut short\n\nSHOCKING! West Indies' Gabba star embroiled in sexual harassment claims amid ongoing Australia Test series\n\nMeet man who once was monk, later returned home, now owns empire worth Rs 120 crore, he is...\n\nKolkata SHOCKER! Victim wept, touched his feet, pleaded with folded hands, but TMC leader did not let her go and...\n\nJeff Bezos’s fiancé Lauren Sanchez has a long portfolio, is trained in...,owns big business, her net worth is Rs...\n\nNeeraj Chopra’s heartfelt gesture wins internet after India’s Golden Boy does THIS for a fan seeking Rs 2,000 for…\n\n'Ronit Roy has villas, Sakshi Tanwar has enough money for six generations': Ram Kapoor reveals secret behind wealth of TV stars\n\nMeet Microsoft employee who was laid off after 23 years of service, still continues to go to office, because of...\n\nEngland Women vs India Women, 1st T20I live streaming: When and where to watch on TV and online\n\nMukesh Ambani calls this Reliance investment ‘biggest risk’ of his life but worth taking because...\n\nJanaki Vs State of Kerala: Malayalam film federation calls CBFC demand 'disturbing', condemns 'random takes' on films\n\nDhanush, Nayanthara, Ravi Mohan unite with top South directors, 10 ambitious films in 2 years for...\n\nIran-Israel War: Israel's BIG revelation days after ceasefire, says, 'If Khamenei had been...'\n\n'Saath dena hoga': Mohammed Shami calls out Prasidh, Siraj after Headingley loss, urges pacers to lift burden on Jasprit Bumrah\n\n'That's loo and order': Video of man joining Gujarat high court hearing from toilet goes viral\n\nDharmendra was highest-paid actor for Sholay, received Rs 1.5 lakh to play Veeru, Amitabh Bachchan got just Rs..., lowest earning cast member earned only Rs 35000, name is.."
    },
    {
        "title": "The Journey of Kunwer Sachdev",
        "link": "https://prezi.com/m7pecr_1xtwh/the-journey-of-kunwer-sachdev/",
        "date": "N/A",
        "source": "Prezi",
        "snippet": "Kunwar had an annual turnover of Rs 3-4 crores and handsome profits. But many big players had entered the field and demand for his product was declining.",
        "content": "Prezi\n\nCompany\n\nLanguages\n\nSupport\n\nInfogram\n\nBlog\n\nJune 24, 2025\n\nJune 23, 2025\n\nJune 19, 2025\n\n© 2025 Prezi Inc.Terms&Privacy Policy\n\nPrezi\n\nProducts\n\nCompany\n\nSupport\n\nLanguages\n\nInfogram\n\n© 2025 Prezi Inc.Terms&Privacy Policy"
    },
    {
        "title": "KUNWER SACHDEV",
        "link": "https://www.zaubacorp.com/KUNWER-SACHDEV-00002083",
        "date": "N/A",
        "source": "Zauba Corp",
        "snippet": "KUNWER SACHDEV is a director registered with Ministry of Corporate Affairs. Their Director Identification Number (DIN) is 00002083. KUNWER SACHDEV is/has been ...",
        "content": "❌ Error extracting article: 403 Client Error: Forbidden for url: https://www.zaubacorp.com/KUNWER-SACHDEV-00002083"
    },
    {
        "title": "Kunwer Sachdev vs The State Govt Of Nct Of Delhi & Anr. ...",
        "link": "https://indiankanoon.org/doc/95680050/",
        "date": "Sep 17, 2024",
        "source": "Indian Kanoon",
        "snippet": "The petitioner has asserted that the allegations in the FIR include breach of trust, cheating, forgery, criminal conspiracy, and criminal ...",
        "content": "Take notes as you read a judgment using ourVirtual Legal Assistantand get email alerts whenever a new judgment matches your query (Query Alert Service). Try out ourPremium Member Services--Sign up todayand get free trial for one month.\n\n1.     The Petition under Section 528 of BNSS, 2023 has been filed on\n                          behalf of the petitioner for quashing of FIR No. 0126/2024 dated 31.05.2024\n                          under Sections 420, 120B read withSection 34of Indian Penal Code, 1860Signature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                           Page 1 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48(\"IPC\" hereinafter) , registered at Police Station Connaught Place, New\n                          Delhi.\n\n2.       Learned counsel for the respondent No. 2 has appeared on advance\n                          Notice.\n\n3.       Briefly stated the petitioner, Mr. Kunwer Sachdev was married to\n                          respondent No. 2 Ms. Geeta Sachdev on 25.09.1987 according to Hindu rites\n                          and ceremonies at Arya Samaj Mandir, Mandir Marg, New Delhi. Two sons,\n                          Kanav and Shourya were born from their wedlock. However, due to ongoing\n                          disputes and quarrels, the parties have been living separately since\n                          September 2009 and have not been able to reconcile their differences.\n\n4.       The petitioner and respondent No. 2 jointly filed a Petition underSection 13(B)of the Hindu Marriage Act, 1955 (\"HMA,1955\" hereinafter)\n                          before the Family Court, New Delhi. They entered into a Settlement and it\n                          was agreed that the Petitioner would pay a settlement amount of Rs.\n                          5,00,00,000/- and transfer complete rights, titles, and ownership of two\n                          immovable properties: one commercial property bearing No. WZ- 1402/1,\n                          Nangal Raya, Delhi-110046, and another residential property bearing No. F-\n                          37, Greenwood City, Gurgaon, Haryana in favour of Respondent No. 2.\n\n5.       The parties accepted the Settlement Deed dated 13.08.2015 in their\n                          respective statements and first motion of divorce underSection 13B(1)of\n                          the HMA, 1955 was allowed by the Order dated 14.08.2015.\n\n6.       In furtherance of the Settlement Deed, parties signed two addendum\n                          Agreements both dated 11.03.2016. The first Addendum Agreement was e-\n                          stamped at 6:46 PM and the second was e- stamped on 11.03.2016 at 6:48\n                          PM. There were thus, two Addendum Agreements signed on the same day e-\n                          stamped at a gap of two minutes.\n\n7. The second Addendum Agreement was presented before the Family Court\n                          in the second Petition for Divorce underSection 13(B)(2)of HMA wherein\n                          parties made their detailed statements endorsing the second Addendum\n                          Agreement and also deposed about the details of the Settlement. The\n                          statements were accepted and it was mentioned in the Order dated\n                          11.03.2016 that full and final settlement amount of Rs. 3 crores has been\n                          received by the respondent No. 2. The Divorce by Mutual Consent underSection 13(B)(2)of HMA, 1955 was accordingly given to the parties.\n\n8.    The petitioner has claimed that during the Divorce proceedings, he\n                          was unable to retrieve the cheques issued to respondent No. 2 in pursuance\n                          of the first Addendum. However, these cheques were wrongly deposited by\n                          her despite there being no underlying liability. In light of the final Second\n                          Addendum Agreement, she ought to have returned the cheques. But she has\n                          manipulated the facts to her advantage in order to coerce the petitioner and\n                          to extract more money.\n\n9. The respondent No. 2 filed a Complaint underSection 138of the\n                          Negotiable Instruments Act, 1881 against the Petitioner for dishonour of\n                          above-mentioned       cheques   vide    Complaint     case    bearing        no.\n                          NACT/10395/2016 and NACT/10396/2016 which are pending adjudication\n                          before Hon‟ble Chief Judicial Magistrate, Gurugram.\n\n10. The respondent No.2 has also filed a Civil Suit (Original Side) bearing\n                          No. 398/2019 underOrder XXXVII of the Code of Civil Procedure, 1908\n                          seeking recovery of Rs. 4,05,00,000/- along with pendent lite and future\n                          interest @12% p.a..\n\n11.   Additionally, at the behest of Respondent No. 2, the distinguished\n                          Publication houses, Times of India and The Hindu, published defamatorySignature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                             Page 3 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48Articles   concerning   the   Petitioner.   The   Petitioner   submitted      his\n                          representation to these publication houses requesting them for the removal\n                          of the Articles.\n\n12.   The petitioner has claimed that the present Complaint Case bearing\n                          No. 2086/2024 under Sections 420, 120B read with Section 34 was yet\n                          another attempt by respondent No.2 to harass the petitioner. The respondent\n                          No. 2 by relying on the first Addendum read with the final Settlement, has\n                          sought to portray the petitioner has committed criminal breach of trust and\n                          cheating. She has concealed the second Addendum entered into between the\n                          parties. Moreover, he has impleaded Smt. Khushboo Sachdev, the second\n                          wife of the petitioner in the impugned F.I.R., even though she has no\n                          concern with any of this controversy.\n\n13.   The petitioner exhausted by the continuous harassment and hoping to\n                          achieve peace, the Petitioner paid the Respondent No. 2 Rs. 5,00,000/- on\n                          28.12.2022 and an additional Rs. 2,00,000/- on 21.02.2023, over and above\n                          the already paid settlement amount.\n\n14.   The petitioner has claimed that he has been dragged into false and\n                          frivolous litigation by respondent No. 2, who is a habitual litigant. The\n                          petitioner further submits that the IDBI Bank has filed a Petition for\n                          initiating personal insolvency of the Petitioner under Section 95 of the\n                          Insolvency and Bankruptcy Code, 2016. Consequently, an Interim\n                          Moratorium has commenced under Section 96 of the Code. Once an\n                          Application under Section 95 IBC is filed, no legal actions or proceedings\n                          can be initiated or continued against the personal Guarantor for any debt.\n\n15.   Owing to the interim moratorium in effect, the Respondent No. 2 was\n                          unable to pursue or continue any civil proceedings against the Petitioner,Signature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                              Page 4 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48including the said Civil Suit. The respondent No. 2 then resorted to the\n                          present vexatious Complaint, resulting in registration of the FIR. The\n                          petitioner has claimed that the entire Settlement amount in terms of the\n                          Settlement Deed stands paid to the Respondent No. 2. Any dispute\n                          specifically in regard to this Deed, is purely Civil in nature.\n\n16.   The petitioner has asserted that the allegations in the FIR include\n                          breach of trust, cheating, forgery, criminal conspiracy, and criminal\n                          intimidation. It is alleged in the Complaint by respondent No.2 that the\n                          petitioner and his wife have committed multiple fraudulent activities and\n                          purportedly induced Respondent No. 2 to sign a settlement Agreement and\n                          addendum, promising a payment of Rs. 7 Crores. Allegedly, the Petitioner\n                          issued cheques that were dishonored due to insufficient funds, with no\n                          intention to honor the payment.\n\n17.   Further allegations are made in the Complaint that the petitioner and\n                          his wife intimidated and threatened respondent No.2 to prevent her from\n                          pursuing her legal action and coerced her into negotiating a reduction in the\n                          Settlement amount.\n\n18. It is stated in the Petition that the impugned FIR No.0126/2024 under\n                          Sections 420, 120B read with Section 34 against him and his present wife\n                          had been registered in compliance of the Order dated 28.05.2024 of the\n                          learned MM in Complaint Case bearing no. 2086/2024 titled as „Geeta\n                          Sachdev vs State of Delhi' filed by the Respondent No. 2, ex-wife of the\n                          petitioner. It is asserted that this Order has been obtained by suppressing\n                          second and final Addendum dated 11.03.2016 bearing Certification No.\n                          INDL254474609476750 e-stamped on 10.03.2016 at 6:48 which was\n                          executed between the Petitioner and the Respondent No. 2.\n\n19. It is claimed that her actions are driven by a desire to disrupt the\n                          Petitioner‟s current marital happiness and to harass them. It is a retaliatory\n                          move, aimed at causing distress and disarray in the Petitioner‟s well-\n                          established and content life, rather than to address any legitimate legal\n                          grievance.\n\n20.   It is claimed that the allegations in the Complaint pertain solely to the\n                          terms of the Settlement between the petitioner and the respondent No. 2 and\n                          non performance of the second Addendum. On these allegations, no criminal\n                          offences are made out. Hence, the petitioner has sought the quashing of the\n                          FIR. The petitioner has placed reliance onIndian Oil Corporation v. NEPC\n                          India Limited and Others2006INSC 452, State of Haryana & Ors. Vs\n                          Bhajan Lal & Ors1992 AIR 604, Vishnu Kumar Shukla & Anr. vs the State\n                          of Uttar Pradesh & Anr. Crl.Appeal No. 3618/2023,Sajjan Kumar v\n                          Central Bureau of Investigation(2010) 9 SCC 368, Vijay Kumar Ghai v.\n                          State of West Bengal2022 SCC OnLine SC 344.\n\n21.   Learned counsel for the respondent No. 2 has argued that two second\n                          Addendums were signed on 11.03.2016. The petitioner fraudulently without\n                          the respondent No. 2 being aware presented a second Addendum signed on\n                          11.03.2016 while she was under the impression of the first Addendum of the\n                          same date being the full and final Settlement.\n\n22.    She has further contended that the petitioner was regularly sending\n                          her WhatsApp messages and giving the assurance that the balance amount\n                          under the first Addendum Settlement shall be paid by him and he did make\n                          certain payments to the Respondent No. 2, who remained under a bona fide\n                          belief that the petitioner shall be honoring the said Addendum. The copies of\n                          the various WhatsApp conversations have also been tendered which areSignature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                              Page 6 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48taken on record.\n\n23. It is vehemently argued on behalf of the respondent No.2 that there is no\n                          ground for quashing of the FIR.\n\n24.   Submissions heard.\n\n25.   The petitioner and the respondent No. 2 are the divorced spouses who\n                          had multiple matrimonial litigations which finally culminated into Divorce\n                          by Mutual Consent vide Final Decree dated 11.03.2016. During their long\n                          acrimonious litigation, the parties entered into three Settlement Deeds; first\n                          being 13.08.2015, in which the petitioner had agreed to give her Rs. 5 crores\n                          and two immovable properties. This Settlement was presented at the time of\n                          First Divorce Petition and was accepted by the parties in their respective\n                          Statements before the Family Court and is not under dispute.\n\n26. The other two Agreements dated 11.03.2016, are:\n\n27.   It is not in dispute that the second Addendum dated 11.03.2016 which\n                          provided for payment of Rs. 3 crores and two properties, was presented in\n                          the Court at the time of recording of Statements of the parties under the\n                          Petition for Divorce underSection 13(B)2of Hindu Marriage Act (HMA).\n\n28.   The certified copy of the Judgement under Section (B) 2 HMA\n                          specifically records that the parties have amicably resolved all their disputes.\n                          The contents of the Second Addendum Settlement providing for totalSignature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                               Page 7 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48Settlement amount of Rs. 3 crores with two properties was specifically\n                          recorded. It is further mentioned that in terms of the second Addendum, the\n                          wife had already received Rs. 1.5 crore from the husband as was mentioned\n                          in the Petition and the statements made by the parties in the Court. Out of\n                          the remaining 1.5 crore, a sum of Rs. 1.25 crores has been deposited by way\n                          of Bank Draft bearing No. 501589 dated 10.03.2016, drawn on ICICI Bank\n                          in favor of Respondent No. 2. The balance 25 lakhs were to be paid to\n                          respondent No.2 herein at the time of quashing of FIR No. 147/2011 underSections 323/341/504IPC before the High Court of Rajasthan, Jaipur\n                          Bench. The respondent No. 2 undertook to cooperate and ensure her\n                          presence for the quashing of the FIR.\n\n29. The said Judgment further records that the parties had agreed that the\n                          petitioner/husband shall be the sole and absolute exclusive owner of\n                          residential Apartment bearing No. 1625 B Magnolias, Gold Course Road,\n                          Gurugram from the said date and that the Respondent No. 2/wife had\n                          already executed the necessary documents and Application for deletion of\n                          her name with regard to the said property. The parties undertook to\n                          cooperate with each other for implementation of the said Agreement.\n\n30.   Moreover, it was recorded that the exclusive and absolute title of\n                          commercial property bearing No. WZ-1401/2 Nangal Raya, Delhi - 110046\n                          shall also be with the petitioner. Both the parties undertook to abide by the\n                          terms and conditions of the Settlement as was mentioned in their Petition\n                          and the MOU/Addendum dated 11.03.2016 exhibited as Ex. P5. After\n                          recording the Settlement, the divorce by Mutual Consent underSection\n                          13(B)2HMA, was granted.\n\n31.   It is evident that the terms of this Settlement were specificallySignature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                             Page 8 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48reproduced and the documents exhibited. In fact,         there was a specific\n                          reference that the total cash amount agreed was Rs. 3 crores out of which\n                          Rs. 1.5 crores already stood paid while Rs. 1.25 crores were deposited to be\n                          released to the respondent No. 2, only after execution of the requisite title\n                          documents. Having made specific statements and exhibiting the Agreement\n                          as Ex. P-5, the respondent No. 2 cannot now either deny or challenge the\n                          Judgement which has never been challenged by respondent No. 2 till date.\n                          The contents of this Settlement, which were endorsed and accepted by the\n                          Parties before the Court, was duly acted upon and the Divorce was granted.\n                          The contention of the respondent No. 2 that she has been cheated or\n                          defrauded or was not aware that the second Addendum stamped at 6:48 PM\n                          was not presented before the family court is behest of any logic especially\n                          when the Order granting the Divorce repeated and affirmed the contents of\n                          the Settlement in detail.\n\n32.   There being specific reproduction and re affirmation by the parties of\n                          the terms of the Agreement, it cannot be said that she was misled or the\n                          terms of the Settlement were misrepresented to her. Therefore, it has to be\n                          held that this second Addendum dated 11.03.2006 signed by the Parties at\n                          the same time, signatures on which are not denied by her, was a binding\n                          Settlement.\n\n33.    The next question which arises is the validity of the first Addendum\n                          e-stamped at 6:46 PM on 11.03.2016. 27.       Apparently, it seems that the\n                          parties arrived at two Addendum Settlements each of which were\n                          independent; one for the purpose of taking divorce by Mutual Consent while\n                          the other was for Settlement of other disputes, claims in respect of money\n                          and properties. In any case, it is a question of interpretation of the intentionSignature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                               Page 9 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48of the parties, which they are at liberty to establish in the appropriate Civil\n                          Litigation. There is nothing to show that the second Addendum had\n                          superseded the first Addendum. This is further corroborated by the fact that\n                          the respondent No. 2 never sought repudiation of this Agreement, which was\n                          the basis of divorce by mutual consent.\n\n34.    Apparently, the two Addendums signed on 11.03.2016 were intended\n                          to be independent of each other; while the second Addendum became the\n                          basis for Divorce by Mutual Consent, the grievance against first addendum\n                          has been raised only in 2024 by filing a Complaint for registration of FIR.\n\n35. Pertinently, this second Addendum which became the basis of divorce by\n                          Mutual Consent does not find any mention in the FIR, which is purely\n                          confined to the first Addendum.\n\n36. It is evident that the entire grievance of the respondent No. 2 is in regard\n                          to the non compliance of the First Addendum Settlement dated 11.03.2016.\n                          The parties have voluntarily entered into it and whatever be the implications,\n                          they are essentially civil in nature. Breach of a Settlement would entail only\n                          civil liabilities; the essential ingredient of dishonest or fraudulent intention\n                          which are the foundation for an offence of Cheating or Breach of Trust, are\n                          essentially missing in the present FIR. Significantly, while the Addendum\n                          Agreement is of 2016, the Criminal Complaint alleging fraud and breach of\n                          Trust vis. a viz. this Agreement, has been filed only in 2024 i.e. after eight\n                          years of its execution, leading to registration of impugned FIR.\n\n37.   Consequently, the FIR No. 0126/2024 dated 31.05.2024 is hereby\n                          quashed along with all the proceedings emanating therefrom, leaving the\n                          parties to pursue their civil litigation and other litigation underSection 138NI Act, which have already been initiated.\n\n38.   It is hereby stated that observations made herein is for the purpose of\n                          the present petition and are not an expression on the merits of the Settlement\n                          Deeds.\n\n39.   The Petition along with other Application, if any is accordingly\n                          disposed of.\n\n(NEENA BANSAL KRISHNA)\n                                                                              JUDGE\n                          SEPTEMBER 17, 2024/PTSignature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                              Page 11 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48"
    },
    {
        "title": "Meet 'inverter man of India', whose one mistake led to ...",
        "link": "https://www.dnaindia.com/business/report-meet-inverter-man-of-india-kunwer-sachdev-whose-one-mistake-led-to-downfall-of-26-year-old-company-he-is-3111928",
        "date": "Oct 7, 2024",
        "source": "DNA India",
        "snippet": "Kunwer Sachdev, known as the 'Inverter Man of India,' made a significant impact on the country with his company, Su-Kam. Founded 26 years ...",
        "content": "BUSINESS\n\nHis journey from creating a revolutionary product to losing his company and rebuilding his career shows resilience\n\nShivam Verma\n\nUpdated :Oct 07, 2024, 09:46 AM IST\n\nKunwer Sachdev, known as the ‘Inverter Man of India,’ made a significant impact on the country with his company, Su-Kam. Founded 26 years ago, Su-Kam was the first to manufacture power backup inverters, solving India's power crisis during the 1990s. Sachdev’s innovative inverters became household essentials, not just in India but also in countries like Nepal, Bangladesh, and parts of Africa.\n\nHowever, Su-Kam faced a downfall when it was declared bankrupt after defaulting on a Rs 240 crore loan. Although the company had assets to repay the loan, legal troubles arose, leading to its closure. Distributors and customers were left without service, and Sachdev’s reputation was severely affected.\n\nDespite these challenges, Sachdev did not give up. His wife, Khushboo, encouraged him to start a new venture. Together, they launched Su-vastika, providing services to customers and applying for patents on innovative products.\n\nSo far, six out of the 60 patents applied for have been granted. Sachdev continues to serve as a mentor, bringing his years of experience to the new company.\n\nSachdev’s journey from creating a revolutionary product to losing his company and rebuilding his career shows resilience. Su-vastika now offers a range of services to dealers and customers, keeping Sachdev’s legacy alive in the power backup industry.\n\nSocial worker Ritu Narang wins 'Spirit of Yoga' award at DNA Women Achievers Awards 2025\n\nVersha Verma, Lucknow-based judo player and poet, wins 'Humanitarian of the Year' at DNA Women Achievers Awards 2025\n\n13 soldiers killed, 6 children injured in suicide bombing in Pakistan, here's what we know so far\n\nPankaj Bhadouria wins Super Chef of the Year award at DNA Women Achievers Awards 2025\n\nPadma Shri Dr Soniya Nityanand wins 'Light of India' award at DNA Women Achievers Awards 2025\n\nWarren Buffett takes big decision, donates Rs 51000 crore in Berkshire Shares to..., reason is...\n\nSuparna Sarkar wins Breaking Barriers award at DNA Women Achievers Awards 2025\n\nViral Video: Owner of Mahindra Scorpio parks car in an unusual place, internet jokes, 'Show room feeling'\n\nMLC 2025: Shimron Hetmyer does THIS against Kieron Pollard on last ball during Seattle Orcas vs MI New York match\n\nTrapped in Rs 499 EMIs: The silent financial crisis of India’s young generation\n\nShah Rukh Khan's KKR star batter to join Uttar Pradesh education department, Yogi govt to give him salary of Rs..., he is...\n\nSwati Kapoor, who provides 'Thaal Sewa' to over 1200 people daily, wins 'Social Worker of the Year' at DNA Women Achievers Awards 2025\n\n'Kashi Ki Didi' Ranjubala Singh wins 'Warrior Spirit' award at DNA Women Achievers Awards 2025\n\nICAI to cap individual CA annual audits to 60, from..., president says, ‘CA can also carry out...’\n\nWho is Elizabeth MacDonough? Senate Parliamentarian blocking US President Donald Trump's 'Big, Beautiful bill', can delay the bill beyond deadline of....\n\nAkshara Singh wins Powerhouse Performer of the Year at DNA Women Achievers Awards 2025\n\nKavya Maran's SRH star player grooves to THIS viral song in rickshaw in England, video goes viral, watch\n\nCricketer Virat Kohli has a massive earning from social media, his one Instagram post earns him Rs..., know his latest venture\n\nMeet actress who worked with Kareena Kapoor, Hrithik Roshan, Madhuri Dixit, faced casting couch in the South, received email demanding..., her name is..\n\nBad news for Team India as Jofra Archer likely to return for IND vs ENG match at Edgbaston\n\nBig tension for China, India signs this big deal with Sri Lanka, aim is to..., it will ensure...\n\nDonald Trump wanted Princess Diana to be..., regrets this one thing about her who once said, ‘he gives me...’\n\nThis family keeps 900-year-old heritage of sarees alive, price starts from Rs 1.5 lakh, has this link with Mukesh Ambani's wife Nita Ambani, it is...\n\nThis is world's most valuable company, not owned by Mukesh Ambani, Gautam Adani, Elon Musk, Mark Zuckerberg, Jeff Bezos, total market value is..., name is...\n\nJasprit Bumrah to miss crucial Edgbaston Test? Here's what we know so far\n\nShefali Jariwala's death 'suspicious'? Police launch preliminary investigation as husband Parag Tyagi makes first appearance with..., search her house, question..\n\nMeet royal princess who travelled world, founded organisation that helps..., owns biggest hotel chain in....\n\nChinese flight forced to make emergency landing due to...., passengers say 'plane started shaking...'\n\nIndia's Brahmos vs US' Tomahawk: Know which is more powerful cruise missile\n\nAnother big move by Kumar Mangalam Birla, set to acquire this American company for Rs 10740 crore, it is..., plans to...\n\nOver 3500 Indian millionaires are expected to relocate abroad in 2025 with their staggering wealth of Rs...., migrating to...\n\nIleana D’Cruz welcomes second child with Michael Dolan, names him..., shares first photo\n\nWho is Parag Tyagi? Shefali Jariwala’s husband first met her at dinner party, worked with Amitabh Bachchan in..., has special connection to Sushant Singh Rajput\n\n‘Was under pressure...’: Shefali Jariwala suffered from this neurological disease for 15 years\n\nCommon links between Shefali Jariwala and Sidharth Shukla's death revealed: Cardiac arrest, Bigg Boss 13, and...\n\n'6,6,6,6,6...': Vaibhav Suryavanshi's explosive batting helps India U19 to register comfortable win over England U19\n\nWho is Queen Maxima, lady whose NATO Summit photos went viral, allegedly mocked Donald Trump due to...\n\nKaanta Laga, Bigg Boss 13 fame Shefali Jariwala dies at 42, cause of death revealed to be..., suffered since age of 15 from..\n\nDonald Trump wants full removal of trade barriers in India deal, says Unthinkable, but...'\n\nBad news for Bangladesh, Modi govt bans import of these items via land routes amid strained ties, list includes...\n\nMeet woman, who took inspiration from Virat Kohli's hard work, studied for over 12 hours a day, cracked UPSC exam in first attempt with AIR..., her name is...\n\nAhead of assembly elections, Bihar becomes 1st Indian state to allow e-voting through app, but only available for..., step-by-step guide to register\n\nThis expressway to get India's first AI-powered smart traffic system, can catch violators by detecting..., know complete features\n\nIndia to boost its air defence with Tejas Mk-1A, know their match against F-16, JF-17, Rafale fighter jets\n\nNeeraj Chopra achieves BIG milestone, reclaims number one spot in javelin throw rankings, Pakistan's Arshad Nadeem is at...\n\nIran calls out US President Donald Trump's 'disrespectful' tone towards Supreme Leader Ali Khamenei, says, 'Put aside or...'\n\nDonald Trump issues big warning to Iran, says he will bomb Tehran again ‘without question’ if it continues to...\n\nShefali Jariwala, Kanta Laga and Bigg Boss 13 fame, passes away at 42: Report\n\nDiscover actual location of Panchayat's Phulera Village, X user shares real pictures, now going viral, it is in...\n\nBigg Boss 17 couple Aishwarya Sharma, Neil Bhatt headed for divorce? Actress breaks silence: 'Just because someone is...'\n\nMeet actress, class 12 topper, once a UPSC aspirant, later landed roles alongside John Abraham, Shahid Kapoor,\n\nKannappa box office collection day 1: Akshay Kumar, Prabhas, Mohanlal, Vishnu Manchu-starrer fails to get double-digit opening, earns just Rs...\n\n'It's not easy to...': Ex-India coach fires back at Yashasvi Jaiswal's critics after Leeds fielding nightmare\n\nComplaint filed against this Indian actor for supporting Diljit Dosanjh, Pakistani artists: 'Why these double standards...'\n\nNeeraj Chopra’s BIG surprise to fan after his NC Classic event wish, he offers him...\n\nViral video: IndiGo passenger caught trying to steal life jacket: 'Indians can't be defended'\n\n'Sahi track pe...': Prithvi Shaw reveals Sachin Tendulkar's powerful message sparking his revival\n\nNot Aamir Khan, Ranbir Kapoor, Alia Bhatt, Deepika Padukone; this Bollywood actor has been invited to join the Academy for Oscars 2026 voting\n\nViral video: Australian vlogger criticised for highlighting Delhi's Ghazipur garbage dump, WATCH\n\nGautam Adani’s Adani Power gives massive order of Rs 6500 crore to this company for the construction of...\n\nMeet man who, studied at IIT Kanpur, now joins Meta’s Superintelligence team after leaving OpenAI, he is...\n\nDNA TV Show: Months after RG Kar horror, another rape at Kolkata's Law College puts TMC in docks\n\nVaibhav Suryavanshi dons Virat Kohli's iconic No.18 jersey, smashes 48 off just 19 against England U19 in 1st Youth ODI\n\nJitendra Kumar is highest-paid actor in Panchayat Season 4, know how much Sachiv Ji earned in 8 episodes, net worth is...\n\nIran-Israel War: Iran's BIG statement on talks with US, says, 'Would like to state clearly that...'\n\n'Is it legal': Frustrated by housing prices, man asks if he can live on houseboat full-time\n\nIran’s Ali Khamenei declares ‘victory’ says ‘US intervention prevented Israel from...’, criticises Donald Trump of...\n\nNo India vs Pakistan in Asia Cup 2025? Broadcaster's social media poster sparks speculations\n\n‘Raw talent’: Man dances like MJ to ‘Chaiyya Chaiyya’ with kids, viral video hits 19 million views, WATCH\n\nZohran Mamdani’s old video slamming PM Modi goes viral, calls him..., netizens condemn remarks, ‘spreading fake news’\n\nHe is world's richest beggar, owns two flats in Mumbai, his net worth is...\n\nIran-Israel War: India's FIRST statement after ceasefire between Iran, Israel, says, 'Iran's perspective and thinking...'\n\nMillionaire migration 2025: 10 countries wealthy people are choosing to call home, check list\n\nThe Family Man Season 3 first look: Jaideep Ahlawat, Nimrat Kaur join Manoj Bajpayee; Prime Video show to release on...\n\n'There was threat': Rohit Sharma's shocking hotel revelation before T20 World Cup 2024 match vs Pakistan\n\nWill Donald Trump deport Zohran Mamdani? Indian-origin Democrat can become first Muslim mayor of...\n\nKolkata Law College Rape: TMC MP Kalyan Banerjee's SHOCKING advise to women, says, 'they should be...'\n\nTHIS Islamic nation plans to implement four-working-day system from..., employees will get three week offs! Not Pakistan, Saudi Arabia, Iran, it is...\n\n‘DeepSeek not been able to provide...’: German Federal agency pushes Google, Apple to remove China’s AI service, gives warning of...\n\nKalki 2 in the works? Amitabh Bachchan drops BIG hint about sequel of Prabhas, Deepika Padukone film: 'If they were to...'\n\n'If Lord Ganesha did not let Shiv Ji...': Pavitra Punia objects to male priests changing clothes of goddesses in temples\n\nIND vs ENG Edgbaston Test: Rishabh Pant set to join elite list of players including Sir Don Bradman if...\n\nSay no to frizz this rainy season: 7 effortless ways to keep your hair sleek\n\nTHESE countries helped Israel build atom bombs! How did India,  Nehru keep Jewish state on sidelines? Tel Aviv has... nuclear bombs\n\nJeff Bezos and Lauren Sanchez's pre-wedding party hit by heavy rain, thunderstorm, star-studded event cut short\n\nSHOCKING! West Indies' Gabba star embroiled in sexual harassment claims amid ongoing Australia Test series\n\nMeet man who once was monk, later returned home, now owns empire worth Rs 120 crore, he is...\n\nKolkata SHOCKER! Victim wept, touched his feet, pleaded with folded hands, but TMC leader did not let her go and...\n\nJeff Bezos’s fiancé Lauren Sanchez has a long portfolio, is trained in...,owns big business, her net worth is Rs...\n\nNeeraj Chopra’s heartfelt gesture wins internet after India’s Golden Boy does THIS for a fan seeking Rs 2,000 for…\n\n'Ronit Roy has villas, Sakshi Tanwar has enough money for six generations': Ram Kapoor reveals secret behind wealth of TV stars\n\nMeet Microsoft employee who was laid off after 23 years of service, still continues to go to office, because of...\n\nEngland Women vs India Women, 1st T20I live streaming: When and where to watch on TV and online\n\nMukesh Ambani calls this Reliance investment ‘biggest risk’ of his life but worth taking because...\n\nJanaki Vs State of Kerala: Malayalam film federation calls CBFC demand 'disturbing', condemns 'random takes' on films\n\nDhanush, Nayanthara, Ravi Mohan unite with top South directors, 10 ambitious films in 2 years for...\n\nIran-Israel War: Israel's BIG revelation days after ceasefire, says, 'If Khamenei had been...'\n\n'Saath dena hoga': Mohammed Shami calls out Prasidh, Siraj after Headingley loss, urges pacers to lift burden on Jasprit Bumrah\n\n'That's loo and order': Video of man joining Gujarat high court hearing from toilet goes viral\n\nDharmendra was highest-paid actor for Sholay, received Rs 1.5 lakh to play Veeru, Amitabh Bachchan got just Rs..., lowest earning cast member earned only Rs 35000, name is.."
    },
    {
        "title": "Su-kam Story by the Inverter Man of India – Kunwer Sachdev",
        "link": "https://solarclap.com/su-kam-story-by-kunwer-sachdev/",
        "date": "N/A",
        "source": "SolarClap",
        "snippet": "Explore the mind of a visionary as we chat with the Inverter Man of India about his transformative journey from lead-acid to lithium ...",
        "content": "Explore the mind of a visionary as we chat with the Inverter Man of India about his transformative journey from lead-acid to lithium batteries.\n\nHear about the hurdles he overcame, the lessons he learned, and his perspective on the future of the energy industry.\n\nPerfect for those interested in technological advancements and entrepreneurial spirit in the renewable energy landscape.\n\nComment\n\nSave my name, email, and website in this browser for the next time I comment.\n\n🌞 India's Top Sustainable Living Platform"
    },
    {
        "title": "kunwer sachdev",
        "link": "https://www.indiacontent.in/kunwer-sachdev/pr-797648/",
        "date": "N/A",
        "source": "India Content",
        "snippet": "Kunwer Sachdev 42 Chairman of Su Kam Power Systems has a current turnover of Rs 430 crore. He started a business manufacturing cable equipment but with no ...",
        "content": "Common uses include:Newspapers and magazines (except for covers), editorial broadcasts, documentaries, non-commercial websites, blogs and social media posts illustrating matters of public interest\n\nCan't be used for:Commercial purposes, trademarks, merchandising, marketing and promotions, endorsements purposes in any media.\n\nStandard editorial rights:You or anyone in your organisation or your subcontractor can use it for a single context which may then be reproduced worldwide for a period of 15 (fifteen) years, in any media for internal; non-commercial purposes. [Common uses include: Internal/within company communications, non-commercial blogs, non-commercial websites, newspapers and magazines (except for covers), editorial broadcasts, documentaries, print and digital media for matters of public interest].\n\nCopyright © 2025 Living Media India Limited. For reprint rights:Syndications Today.\n\nGo to Top"
    },
    {
        "title": "About « KUNWER SACHDEVA - WordPress.com",
        "link": "https://aboutkunwersachdev.wordpress.com/about/",
        "date": "N/A",
        "source": "WordPress.com",
        "snippet": "Kunwar Sachdeva, the Founder and MD of Su-Kam, is popularly known as the inverter man of India who revolutionized the inverter industry. A DU law graduate ...",
        "content": "Founder & CEO of Su-Kam Power Systems\n\nHome»About\n\nKunwar Sachdeva\n\nFounder & MD of Su-Kam Power Systems\n\nKunwar Sachdeva, the Founder and MD of Su-Kam, is popularly known as the inverter man of India who revolutionized the inverter industry. A DU law graduate determined to bring about new technology and innovation to the inverter industry in India and to organize the same; he sowed the seeds of Su-Kam and created a new breed of problem-free inverters called Su-Kam.\n\n[…] About […]\n\nΔ\n\nBlog at WordPress.com."
    },
    {
        "title": "Kunwer Sachdev",
        "link": "https://www.saurenergy.com/tag/kunwer-sachdev",
        "date": "N/A",
        "source": "Saur Energy International",
        "snippet": "By Kunwer Sachdev India's interest in adopting clean mobility is now firm and clear. The government of India has taken steps towards encouraging an EV ecosystem ...",
        "content": "Home»Kunwer Sachdev\n\nBy Kunwer Sachdev With the immediate and critical need to move to alternative sources of energy worldwide, battery technology is being explored massively. As an alternative, it can support the de-carbonization of the transportation sector. It can evolve from the current lithium-ion battery to the succeeding generation to all-solid-state batteries. It will bring an improved […]\n\nBy Kunwer Sachdev India’s interest in adopting clean mobility is now firm and clear. The government of India has taken steps towards encouraging an EV ecosystem in the country through the FAME policies, reduction of GST on EVs, and most recently, the Production Linked Incentives. The idea is to create an economic environment for EV […]\n\nDuring Intersolar 2017 meet in Mumbai, Su-Kam showcased its products that are designed to make life of customers comfortable and hassle-free, and have potential to reduce the country’s carbon footprint. Su-Kam Power Systems Ltd, one of India’s leading companies in power-backup and solar solutions showcased its state-of-the-art range of products at Intersolar 2017 India meet […]\n\nThe solar industry is churning new dialogues to woo clean energy and become self-reliant for all the modern power needs. When modules gets nodal nudge the billion-dollar market influxes with a proficient game-plan. Climate change concerns, state initiatives including solar portfolio standards, and consumer efforts are resulting in increased deployments of clean technologies. Solar photovoltaics […]\n\nRecently, Su-Kam released a documentary, highlighting the enormous work-embraced to solarize the remote villages of the nation. The company is altering the lives of numerous numbers of people in the remote towns of the nation by leveraging power through solar energy. The future of many people living in countryside areas, for example Patewara in Uttar […]\n\nWe are India's leading B2B media house, reporting full-time on solar energy, wind, battery storage, solar inverters, and electric vehicle (EV) charging. Our dedicated news portal, monthly magazine, and multimedia products increase our coverage to cater to the different demands of the renewable industry.\n\nTo get in touch, contact us atinfo[at]saurenergy.com\n\nOr Call at 9891147599 / 8802315631\n\nNever miss the most relevant stories in the solar and renewable sector everyday.\n\nWe've got you covered, if you are social!  Follow @SaurEnergyfor the latest news and happenings across these  social media\n\nSubscribe to our newsletter to get the latest scoop right into your inbox."
    },
    {
        "title": "Kunwer Sachdev Vs. Su Kam Power Systems Ltd. and Ors.",
        "link": "https://ibclaw.in/kunwer-sachdev-vs-su-kam-power-systems-ltd-and-ors-supreme-court/",
        "date": "Aug 7, 2023",
        "source": "IBC Laws",
        "snippet": "2. We find no reason to interfere with the impugned order of the National Company Law Appellate Tribunal dated 03 February 2023 in Company ...",
        "content": "Password Email OTP Google Username or Email Password Remember Me   Email Send OTP Enter OTP Verify & Login Resend […]\n\nPasswordEmail OTPGoogleUsername or EmailPasswordRemember MeEmailSend OTPEnter OTPVerify & LoginResend OTP?Remember MeForgot PasswordDon't have an account?Create a new account\n\nIBC Laws prioritizes timely reporting\n\nClick here to Subscribe Now\n\nIn case you've already logged in,click hereto know why you're not able to access this content.\n\nMr. A.L Sundershan Vs. Syndicate Bank – NCLAT Chennai\n\nSanjeevani Vyapaar LLP Vs. Mr. Mahesh Ramchandra Parulekar and Anr. – Maharashtra REAT\n\nIBC Laws |All about Indian Insolvency LawsIndia’s Leading Insolvency Platform.IBC Laws® publishes case laws with case summary, legal contents, commentary, articles with extra search functions using advanced technology.\n\nCopyright © IBC Laws®. All Rights Reserved."
    },
    {
        "title": "Kunwer Sachdev Voices",
        "link": "https://timesofindia.indiatimes.com/blogs/author/kunwer-sachdev/",
        "date": "N/A",
        "source": "Times of India",
        "snippet": "The author is Entrepreneur, Innovator, Founder: Su-kam, Mentor: Su-vastika. Less. Kunwer Sachdev VOICES. Go to the profile of Kunwer Sachdev.",
        "content": "We encourage you to review ourTerms of Service, andPrivacy Policy.By continuing, you agree to the Terms listed here. In case you want to opt out, please click \"Do Not Sell or Share My Personal Information\" link  in the footer of this page.\n\nWe won't sell or share your personal information to inform the ads you see. You may still see interest-based ads if your information is sold or shared by other companies or was sold or shared previously.\n\nThe author is Entrepreneur, Innovator, Founder: Su-kam, Mentor: Su-vastika.Less\n\nKunwer Sachdev\n\nMay 6, 2023, 10:19 PM  IST\n\nJob descriptions play a critical role in the hiring process as they serve several vital functions, like defining the scope of the job. Generally, most organizations in India fail to make a job description with…\n\nMay 6, 2023, 10:19 PM  IST\n\nKunwer Sachdev\n\nAugust 6, 2022, 5:13 PM  IST\n\nUnion rural development and panchayati raj minister Giriraj Singh said at a recent conference, that India is increasing its reliance on renewable energy, intending to supply 50% of the nation’s electrical needs from renewable sources…\n\nAugust 6, 2022, 5:13 PM  IST\n\nKunwer Sachdev\n\nFebruary 6, 2022, 9:33 PM  IST\n\nA patent is an exclusive right to an inventor for a product, design, invention, or process that generally provides a new way of doing something or offers a new technical solution to a problem. It…\n\nFebruary 6, 2022, 9:33 PM  IST\n\nInterested in blogging for timesofindia.com? We will be happy to have you on board as a blogger, if you have the knack for writing. Just drop in a mail attoiblogs@timesinternet.inwith a brief bio and we will get in touch with you.\n\nTOI Edit Page,Voices\n\nErratica,TOI Edit Page,Tracking Indian Communities\n\nJuggle-Bandhi,TOI Edit Page\n\nTOI Edit Page"
    },
    {
        "title": "Kunwer Sachdev: Founder & MD, Su-Kam Power Systems ...",
        "link": "https://powerline.net.in/2017/07/08/kunwer-sachdev/",
        "date": "Jul 8, 2017",
        "source": "Power Line Magazine",
        "snippet": "Sachdev has a degree in mathematical statistics and law from Delhi University. In 1998, he ventured into the power backup solutions business, ...",
        "content": "Kunwer Sachdev, founder and managing director, Su-Kam Power Systems Limited, has helped catapult the company from a start-up to one of the fastest growing companies in the country in a short span of time. Born in a middle-class family in Delhi, Sachdev, with no technological background, founded a company that is today known for its technologically advanced products.\n\nSachdev has a degree in mathematical statistics and law from Delhi University. In 1998, he ventured into the power backup solutions business, sett-ing up Su-Kam. Today, the company has operations across 90 countries. Prior to this, he was involved in the cable television business. Under Sachdev’s leadership, Su-Kam has achieved several firsts to its credit. It has filed over 100 patents for technology and design in the power backup industry, the highest for any Indian company. It has also launched the world’s first plastic-body inverter, which has been declared as the Innovation of the Decade by India Today. “These innovations were possible only due to the robust research and development unit of Su-Kam. Innovation and sophistication in products is my passion,” says Sachdev.\n\nHe sees scope for major growth in the solar power space. He has led the development of innovative solar solutions – off-grid and on-grid systems –  to cater to the needs of a range of consumers.\n\nOn the state of the power sector, Sachdev says, “Electricity is critical to power the economic growth of the country. India is on the road to development, but to accelerate growth, it is critical to ensure the availability of uninterrupted power supply. In today’s scenario, we lack the infrastructure to meet the growing demand for power.” He further underscores the importance of renewable energy to offset the demand for conventional fuels as well as to pave the way for cleaner solutions. “A green economy is the need of the hour,” he says.\n\nSachdev also has a flair for marketing, which has led him to launch several innovative branding initiatives for the company. Moreover, he sees internal branding as an important strategy to engage with employees. His peers see him as a leader, who has a novel approach towards solving tough problems. He is also an ardent sports enthusiast, with swimming and running being his favourites. Going forward, Sachdev aims to make Su-Kam a market leader in technology and innovation or “technovation”, as he calls it.\n\nSubscribeSeptember Issue\n\nCOPYRIGHT © 2017-2022  | POWER LINE\n\nGET ACCESS TO OUR ARTICLESEnter your email addressSubscribe to NewsletterPlease leave this field empty.Δ\n\nGET ACCESS TO OUR ARTICLES\n\nEnter your email address\n\nΔ\n\nError:Contact form not found.\n\nError:Contact form not found.\n\nError:Contact form not found.\n\nDownload Rate Card for Overseas Companies\n\nVerify Code (required)\n\nΔ\n\nDownload Rate Card for Indian Companies\n\nVerify Code (required)\n\nΔ\n\nError:Contact form not found.\n\nError:Contact form not found.\n\nΔ\n\nError:Contact form not found.\n\nΔ"
    },
    {
        "title": "Kunwer Sachdev vs The State Govt Of Nct Of Delhi & Anr. ...",
        "link": "https://indiankanoon.org/doc/95680050/",
        "date": "Sep 17, 2024",
        "source": "Indian Kanoon",
        "snippet": "The petitioner, Mr. Kunwer Sachdev was married to respondent No. 2 Ms. Geeta Sachdev on 25.09.1987 according to Hindu rites and ceremonies at Arya Samaj Mandir ...",
        "content": "Take notes as you read a judgment using ourVirtual Legal Assistantand get email alerts whenever a new judgment matches your query (Query Alert Service). Try out ourPremium Member Services--Sign up todayand get free trial for one month.\n\n1.     The Petition under Section 528 of BNSS, 2023 has been filed on\n                          behalf of the petitioner for quashing of FIR No. 0126/2024 dated 31.05.2024\n                          under Sections 420, 120B read withSection 34of Indian Penal Code, 1860Signature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                           Page 1 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48(\"IPC\" hereinafter) , registered at Police Station Connaught Place, New\n                          Delhi.\n\n2.       Learned counsel for the respondent No. 2 has appeared on advance\n                          Notice.\n\n3.       Briefly stated the petitioner, Mr. Kunwer Sachdev was married to\n                          respondent No. 2 Ms. Geeta Sachdev on 25.09.1987 according to Hindu rites\n                          and ceremonies at Arya Samaj Mandir, Mandir Marg, New Delhi. Two sons,\n                          Kanav and Shourya were born from their wedlock. However, due to ongoing\n                          disputes and quarrels, the parties have been living separately since\n                          September 2009 and have not been able to reconcile their differences.\n\n4.       The petitioner and respondent No. 2 jointly filed a Petition underSection 13(B)of the Hindu Marriage Act, 1955 (\"HMA,1955\" hereinafter)\n                          before the Family Court, New Delhi. They entered into a Settlement and it\n                          was agreed that the Petitioner would pay a settlement amount of Rs.\n                          5,00,00,000/- and transfer complete rights, titles, and ownership of two\n                          immovable properties: one commercial property bearing No. WZ- 1402/1,\n                          Nangal Raya, Delhi-110046, and another residential property bearing No. F-\n                          37, Greenwood City, Gurgaon, Haryana in favour of Respondent No. 2.\n\n5.       The parties accepted the Settlement Deed dated 13.08.2015 in their\n                          respective statements and first motion of divorce underSection 13B(1)of\n                          the HMA, 1955 was allowed by the Order dated 14.08.2015.\n\n6.       In furtherance of the Settlement Deed, parties signed two addendum\n                          Agreements both dated 11.03.2016. The first Addendum Agreement was e-\n                          stamped at 6:46 PM and the second was e- stamped on 11.03.2016 at 6:48\n                          PM. There were thus, two Addendum Agreements signed on the same day e-\n                          stamped at a gap of two minutes.\n\n7. The second Addendum Agreement was presented before the Family Court\n                          in the second Petition for Divorce underSection 13(B)(2)of HMA wherein\n                          parties made their detailed statements endorsing the second Addendum\n                          Agreement and also deposed about the details of the Settlement. The\n                          statements were accepted and it was mentioned in the Order dated\n                          11.03.2016 that full and final settlement amount of Rs. 3 crores has been\n                          received by the respondent No. 2. The Divorce by Mutual Consent underSection 13(B)(2)of HMA, 1955 was accordingly given to the parties.\n\n8.    The petitioner has claimed that during the Divorce proceedings, he\n                          was unable to retrieve the cheques issued to respondent No. 2 in pursuance\n                          of the first Addendum. However, these cheques were wrongly deposited by\n                          her despite there being no underlying liability. In light of the final Second\n                          Addendum Agreement, she ought to have returned the cheques. But she has\n                          manipulated the facts to her advantage in order to coerce the petitioner and\n                          to extract more money.\n\n9. The respondent No. 2 filed a Complaint underSection 138of the\n                          Negotiable Instruments Act, 1881 against the Petitioner for dishonour of\n                          above-mentioned       cheques   vide    Complaint     case    bearing        no.\n                          NACT/10395/2016 and NACT/10396/2016 which are pending adjudication\n                          before Hon‟ble Chief Judicial Magistrate, Gurugram.\n\n10. The respondent No.2 has also filed a Civil Suit (Original Side) bearing\n                          No. 398/2019 underOrder XXXVII of the Code of Civil Procedure, 1908\n                          seeking recovery of Rs. 4,05,00,000/- along with pendent lite and future\n                          interest @12% p.a..\n\n11.   Additionally, at the behest of Respondent No. 2, the distinguished\n                          Publication houses, Times of India and The Hindu, published defamatorySignature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                             Page 3 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48Articles   concerning   the   Petitioner.   The   Petitioner   submitted      his\n                          representation to these publication houses requesting them for the removal\n                          of the Articles.\n\n12.   The petitioner has claimed that the present Complaint Case bearing\n                          No. 2086/2024 under Sections 420, 120B read with Section 34 was yet\n                          another attempt by respondent No.2 to harass the petitioner. The respondent\n                          No. 2 by relying on the first Addendum read with the final Settlement, has\n                          sought to portray the petitioner has committed criminal breach of trust and\n                          cheating. She has concealed the second Addendum entered into between the\n                          parties. Moreover, he has impleaded Smt. Khushboo Sachdev, the second\n                          wife of the petitioner in the impugned F.I.R., even though she has no\n                          concern with any of this controversy.\n\n13.   The petitioner exhausted by the continuous harassment and hoping to\n                          achieve peace, the Petitioner paid the Respondent No. 2 Rs. 5,00,000/- on\n                          28.12.2022 and an additional Rs. 2,00,000/- on 21.02.2023, over and above\n                          the already paid settlement amount.\n\n14.   The petitioner has claimed that he has been dragged into false and\n                          frivolous litigation by respondent No. 2, who is a habitual litigant. The\n                          petitioner further submits that the IDBI Bank has filed a Petition for\n                          initiating personal insolvency of the Petitioner under Section 95 of the\n                          Insolvency and Bankruptcy Code, 2016. Consequently, an Interim\n                          Moratorium has commenced under Section 96 of the Code. Once an\n                          Application under Section 95 IBC is filed, no legal actions or proceedings\n                          can be initiated or continued against the personal Guarantor for any debt.\n\n15.   Owing to the interim moratorium in effect, the Respondent No. 2 was\n                          unable to pursue or continue any civil proceedings against the Petitioner,Signature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                              Page 4 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48including the said Civil Suit. The respondent No. 2 then resorted to the\n                          present vexatious Complaint, resulting in registration of the FIR. The\n                          petitioner has claimed that the entire Settlement amount in terms of the\n                          Settlement Deed stands paid to the Respondent No. 2. Any dispute\n                          specifically in regard to this Deed, is purely Civil in nature.\n\n16.   The petitioner has asserted that the allegations in the FIR include\n                          breach of trust, cheating, forgery, criminal conspiracy, and criminal\n                          intimidation. It is alleged in the Complaint by respondent No.2 that the\n                          petitioner and his wife have committed multiple fraudulent activities and\n                          purportedly induced Respondent No. 2 to sign a settlement Agreement and\n                          addendum, promising a payment of Rs. 7 Crores. Allegedly, the Petitioner\n                          issued cheques that were dishonored due to insufficient funds, with no\n                          intention to honor the payment.\n\n17.   Further allegations are made in the Complaint that the petitioner and\n                          his wife intimidated and threatened respondent No.2 to prevent her from\n                          pursuing her legal action and coerced her into negotiating a reduction in the\n                          Settlement amount.\n\n18. It is stated in the Petition that the impugned FIR No.0126/2024 under\n                          Sections 420, 120B read with Section 34 against him and his present wife\n                          had been registered in compliance of the Order dated 28.05.2024 of the\n                          learned MM in Complaint Case bearing no. 2086/2024 titled as „Geeta\n                          Sachdev vs State of Delhi' filed by the Respondent No. 2, ex-wife of the\n                          petitioner. It is asserted that this Order has been obtained by suppressing\n                          second and final Addendum dated 11.03.2016 bearing Certification No.\n                          INDL254474609476750 e-stamped on 10.03.2016 at 6:48 which was\n                          executed between the Petitioner and the Respondent No. 2.\n\n19. It is claimed that her actions are driven by a desire to disrupt the\n                          Petitioner‟s current marital happiness and to harass them. It is a retaliatory\n                          move, aimed at causing distress and disarray in the Petitioner‟s well-\n                          established and content life, rather than to address any legitimate legal\n                          grievance.\n\n20.   It is claimed that the allegations in the Complaint pertain solely to the\n                          terms of the Settlement between the petitioner and the respondent No. 2 and\n                          non performance of the second Addendum. On these allegations, no criminal\n                          offences are made out. Hence, the petitioner has sought the quashing of the\n                          FIR. The petitioner has placed reliance onIndian Oil Corporation v. NEPC\n                          India Limited and Others2006INSC 452, State of Haryana & Ors. Vs\n                          Bhajan Lal & Ors1992 AIR 604, Vishnu Kumar Shukla & Anr. vs the State\n                          of Uttar Pradesh & Anr. Crl.Appeal No. 3618/2023,Sajjan Kumar v\n                          Central Bureau of Investigation(2010) 9 SCC 368, Vijay Kumar Ghai v.\n                          State of West Bengal2022 SCC OnLine SC 344.\n\n21.   Learned counsel for the respondent No. 2 has argued that two second\n                          Addendums were signed on 11.03.2016. The petitioner fraudulently without\n                          the respondent No. 2 being aware presented a second Addendum signed on\n                          11.03.2016 while she was under the impression of the first Addendum of the\n                          same date being the full and final Settlement.\n\n22.    She has further contended that the petitioner was regularly sending\n                          her WhatsApp messages and giving the assurance that the balance amount\n                          under the first Addendum Settlement shall be paid by him and he did make\n                          certain payments to the Respondent No. 2, who remained under a bona fide\n                          belief that the petitioner shall be honoring the said Addendum. The copies of\n                          the various WhatsApp conversations have also been tendered which areSignature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                              Page 6 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48taken on record.\n\n23. It is vehemently argued on behalf of the respondent No.2 that there is no\n                          ground for quashing of the FIR.\n\n24.   Submissions heard.\n\n25.   The petitioner and the respondent No. 2 are the divorced spouses who\n                          had multiple matrimonial litigations which finally culminated into Divorce\n                          by Mutual Consent vide Final Decree dated 11.03.2016. During their long\n                          acrimonious litigation, the parties entered into three Settlement Deeds; first\n                          being 13.08.2015, in which the petitioner had agreed to give her Rs. 5 crores\n                          and two immovable properties. This Settlement was presented at the time of\n                          First Divorce Petition and was accepted by the parties in their respective\n                          Statements before the Family Court and is not under dispute.\n\n26. The other two Agreements dated 11.03.2016, are:\n\n27.   It is not in dispute that the second Addendum dated 11.03.2016 which\n                          provided for payment of Rs. 3 crores and two properties, was presented in\n                          the Court at the time of recording of Statements of the parties under the\n                          Petition for Divorce underSection 13(B)2of Hindu Marriage Act (HMA).\n\n28.   The certified copy of the Judgement under Section (B) 2 HMA\n                          specifically records that the parties have amicably resolved all their disputes.\n                          The contents of the Second Addendum Settlement providing for totalSignature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                               Page 7 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48Settlement amount of Rs. 3 crores with two properties was specifically\n                          recorded. It is further mentioned that in terms of the second Addendum, the\n                          wife had already received Rs. 1.5 crore from the husband as was mentioned\n                          in the Petition and the statements made by the parties in the Court. Out of\n                          the remaining 1.5 crore, a sum of Rs. 1.25 crores has been deposited by way\n                          of Bank Draft bearing No. 501589 dated 10.03.2016, drawn on ICICI Bank\n                          in favor of Respondent No. 2. The balance 25 lakhs were to be paid to\n                          respondent No.2 herein at the time of quashing of FIR No. 147/2011 underSections 323/341/504IPC before the High Court of Rajasthan, Jaipur\n                          Bench. The respondent No. 2 undertook to cooperate and ensure her\n                          presence for the quashing of the FIR.\n\n29. The said Judgment further records that the parties had agreed that the\n                          petitioner/husband shall be the sole and absolute exclusive owner of\n                          residential Apartment bearing No. 1625 B Magnolias, Gold Course Road,\n                          Gurugram from the said date and that the Respondent No. 2/wife had\n                          already executed the necessary documents and Application for deletion of\n                          her name with regard to the said property. The parties undertook to\n                          cooperate with each other for implementation of the said Agreement.\n\n30.   Moreover, it was recorded that the exclusive and absolute title of\n                          commercial property bearing No. WZ-1401/2 Nangal Raya, Delhi - 110046\n                          shall also be with the petitioner. Both the parties undertook to abide by the\n                          terms and conditions of the Settlement as was mentioned in their Petition\n                          and the MOU/Addendum dated 11.03.2016 exhibited as Ex. P5. After\n                          recording the Settlement, the divorce by Mutual Consent underSection\n                          13(B)2HMA, was granted.\n\n31.   It is evident that the terms of this Settlement were specificallySignature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                             Page 8 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48reproduced and the documents exhibited. In fact,         there was a specific\n                          reference that the total cash amount agreed was Rs. 3 crores out of which\n                          Rs. 1.5 crores already stood paid while Rs. 1.25 crores were deposited to be\n                          released to the respondent No. 2, only after execution of the requisite title\n                          documents. Having made specific statements and exhibiting the Agreement\n                          as Ex. P-5, the respondent No. 2 cannot now either deny or challenge the\n                          Judgement which has never been challenged by respondent No. 2 till date.\n                          The contents of this Settlement, which were endorsed and accepted by the\n                          Parties before the Court, was duly acted upon and the Divorce was granted.\n                          The contention of the respondent No. 2 that she has been cheated or\n                          defrauded or was not aware that the second Addendum stamped at 6:48 PM\n                          was not presented before the family court is behest of any logic especially\n                          when the Order granting the Divorce repeated and affirmed the contents of\n                          the Settlement in detail.\n\n32.   There being specific reproduction and re affirmation by the parties of\n                          the terms of the Agreement, it cannot be said that she was misled or the\n                          terms of the Settlement were misrepresented to her. Therefore, it has to be\n                          held that this second Addendum dated 11.03.2006 signed by the Parties at\n                          the same time, signatures on which are not denied by her, was a binding\n                          Settlement.\n\n33.    The next question which arises is the validity of the first Addendum\n                          e-stamped at 6:46 PM on 11.03.2016. 27.       Apparently, it seems that the\n                          parties arrived at two Addendum Settlements each of which were\n                          independent; one for the purpose of taking divorce by Mutual Consent while\n                          the other was for Settlement of other disputes, claims in respect of money\n                          and properties. In any case, it is a question of interpretation of the intentionSignature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                               Page 9 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48of the parties, which they are at liberty to establish in the appropriate Civil\n                          Litigation. There is nothing to show that the second Addendum had\n                          superseded the first Addendum. This is further corroborated by the fact that\n                          the respondent No. 2 never sought repudiation of this Agreement, which was\n                          the basis of divorce by mutual consent.\n\n34.    Apparently, the two Addendums signed on 11.03.2016 were intended\n                          to be independent of each other; while the second Addendum became the\n                          basis for Divorce by Mutual Consent, the grievance against first addendum\n                          has been raised only in 2024 by filing a Complaint for registration of FIR.\n\n35. Pertinently, this second Addendum which became the basis of divorce by\n                          Mutual Consent does not find any mention in the FIR, which is purely\n                          confined to the first Addendum.\n\n36. It is evident that the entire grievance of the respondent No. 2 is in regard\n                          to the non compliance of the First Addendum Settlement dated 11.03.2016.\n                          The parties have voluntarily entered into it and whatever be the implications,\n                          they are essentially civil in nature. Breach of a Settlement would entail only\n                          civil liabilities; the essential ingredient of dishonest or fraudulent intention\n                          which are the foundation for an offence of Cheating or Breach of Trust, are\n                          essentially missing in the present FIR. Significantly, while the Addendum\n                          Agreement is of 2016, the Criminal Complaint alleging fraud and breach of\n                          Trust vis. a viz. this Agreement, has been filed only in 2024 i.e. after eight\n                          years of its execution, leading to registration of impugned FIR.\n\n37.   Consequently, the FIR No. 0126/2024 dated 31.05.2024 is hereby\n                          quashed along with all the proceedings emanating therefrom, leaving the\n                          parties to pursue their civil litigation and other litigation underSection 138NI Act, which have already been initiated.\n\n38.   It is hereby stated that observations made herein is for the purpose of\n                          the present petition and are not an expression on the merits of the Settlement\n                          Deeds.\n\n39.   The Petition along with other Application, if any is accordingly\n                          disposed of.\n\n(NEENA BANSAL KRISHNA)\n                                                                              JUDGE\n                          SEPTEMBER 17, 2024/PTSignature Not VerifiedDigitally Signed          CRL.M.C.6700/2024                                              Page 11 of 11By:VIKAS ARORASigning Date:01.10.202417:17:48"
    },
    {
        "title": "Why Su-Kam Is Looking Up To The Sun",
        "link": "https://www.forbesindia.com/article/boardroom/why-sukam-is-looking-up-to-the-sun/39154/1",
        "date": "Dec 11, 2014",
        "source": "Forbes India",
        "snippet": "Su-Kam founder Kunwer Sachdev built his company's fortune by cashing in on an unreliable power grid. Now, he's looking up to the sun for ...",
        "content": "Su-Kam founder Kunwer Sachdev built his company's fortune by cashing in on an unreliable power grid. Now, he's looking up to the sun for inspiration—and profit\n\nWhen he turned 15, Kunwer Sachdev began helping his older brother sell pens to shops in Delhi. It was the late 1970s, and the nation’s capital was not immune to rolling blackouts, which increased in frequency during the sweltering summer months. Today, at the age of 52, Sachdev is the founder and chief executive officer of Su-Kam Power Systems Ltd, one of India’s largest back-up power companies. It manufactures inverters and other devices—which he didn’t have access to when he was growing up—that provide uninterrupted power supply so that electrical appliances such as refrigerators, air-conditioners and fans can function when the grid fails to deliver.Power outages are still very much a part of life in India, including Delhi. In its most recent study, the World Bank reported that over 1.2 billion people, or 20 percent of the world’s population, don’t have access to electricity, of which more than 400 million live in India. For companies like Su-Kam that benefit when the lights go off, business has never been better. Su-Kam’s revenues for 2013-14 stand at Rs 1,200 crore, up by 20 percent from 2012-13.These days, though, Sachdev has been paying close attention to Prime Minister Narendra Modi’s promise of replicating Gujarat’s 24-hour power supply model across the whole of India. And industry analysts believe that this goal can be achieved over the next five to 10 years. It’s also why the first-generation entrepreneur, who attributes his success to his ability to plan for future needs, is looking up to the sun for inspiration—and profit.Su-Kam is betting on individual home owners generating solar power to reduce their electricity bills. The majority of consumers currently plug inverters and UPS batteries to their appliances, which then charge and hoard power from the main grid. Sachdev has flipped this model: He has started manufacturing inverters and UPS devices that can draw power from solar panels, which Su-Kam began manufacturing in 2004.“We started research and development [R&D] for regular inverters in 2000. We don’t have to do anything special for solar-powered products. I’m already dealing in batteries, which use direct current [DC]. Solar panels also use DC. All I have to do is replace the battery in a regular inverter with a solar powered one,” says Sachdev.He may not have an engineering degree, but he knows the nuts and bolts of the technology Su-Kam is betting on. “We started manufacturing solar-powered products a decade ago, and today it accounts for 20 percent of our sales,” he says.Su-Kam offers solar solutions for homes and businesses. Apart from solar panels and hybrid UPS devices, it manufactures solar batteries, inverters, home lighting systems and network management systems. Sachdev wants to decentralise the power generating process. Instead of setting up large projects (more than 25 MW) that harness sunlight and sell electricity to the government’s central power grid, Su-Kam is selling smaller 5 kilowatts (KW) to 1 MW solar-powered systems to villages and housing complexes.“We don’t sell to the government, which involves sourcing land to generate the required 25-30 MW of power. Here, the customer provides the land and we provide the technology,” says Sachdev. “Whatever the solar unit produces will get ‘mixed’ into the customer’s normal power supply because of which a household’s bill will reduce. You recover the investment in a few years, and the burden on the government to generate more power is lessened.”Sachdev’s solar solutions plans are intriguing because they form a sort of hybrid between completely decentralised solutions such as individual solar lanterns and large solar farms.Su-Kam is still in the pilot phase of this project. Since the start of 2014, the company has installed solar products—which provide eight to 10 hours of power supply daily—in 1 lakh homes across India. And it says that exports to more than 70 countries account for 15 percent of its sales (both regular and solar-powered devices). “We have a presence in African nations, but we are seeing that the highest demand for solar products is in India itself,” says Sachdev. This is why he has scaled up R&D in solar products at his Gurgaon facility. Five years ago, barely two out of the 45-strong team of engineers researched this sector. Today, it has evolved into a unit of 15 engineers.Ashish Sethi, who heads Su-Kam’s solar business, recalls how, a few months ago, the R&D team produced a one-off (not in the company’s catalogue) solar product as per the specifications of a customer in Uttar Pradesh. “We did it in 48 hours,” says Sethi who believes that by 2018, Su-Kam’s solar arm will grow from its present Rs 250 crore business to a Rs 700 crore one. The company, however, has had its fair share of problems. An industry analyst who did not want to be named told Forbes India that Su-Kam was hit by quality and service issues three years ago. “Peripheral competitors like Exide and V-Guard also stole market share,” says the analyst. Two years ago, profits lagged and Sachdev fired 400 members of the service staff.Sachdev acknowledges Su-Kam’s not-so-stellar performance in 2011.  “We realised that we were starting to fall apart because we had too many people and no systems or structures. When we got major external funding, my people wasted a lot. I was also part of that,” he says. Apart from developing the solar business, creating a solid management and hiring system is an important part of his agenda.He’s refreshingly candid about the mistakes he’s made. Perhaps it’s a sign of an entrepreneur who is not burdened by investor expectations. Though Reliance Capital and Temasek Holdings picked up a combined 20 percent stake for Rs 45 crore in 2006, they seldom interfere with operations. His investors trust him, he says. “Few companies have done all the groundwork necessary to reap the benefits in the next five years,” says Amitabh Mohanty, head of debt strategies at Reliance Capital (of the ADAG stable).That said, eight years is a long time in private equity circles and investors will be waiting (and hoping) for the solar business to take off so that they can make a profitable exit. Success will depend on whether a company can stay relevant to India’s evolving power needs. And Sachdev believes he’s on the right track.He wants to be seen as a social entrepreneur delivering clean energy to villagers. But he’s also a businessman, one who knows what it’s like to be bound to the whims of a capricious power grid. If Su-Kam can find a model to deliver and service solar generators to clusters of homes (particularly in rural areas), it can provide light and improve their standard of living by powering fans, televisions, mobile devices, and so on.Like many of the customers he wants to reach out to, Sachdev, the son of a railway clerk who went to a Hindi-medium government school, hails from a lower-middleclass family. His is the quintessential rags-to-riches story. While helping his brother build a writing instruments business, Sachdev graduated from Hindu College in 1984 with a Bachelor’s degree in statistics. He later parted ways with his brother and got a law degree from Delhi University.Bitten by the entrepreneurial bug, he set up Su-Kam—a cable TV accessories company—in Delhi’s Punjabi Bagh in 1988 with Rs 10,000. The fact that he didn’t have an engineering degree did not deter him. He picked the right business and, by 1998, the cable TV sector in India was booming. Sachdev says he was making a tidy Rs 3-4 crore as annual turnover.But 1998 was also a turning point for the entrepreneur and, by extension, for Su-Kam. Power cuts were a frequent occurrence, and he recalls that the inverter in his house kept breaking down. He started researching the business and found that it was a largely unorganised industry. He also realised that it was an untapped sector, primed for growth in keeping with India’s accelerated development at the time.In two years, he moved away from the cable TV industry and began developing and manufacturing inverters. In 2002, Su-Kam’s revenues stood at Rs 10 crore, and by 2004 they had grown to Rs 100 crore. It may have taken Sachdev just two years to grow Su-Kam tenfold but, after 2004, as the industry became more organised, it took him a decade to grow another tenfold. Also, it’s hardly the only inverter company to make the logical move to solar.In 1991, when Su-Kam was still selling cable TV accessories, businessman and engineer Rakesh Malhotra’s Luminous Power Technologies started manufacturing its first inverters. In 2011, Malhotra sold a 74 percent stake in Luminous Power Technology to European giant Schneider Electric for Rs 1,400 crore. It is now a leader in the Rs 8,000 crore Indian inverter and UPS market (by revenues) with Taiwanese-owned Microtek in the second place, followed by Su-Kam. In 2011, Luminous also launched solar products, which brought in 10 percent of revenues in 2013.Although Sethi claims that Su-Kam is a leader in the solar UPS business, experts say it’s not easy to verify this claim because the green energy sector is fragmented and niche. Most of the companies operating in this arena are either unlisted or subsidiaries of multinationals, and data is hard to come by. Sachdev is wary yet respectful of competition. “People think Schneider bought Luminous for the brand; they bought it for the technology. Foreign companies have to buy Indian technology even if they want to expand to Africa,” he says.At the same time, he accuses local rivals of copying his products and laments India’s slow patent regime for allowing it. “We have filed the highest number of patents in the world in our industry, but yesterday I wrote a letter to PM Narendra Modi asking how he would implement his ‘Make in India’ plan if it takes seven to eight years to grant a patent.”A valid concern given that Sachdev is hoping to make hay while the sun shines.Subscribe Now(This story appears in the 12 December, 2014 issue\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof Forbes India. To visit our Archives,click here.)\n\nWhen he turned 15, Kunwer Sachdev began helping his older brother sell pens to shops in Delhi. It was the late 1970s, and the nation’s capital was not immune to rolling blackouts, which increased in frequency during the sweltering summer months. Today, at the age of 52, Sachdev is the founder and chief executive officer of Su-Kam Power Systems Ltd, one of India’s largest back-up power companies. It manufactures inverters and other devices—which he didn’t have access to when he was growing up—that provide uninterrupted power supply so that electrical appliances such as refrigerators, air-conditioners and fans can function when the grid fails to deliver.Power outages are still very much a part of life in India, including Delhi. In its most recent study, the World Bank reported that over 1.2 billion people, or 20 percent of the world’s population, don’t have access to electricity, of which more than 400 million live in India. For companies like Su-Kam that benefit when the lights go off, business has never been better. Su-Kam’s revenues for 2013-14 stand at Rs 1,200 crore, up by 20 percent from 2012-13.These days, though, Sachdev has been paying close attention to Prime Minister Narendra Modi’s promise of replicating Gujarat’s 24-hour power supply model across the whole of India. And industry analysts believe that this goal can be achieved over the next five to 10 years. It’s also why the first-generation entrepreneur, who attributes his success to his ability to plan for future needs, is looking up to the sun for inspiration—and profit.Su-Kam is betting on individual home owners generating solar power to reduce their electricity bills. The majority of consumers currently plug inverters and UPS batteries to their appliances, which then charge and hoard power from the main grid. Sachdev has flipped this model: He has started manufacturing inverters and UPS devices that can draw power from solar panels, which Su-Kam began manufacturing in 2004.“We started research and development [R&D] for regular inverters in 2000. We don’t have to do anything special for solar-powered products. I’m already dealing in batteries, which use direct current [DC]. Solar panels also use DC. All I have to do is replace the battery in a regular inverter with a solar powered one,” says Sachdev.He may not have an engineering degree, but he knows the nuts and bolts of the technology Su-Kam is betting on. “We started manufacturing solar-powered products a decade ago, and today it accounts for 20 percent of our sales,” he says.Su-Kam offers solar solutions for homes and businesses. Apart from solar panels and hybrid UPS devices, it manufactures solar batteries, inverters, home lighting systems and network management systems. Sachdev wants to decentralise the power generating process. Instead of setting up large projects (more than 25 MW) that harness sunlight and sell electricity to the government’s central power grid, Su-Kam is selling smaller 5 kilowatts (KW) to 1 MW solar-powered systems to villages and housing complexes.“We don’t sell to the government, which involves sourcing land to generate the required 25-30 MW of power. Here, the customer provides the land and we provide the technology,” says Sachdev. “Whatever the solar unit produces will get ‘mixed’ into the customer’s normal power supply because of which a household’s bill will reduce. You recover the investment in a few years, and the burden on the government to generate more power is lessened.”Sachdev’s solar solutions plans are intriguing because they form a sort of hybrid between completely decentralised solutions such as individual solar lanterns and large solar farms.\n\nSu-Kam is still in the pilot phase of this project. Since the start of 2014, the company has installed solar products—which provide eight to 10 hours of power supply daily—in 1 lakh homes across India. And it says that exports to more than 70 countries account for 15 percent of its sales (both regular and solar-powered devices). “We have a presence in African nations, but we are seeing that the highest demand for solar products is in India itself,” says Sachdev. This is why he has scaled up R&D in solar products at his Gurgaon facility. Five years ago, barely two out of the 45-strong team of engineers researched this sector. Today, it has evolved into a unit of 15 engineers.Ashish Sethi, who heads Su-Kam’s solar business, recalls how, a few months ago, the R&D team produced a one-off (not in the company’s catalogue) solar product as per the specifications of a customer in Uttar Pradesh. “We did it in 48 hours,” says Sethi who believes that by 2018, Su-Kam’s solar arm will grow from its present Rs 250 crore business to a Rs 700 crore one. The company, however, has had its fair share of problems. An industry analyst who did not want to be named told Forbes India that Su-Kam was hit by quality and service issues three years ago. “Peripheral competitors like Exide and V-Guard also stole market share,” says the analyst. Two years ago, profits lagged and Sachdev fired 400 members of the service staff.Sachdev acknowledges Su-Kam’s not-so-stellar performance in 2011.  “We realised that we were starting to fall apart because we had too many people and no systems or structures. When we got major external funding, my people wasted a lot. I was also part of that,” he says. Apart from developing the solar business, creating a solid management and hiring system is an important part of his agenda.He’s refreshingly candid about the mistakes he’s made. Perhaps it’s a sign of an entrepreneur who is not burdened by investor expectations. Though Reliance Capital and Temasek Holdings picked up a combined 20 percent stake for Rs 45 crore in 2006, they seldom interfere with operations. His investors trust him, he says. “Few companies have done all the groundwork necessary to reap the benefits in the next five years,” says Amitabh Mohanty, head of debt strategies at Reliance Capital (of the ADAG stable).That said, eight years is a long time in private equity circles and investors will be waiting (and hoping) for the solar business to take off so that they can make a profitable exit. Success will depend on whether a company can stay relevant to India’s evolving power needs. And Sachdev believes he’s on the right track.He wants to be seen as a social entrepreneur delivering clean energy to villagers. But he’s also a businessman, one who knows what it’s like to be bound to the whims of a capricious power grid. If Su-Kam can find a model to deliver and service solar generators to clusters of homes (particularly in rural areas), it can provide light and improve their standard of living by powering fans, televisions, mobile devices, and so on.Like many of the customers he wants to reach out to, Sachdev, the son of a railway clerk who went to a Hindi-medium government school, hails from a lower-middleclass family. His is the quintessential rags-to-riches story. While helping his brother build a writing instruments business, Sachdev graduated from Hindu College in 1984 with a Bachelor’s degree in statistics. He later parted ways with his brother and got a law degree from Delhi University.Bitten by the entrepreneurial bug, he set up Su-Kam—a cable TV accessories company—in Delhi’s Punjabi Bagh in 1988 with Rs 10,000. The fact that he didn’t have an engineering degree did not deter him. He picked the right business and, by 1998, the cable TV sector in India was booming. Sachdev says he was making a tidy Rs 3-4 crore as annual turnover.But 1998 was also a turning point for the entrepreneur and, by extension, for Su-Kam. Power cuts were a frequent occurrence, and he recalls that the inverter in his house kept breaking down. He started researching the business and found that it was a largely unorganised industry. He also realised that it was an untapped sector, primed for growth in keeping with India’s accelerated development at the time.In two years, he moved away from the cable TV industry and began developing and manufacturing inverters. In 2002, Su-Kam’s revenues stood at Rs 10 crore, and by 2004 they had grown to Rs 100 crore. It may have taken Sachdev just two years to grow Su-Kam tenfold but, after 2004, as the industry became more organised, it took him a decade to grow another tenfold. Also, it’s hardly the only inverter company to make the logical move to solar.In 1991, when Su-Kam was still selling cable TV accessories, businessman and engineer Rakesh Malhotra’s Luminous Power Technologies started manufacturing its first inverters. In 2011, Malhotra sold a 74 percent stake in Luminous Power Technology to European giant Schneider Electric for Rs 1,400 crore. It is now a leader in the Rs 8,000 crore Indian inverter and UPS market (by revenues) with Taiwanese-owned Microtek in the second place, followed by Su-Kam. In 2011, Luminous also launched solar products, which brought in 10 percent of revenues in 2013.Although Sethi claims that Su-Kam is a leader in the solar UPS business, experts say it’s not easy to verify this claim because the green energy sector is fragmented and niche. Most of the companies operating in this arena are either unlisted or subsidiaries of multinationals, and data is hard to come by. Sachdev is wary yet respectful of competition. “People think Schneider bought Luminous for the brand; they bought it for the technology. Foreign companies have to buy Indian technology even if they want to expand to Africa,” he says.At the same time, he accuses local rivals of copying his products and laments India’s slow patent regime for allowing it. “We have filed the highest number of patents in the world in our industry, but yesterday I wrote a letter to PM Narendra Modi asking how he would implement his ‘Make in India’ plan if it takes seven to eight years to grant a patent.”A valid concern given that Sachdev is hoping to make hay while the sun shines.Subscribe Now(This story appears in the 12 December, 2014 issue\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof Forbes India. To visit our Archives,click here.)\n\nSu-Kam is still in the pilot phase of this project. Since the start of 2014, the company has installed solar products—which provide eight to 10 hours of power supply daily—in 1 lakh homes across India. And it says that exports to more than 70 countries account for 15 percent of its sales (both regular and solar-powered devices). “We have a presence in African nations, but we are seeing that the highest demand for solar products is in India itself,” says Sachdev. This is why he has scaled up R&D in solar products at his Gurgaon facility. Five years ago, barely two out of the 45-strong team of engineers researched this sector. Today, it has evolved into a unit of 15 engineers.Ashish Sethi, who heads Su-Kam’s solar business, recalls how, a few months ago, the R&D team produced a one-off (not in the company’s catalogue) solar product as per the specifications of a customer in Uttar Pradesh. “We did it in 48 hours,” says Sethi who believes that by 2018, Su-Kam’s solar arm will grow from its present Rs 250 crore business to a Rs 700 crore one. The company, however, has had its fair share of problems. An industry analyst who did not want to be named told Forbes India that Su-Kam was hit by quality and service issues three years ago. “Peripheral competitors like Exide and V-Guard also stole market share,” says the analyst. Two years ago, profits lagged and Sachdev fired 400 members of the service staff.Sachdev acknowledges Su-Kam’s not-so-stellar performance in 2011.  “We realised that we were starting to fall apart because we had too many people and no systems or structures. When we got major external funding, my people wasted a lot. I was also part of that,” he says. Apart from developing the solar business, creating a solid management and hiring system is an important part of his agenda.He’s refreshingly candid about the mistakes he’s made. Perhaps it’s a sign of an entrepreneur who is not burdened by investor expectations. Though Reliance Capital and Temasek Holdings picked up a combined 20 percent stake for Rs 45 crore in 2006, they seldom interfere with operations. His investors trust him, he says. “Few companies have done all the groundwork necessary to reap the benefits in the next five years,” says Amitabh Mohanty, head of debt strategies at Reliance Capital (of the ADAG stable).That said, eight years is a long time in private equity circles and investors will be waiting (and hoping) for the solar business to take off so that they can make a profitable exit. Success will depend on whether a company can stay relevant to India’s evolving power needs. And Sachdev believes he’s on the right track.He wants to be seen as a social entrepreneur delivering clean energy to villagers. But he’s also a businessman, one who knows what it’s like to be bound to the whims of a capricious power grid. If Su-Kam can find a model to deliver and service solar generators to clusters of homes (particularly in rural areas), it can provide light and improve their standard of living by powering fans, televisions, mobile devices, and so on.Like many of the customers he wants to reach out to, Sachdev, the son of a railway clerk who went to a Hindi-medium government school, hails from a lower-middleclass family. His is the quintessential rags-to-riches story. While helping his brother build a writing instruments business, Sachdev graduated from Hindu College in 1984 with a Bachelor’s degree in statistics. He later parted ways with his brother and got a law degree from Delhi University.Bitten by the entrepreneurial bug, he set up Su-Kam—a cable TV accessories company—in Delhi’s Punjabi Bagh in 1988 with Rs 10,000. The fact that he didn’t have an engineering degree did not deter him. He picked the right business and, by 1998, the cable TV sector in India was booming. Sachdev says he was making a tidy Rs 3-4 crore as annual turnover.But 1998 was also a turning point for the entrepreneur and, by extension, for Su-Kam. Power cuts were a frequent occurrence, and he recalls that the inverter in his house kept breaking down. He started researching the business and found that it was a largely unorganised industry. He also realised that it was an untapped sector, primed for growth in keeping with India’s accelerated development at the time.In two years, he moved away from the cable TV industry and began developing and manufacturing inverters. In 2002, Su-Kam’s revenues stood at Rs 10 crore, and by 2004 they had grown to Rs 100 crore. It may have taken Sachdev just two years to grow Su-Kam tenfold but, after 2004, as the industry became more organised, it took him a decade to grow another tenfold. Also, it’s hardly the only inverter company to make the logical move to solar.In 1991, when Su-Kam was still selling cable TV accessories, businessman and engineer Rakesh Malhotra’s Luminous Power Technologies started manufacturing its first inverters. In 2011, Malhotra sold a 74 percent stake in Luminous Power Technology to European giant Schneider Electric for Rs 1,400 crore. It is now a leader in the Rs 8,000 crore Indian inverter and UPS market (by revenues) with Taiwanese-owned Microtek in the second place, followed by Su-Kam. In 2011, Luminous also launched solar products, which brought in 10 percent of revenues in 2013.Although Sethi claims that Su-Kam is a leader in the solar UPS business, experts say it’s not easy to verify this claim because the green energy sector is fragmented and niche. Most of the companies operating in this arena are either unlisted or subsidiaries of multinationals, and data is hard to come by. Sachdev is wary yet respectful of competition. “People think Schneider bought Luminous for the brand; they bought it for the technology. Foreign companies have to buy Indian technology even if they want to expand to Africa,” he says.At the same time, he accuses local rivals of copying his products and laments India’s slow patent regime for allowing it. “We have filed the highest number of patents in the world in our industry, but yesterday I wrote a letter to PM Narendra Modi asking how he would implement his ‘Make in India’ plan if it takes seven to eight years to grant a patent.”A valid concern given that Sachdev is hoping to make hay while the sun shines.Subscribe Now(This story appears in the 12 December, 2014 issue\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof Forbes India. To visit our Archives,click here.)\n\nAshish Sethi, who heads Su-Kam’s solar business, recalls how, a few months ago, the R&D team produced a one-off (not in the company’s catalogue) solar product as per the specifications of a customer in Uttar Pradesh. “We did it in 48 hours,” says Sethi who believes that by 2018, Su-Kam’s solar arm will grow from its present Rs 250 crore business to a Rs 700 crore one. The company, however, has had its fair share of problems. An industry analyst who did not want to be named told Forbes India that Su-Kam was hit by quality and service issues three years ago. “Peripheral competitors like Exide and V-Guard also stole market share,” says the analyst. Two years ago, profits lagged and Sachdev fired 400 members of the service staff.Sachdev acknowledges Su-Kam’s not-so-stellar performance in 2011.  “We realised that we were starting to fall apart because we had too many people and no systems or structures. When we got major external funding, my people wasted a lot. I was also part of that,” he says. Apart from developing the solar business, creating a solid management and hiring system is an important part of his agenda.He’s refreshingly candid about the mistakes he’s made. Perhaps it’s a sign of an entrepreneur who is not burdened by investor expectations. Though Reliance Capital and Temasek Holdings picked up a combined 20 percent stake for Rs 45 crore in 2006, they seldom interfere with operations. His investors trust him, he says. “Few companies have done all the groundwork necessary to reap the benefits in the next five years,” says Amitabh Mohanty, head of debt strategies at Reliance Capital (of the ADAG stable).That said, eight years is a long time in private equity circles and investors will be waiting (and hoping) for the solar business to take off so that they can make a profitable exit. Success will depend on whether a company can stay relevant to India’s evolving power needs. And Sachdev believes he’s on the right track.He wants to be seen as a social entrepreneur delivering clean energy to villagers. But he’s also a businessman, one who knows what it’s like to be bound to the whims of a capricious power grid. If Su-Kam can find a model to deliver and service solar generators to clusters of homes (particularly in rural areas), it can provide light and improve their standard of living by powering fans, televisions, mobile devices, and so on.Like many of the customers he wants to reach out to, Sachdev, the son of a railway clerk who went to a Hindi-medium government school, hails from a lower-middleclass family. His is the quintessential rags-to-riches story. While helping his brother build a writing instruments business, Sachdev graduated from Hindu College in 1984 with a Bachelor’s degree in statistics. He later parted ways with his brother and got a law degree from Delhi University.\n\nBitten by the entrepreneurial bug, he set up Su-Kam—a cable TV accessories company—in Delhi’s Punjabi Bagh in 1988 with Rs 10,000. The fact that he didn’t have an engineering degree did not deter him. He picked the right business and, by 1998, the cable TV sector in India was booming. Sachdev says he was making a tidy Rs 3-4 crore as annual turnover.But 1998 was also a turning point for the entrepreneur and, by extension, for Su-Kam. Power cuts were a frequent occurrence, and he recalls that the inverter in his house kept breaking down. He started researching the business and found that it was a largely unorganised industry. He also realised that it was an untapped sector, primed for growth in keeping with India’s accelerated development at the time.In two years, he moved away from the cable TV industry and began developing and manufacturing inverters. In 2002, Su-Kam’s revenues stood at Rs 10 crore, and by 2004 they had grown to Rs 100 crore. It may have taken Sachdev just two years to grow Su-Kam tenfold but, after 2004, as the industry became more organised, it took him a decade to grow another tenfold. Also, it’s hardly the only inverter company to make the logical move to solar.In 1991, when Su-Kam was still selling cable TV accessories, businessman and engineer Rakesh Malhotra’s Luminous Power Technologies started manufacturing its first inverters. In 2011, Malhotra sold a 74 percent stake in Luminous Power Technology to European giant Schneider Electric for Rs 1,400 crore. It is now a leader in the Rs 8,000 crore Indian inverter and UPS market (by revenues) with Taiwanese-owned Microtek in the second place, followed by Su-Kam. In 2011, Luminous also launched solar products, which brought in 10 percent of revenues in 2013.Although Sethi claims that Su-Kam is a leader in the solar UPS business, experts say it’s not easy to verify this claim because the green energy sector is fragmented and niche. Most of the companies operating in this arena are either unlisted or subsidiaries of multinationals, and data is hard to come by. Sachdev is wary yet respectful of competition. “People think Schneider bought Luminous for the brand; they bought it for the technology. Foreign companies have to buy Indian technology even if they want to expand to Africa,” he says.At the same time, he accuses local rivals of copying his products and laments India’s slow patent regime for allowing it. “We have filed the highest number of patents in the world in our industry, but yesterday I wrote a letter to PM Narendra Modi asking how he would implement his ‘Make in India’ plan if it takes seven to eight years to grant a patent.”A valid concern given that Sachdev is hoping to make hay while the sun shines.Subscribe Now(This story appears in the 12 December, 2014 issue\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof Forbes India. To visit our Archives,click here.)\n\nBitten by the entrepreneurial bug, he set up Su-Kam—a cable TV accessories company—in Delhi’s Punjabi Bagh in 1988 with Rs 10,000. The fact that he didn’t have an engineering degree did not deter him. He picked the right business and, by 1998, the cable TV sector in India was booming. Sachdev says he was making a tidy Rs 3-4 crore as annual turnover.But 1998 was also a turning point for the entrepreneur and, by extension, for Su-Kam. Power cuts were a frequent occurrence, and he recalls that the inverter in his house kept breaking down. He started researching the business and found that it was a largely unorganised industry. He also realised that it was an untapped sector, primed for growth in keeping with India’s accelerated development at the time.In two years, he moved away from the cable TV industry and began developing and manufacturing inverters. In 2002, Su-Kam’s revenues stood at Rs 10 crore, and by 2004 they had grown to Rs 100 crore. It may have taken Sachdev just two years to grow Su-Kam tenfold but, after 2004, as the industry became more organised, it took him a decade to grow another tenfold. Also, it’s hardly the only inverter company to make the logical move to solar.In 1991, when Su-Kam was still selling cable TV accessories, businessman and engineer Rakesh Malhotra’s Luminous Power Technologies started manufacturing its first inverters. In 2011, Malhotra sold a 74 percent stake in Luminous Power Technology to European giant Schneider Electric for Rs 1,400 crore. It is now a leader in the Rs 8,000 crore Indian inverter and UPS market (by revenues) with Taiwanese-owned Microtek in the second place, followed by Su-Kam. In 2011, Luminous also launched solar products, which brought in 10 percent of revenues in 2013.Although Sethi claims that Su-Kam is a leader in the solar UPS business, experts say it’s not easy to verify this claim because the green energy sector is fragmented and niche. Most of the companies operating in this arena are either unlisted or subsidiaries of multinationals, and data is hard to come by. Sachdev is wary yet respectful of competition. “People think Schneider bought Luminous for the brand; they bought it for the technology. Foreign companies have to buy Indian technology even if they want to expand to Africa,” he says.At the same time, he accuses local rivals of copying his products and laments India’s slow patent regime for allowing it. “We have filed the highest number of patents in the world in our industry, but yesterday I wrote a letter to PM Narendra Modi asking how he would implement his ‘Make in India’ plan if it takes seven to eight years to grant a patent.”A valid concern given that Sachdev is hoping to make hay while the sun shines.\n\n(This story appears in the 12 December, 2014 issue\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tof Forbes India. To visit our Archives,click here.)\n\nPhoto of the day: Happily ever after\n\nFrom Cred's Kunal Shah unpacking harsh truth about entrepreneurship to India's corporate hiring pivot, our top stories of the week\n\nPhoto of the day: Kolkata ISCKON Rathyatra 2025\n\nFrom Zohran Mamdani to Ro Khanna, seven Indian-Americans who have won election battles in the US\n\nWimbledon embraces tech, moves beyond line judges\n\nFrom Kyoto to cafés everywhere, Japan's matcha tea becomes a global wellness staple\n\nHow the misfit bias can hurt you\n\nRare Earth Diplomacy: US and China reach tentative understanding\n\nPhoto of the day: The Bezos-Sanchez wedding festivities kick-off\n\nFrom UPI to ONDC: The role of centralised orchestration in DPI success\n\nIn defense of Bengaluru: A startup leader by a mile\n\nIn defense of Delhi-NCR: A real-world lab to build\n\nThe Bezos-Sanchez Affair: From private jets to public love\n\nHiring 2.0: Why India Inc is prioritising skills over degrees\n\nHow Labubu dolls are helping China win the global culture game"
    },
    {
        "title": "http://www.wikidata.org/entity/Q17708831",
        "link": "http://www.wikidata.org/entity/Q17708831",
        "date": "N/A",
        "source": "Wikidata",
        "snippet": "No information is available for this page.",
        "content": ""
    },
    {
        "title": "KUNWER SACHDEVA « Founder & CEO of Su-Kam Power ...",
        "link": "https://aboutkunwersachdev.wordpress.com/",
        "date": "Feb 11, 2015",
        "source": "WordPress.com",
        "snippet": "Mr Kunwer Sachdev has been aptly given the title of the “Inverter Man of India”. Frustrated over a malfunctioning inverter at his house he ...",
        "content": "Founder & CEO of Su-Kam Power Systems\n\nFebruary 11, 2015 6:12 am/2 Commentson “Make in India” to reduce India’s electronics import bill\n\nMake in Indiais the biggest initiative launched by our Prime Minister to attract investors to our country and to encourage them to manufacture in India. This one campaign will provide the much needed boost to India’s economy by creating jobs, making India a self reliant economy and getting the country its rightful place under the sun. The Prime Minister has also set very high targets for the focus sectors.\n\nMrKunwer Sachdeva, Managing Director Su-Kam Power Systems, while speaking to a team fromIndia Infoline(IIFL) lauded the Prime Minister’s initiative, especially in the Solar Sector. Under the National Solar Mission, the Prime Minister has enhanced the goal from 20 GW of solar energy by 2020 to 100 GW, a huge step. Mr Sachdev believes that this target though achievable would require a slew of investors, manufacturers, and other involvement of many stakeholders.\n\nThe Inverter Man of India is very upbeat about India’s performance based on the steps taken byNarendra Modi. A number of new technologies are being developed in India. Su-Kam well symbolises Make in India – for over 15 years now the company has been innovating and manufacturing in India. The company holds close to 100 design patents in India, USA and other countries, and over 100 technology patents. Today the company files a minimum of 30 patents a year. However, Mr Sachdeva believes that the Patent granting system in the country leaves a lot to be desired. The patents that Su-Kam has filed for over six years ago are yet to be granted. In today’s dynamic world technology changes very fast and some of these have already become obsolete.\n\nThis needs to be fixed very quickly. Having said that there is no doubt that the Make in India initiative will ensure that a large number of companies start manufacturing in India, thus generating employment and improving the standard of living in the country.\n\nMr Sachdeva also believes that this initiative can have a major impact at India’s macro-economic picture. For instance, if we were to only focus on the electronics industry, there is much that can be achieved. According to industry experts, India’s electronic imports may surpass its oil import bill by 2030. Keeping the current oil prices in view, this aim may also be achieved by 2025. Currently the annual imports stand at over USD 35 billion!\n\nFirm laws and a fast paced administrative machinery are critical to the success of the Make in India campaign, said Mr Kunwer Sachdev while speaking to the IIFL team.\n\nJanuary 12, 2015 6:00 am/16 Commentson Inverter Man of India – Always a Step Ahead!\n\nMr Kunwer Sachdev has been aptly given the title of the “Inverter Man of India”. Frustrated over a malfunctioning inverter at his house he opened the inverter and studied the reasons for its continuous failure. Little did he know then that he was taking the first step toward revolutionising an industry that was highly unorganised.\n\nWhen he opened that inverter,Kunwer Sachdevaalso did not realise that with that one action he was about to script his life’s story of rags to riches. Mr Sachdev hails from a very humble background and spent his early career selling pens. He faced numerous challenges at every step, however he never deterred, building his company from strength to strength. He always searched for an opportunity when faced with a problem, rather than giving up he tried to find a solution and move ahead.\n\nThoughKunwer Sachdevhad no formal training in electronics or an engineering degree, he built a power backup solutions company known globally for products backed by world class technology. Mr Sachdeva’s vision, entrepreneurial capability and determination led him to build Su-Kam into a Superbrand.\n\nAn innovation driven company, Su-Kam is always a step ahead of the industry.Kunwer Sachdeva, who built Su-Kam into a Rs 1000 crore plus company realised early on that Solar is the answer to India’s growing power needs. Su-Kam has a very strong R&D which is constantly working on developing innovative solar solutions. That day is perhaps not far when the Inverter Man of India will get renamed as the Solar Man of India.\n\nNovember 28, 2014 11:08 am/27 Commentson The Inverter Man of India runs the Airtel Half Marathon\n\nMr Kunwer Sachdev, also known as the Inverter Man of India, ran the Airtel Half Marathon on November 23, 2014 in Delhi. Achieving a time of 2hrs 21 mins, he ran 21 kms. Mr Sachdev is an avid sports person and a swimmer. He found the time to run the marathon despite his busy schedule, as he was determined to do so this year.Mr Kunwer Sachdeva believes in the saying “”Finishing a marathon is a state of mind that says ANYTHING IS POSSIBLE”. Running the marathon has been just that for him – breaking a mental barrier that it is difficult to run 21 kms at a stretch.\n\nMr Kunwer Sachdeva has lived his life by the saying “Anything is Possible” – overcoming challenges and proving it right over and over again. Coming from a very humble background, Mr Kunwer Sachdeva has built a Rs. 1200 crore company. Though academically he is not a technical person, he is credited with transforming the inverter industry from a non-technical industry into a highly technologically advanced industry!\n\nEven after running the half marathon, Mr Sachdeva’s batteries were as charged as those manufactured by his company. Ask him where he gets this energy from, and he says it is his determination and grit to achieve the impossible and break barriers that drive him. This is why he emerges victorious over and over again.\n\nJune 9, 2014 7:01 am/Leave a comment\n\nIndiaMART & ET NOW joined hands to present ‘IndiaMART Leaders of Tomorrow Awards’ to recognise the contribution of Micro, Small and Medium Enterprises (MSMEs) in driving India’s march to global stardom. The mission of the awards was to acknowledge the importance of SMEs in increasing trade, generating employment & creating new entrepreneurs in India,along with a commitment to develop a strong SME eco-system.\n\nIndia mart & ET Now invites Mr. Kunwer Sachdev\n\nThe finale of the award ceremony was organized in The Oberoi, New Delhi, and the chief guest being Mr. K. V. Kamath, non-executive chairman ICICI BANK.\n\nMr. Kunwer Sachdevwas invited as a special guest since he in the earlier years had been a part of the SME’s and successfully led Su-Kam out of the category into large scale eneterprises. Mr.Kunwer Sachdev gave away the awards along with Mr. K.V. Kamath to encourage and felicitate the winners.\n\nMay 21, 2014 6:40 am/5 Commentson Kunwer Sachdeva\n\nFounder & MD of Su-Kam Power Systems\n\nKunwar Sachdeva, the Founder and MD of Su-Kam, is popularly known as the inverter man of India who revolutionized the inverter industry. A DU law graduate determined to bring about new technology and innovation to the inverter industry in India and to organize the same; he sowed the seeds of Su-Kam and created a new breed of problem-free inverters calledSu-Kam.\n\nKunwer Sachdeva started his journey to success quite early in life. He started out as a cable TV operator and went on to dealing in power inverters. Su-Kam is currently the best and number one inverter company in India. The Top power saving Inverter Company whichKunwer sachdevstarted in 1992 with a meagre amount of Rs 10000 is currently enjoying a turnover of over Rs 650 crores.\n\nKunwar Sachdev’s journey to success and his rags to riches story is something out of a dream book for any aspiring entrepreneur. His thirst to innovate and bring about newer technologies and solutions in the power back up industry, led him to lay the foundation stone of inverter majorSu-Kamwhich has grown by leaps and bounds over the years. A man who was a born leader,Kunwer Sachdevaapplied his brilliant mind and gave India and over 70 countries abroad a great power saving answer and rid them of all their power woes.\n\nSu-Kam which provides power solutions to homes, industries, commercial establishments, schools, govt. bodies, defense, hospitals etc. has enabled these bodies to bring down their electricity consumption drastically. Now through the use of Su-Kam solar inverters in their power back up solutions, the electricity costs of the users have gone down considerably.\n\nMake in India is the biggest initiative launched by our Prime Minister to attract investors to our country and to encourage them to manufacture in…\n\nMr Kunwer Sachdev has been aptly given the title of the “Inverter Man of India”. Frustrated over a malfunctioning inverter at his house he…\n\nMr Kunwer Sachdev, also known as the Inverter Man of India, ran the Airtel Half Marathon on November 23, 2014 in Delhi. Achieving a time…\n\nIndiaMART & ET NOW joined hands to present ‘IndiaMART Leaders of Tomorrow Awards’ to recognise the contribution of Micro, Small and Medium Enterprises (MSMEs) in…\n\nCreate a free website or blog at WordPress.com."
    },
    {
        "title": "Kunwer Sachdev: The Solar Man of India",
        "link": "https://www.siliconindia.com/news/success-stories/kunwer-sachdev-the-solar-man-of-india-nid-220419-cid-80.html",
        "date": "Nov 9, 2022",
        "source": "Siliconindia",
        "snippet": "One of our generation's greatest innovators, marketers, motivational speakers, and visionary business people is Kunwer Sachdeva, founder of Su-Kam Power ...",
        "content": "His entrepreneurial experience is extensive and diverse, from selling pens and stationery to working in the sales department to completely reimagining the Indian inverter market. One of our generation's greatest innovators, marketers, motivational speakers, and visionary business people is Kunwer Sachdeva, founder of Su-Kam Power Systems, India's leading power solutions provider.\n\nLearning the ropes\n\nDespite originating from a lower middle-class household, Sachdeva overcame his financial challenges to start his first business at 15. Being a visionary, Kunwer quickly predicted the expansion of the power backup market in India and decided to close his cable TV company in 1998 to launch Su-Kam Power Systems. Su-Kam, originally a startup, is now an Indian multinational corporation and is regarded as one of the 500 India Inc.'s fastest-growing companies. On November 16, 1962, Kunwer Sachdev was born into a middle-class family. He did schooling in a public school in Delhi's Punjabi Bagh. He was one of the three sons of an Indian Railways department officer. With Sachdev's help, his brother established a small business selling writing utensils. Sachdev earned his LLB from Delhi University after graduating from Hindu College with a degree in statistics.\n\nHe is in charge of Su-R&D Kam's department and the company's general business. The Indian power backup industry's first patent applications for technology and design, which Sachdeva made. Additionally, he has been recognized for creating the first plastic-body inverters, which India Today named \"Innovation of the Decade.\" By incorporating cutting-edge technology like MOSFET, Microcontroller based, and DSP Sine Wave into inverters, Kunwer revolutionized the power backup sector. He also gave India a \"Home UPS\" device that incorporated an inverter and a UPS into a single piece of hardware. Kunwer challenged the entire industry to become an organized sector because, before Su-debut, Kam's inverter market was dominated by hundreds of local firms selling inferior products.\n\nWalkabout Entreprenership\n\nHe was so passionate about generating green energy that he desired to do it throughout India. Ten years ago, it was predicted that solar energy technology would usher in a revolution. Their home-related solar technologies include Solar (home appliance converters to solar inverter) and Brainy (first Hybrid Solar Home UPS). He has also looked into solar devices, from modest home remote controls to significant companies. Additionally, he has made a significant contribution to the creation of Unique Solar DC Systems. After Kunwar's diligent work, Su-kam is able to capture the largest market share. The current objective of good work is to supply solar energy to each and every home in India.\n\nSu-Kam currently produces over 250 products, including solar goods, UPSs, batteries, and specialised solar solutions. Su-Kam is a well-known \"Make in India\" brand with over 75,000 channel partners in numerous nations. The company's operations have already reached approximately 90 nations, thanks largely to Sachdev, who helped the corporation dominate the power markets in Asia and Africa.\n\nThe Journey so far\n\nIt would be the term used to describe the experience with Su-Kam. How often have I learned and unlearned management principles, interpersonal communication techniques, and life principles? It's more challenging to master unlearning than learning. You frequently become so firmly committed to your beliefs that you lose sight of reality. Entrepreneur Kunwer Sachdev, located in Gurugram, has been listed as one of 2017's 6th Huron's Most Respected Entrepreneurs.\n\nHe has won numerous honors as a result of industrialist, technology, and invention. It mostly consists of the \"Bharat Shiromani\" award given by the Indian government and the Ernst & Young \"Best Industrialist of the Year\" honor.  Kunwar Sachdev's biography, it is clear that talent alone may make a person successful without needing a degree as you know that despite being successful, Bill Gates and Facebook are former students of Mark Zuckerberg College.\n\nRead More News :\n\nStepping out of the Domestic Threshold, becoming the Richest Mother\n\nIndia's retail king, Radhakishan Damani\n\n© 2025 siliconindia.com All rights reserved.Attorneys Near Me|Attorneys"
    },
    {
        "title": "How Inverter Man of India Turned Wounds Into Wisdom ...",
        "link": "https://zeenews.india.com/companies/from-selling-pens-to-building-a-million-dollar-empire-su-kam-su-vastika-the-inverter-man-of-india-kunwer-sachdev-who-turned-wounds-into-wisdom-with-help-of-his-better-half-khushboo-sachdev-2633879.html",
        "date": "Jul 11, 2023",
        "source": "Zee News",
        "snippet": "Kunwer Sachdev is the face of the power backup sector in India and the brains behind Su-Kam, one of the most progressive and rapidly expanding ...",
        "content": "Solar Man Of India:One of the finest innovators, marketers, motivational speakers, and visionary businessmen of our time is Kunwer Sachdev, founder of Su-Kam Power Systems, India's premier provider of power solutions. Kunwer Sachdev, like Thomas Edison, has cemented his place in history by founding one of the most admired Indian businesses and revolutionizing the power backup sector.\n\nTrending Photos\n\nSuccess Story:The introduction of electricity transformed our way of life for decades, but the growing number of shortages and their lengthening frequency have made another invention necessary. Behind the scenes, a game changer with a non-technical background was putting in his hard work and commitment as this awful state of electricity deficit persisted for years. Kunwer Sachdev is the face of the power backup sector in India and the brains behind Su-Kam, one of the most progressive and rapidly expanding businesses in the country.Kunwer Sachdev: Rags To RichesA real \"rags to riches\" story, Kunwer Sachdev was raised by a railway clerk in Delhi's Punjabi Bagh neighborhood while dreaming of starting his own company one day. Following his graduation from college in 1984, he started working full-time in his brother's pen business. He attended a public school where the curriculum was taught in Hindi. He quickly recognized the potential in the field of power backup because he was a visionary from an early age. Due to the challenges of a severe power deficit, he made the decision to shut down his cable TV business and start Su-Kam in 1998. He has since launched numerous additional enterprises, but he has maintained the same Su-Kam throughout his entrepreneurial career for all of his ventures. But where did the name Su-Kam originate? The initials of his daughter's name, his name, and the names of his future children were once combined in Kunwer's mind to form the name of his company.Su-Kam- The Unmatched ProductHe had a difficult time raising money for his business, so it surprised him when clients returned his first 100 inverters due to issues. Never one to give up, he improved his invention and fixed all the flaws to make it better than anything else on the market. Before making cold calls to prospective new clients, he first spoke with a number of his cable TV clients. Realizing that selling to people directly would not help him grow his business, he started approaching dealers and wholesalers. The majority of producers quickly realized that Su-Kam was unmatched in terms of product quality and price, even though the market was already crowded at the time.Su-Kam: MonopolyThey were therefore compelled to accept Kunwer's proposals in order to become his company's initial partner. Soon after, Su-Kam became the first company in the industry to start exporting its products to the aforementioned markets. Kunwer started expanding his business during this time by visiting other nations. Kunwer surmounted new barriers brought on by governmental restrictions, corporate traditions, legal frameworks, and rivalries to establish Su-Kam as a household name in many of these countries. For his achievements, Kunwer Sachdev was given various awards, including the \"Bharat Shiromani\" and the Ernst and Young \"Entrepreneur of the Year\" titles.Su-Kam BankruptcySu-Kam Power Systems Limited filed for bankruptcy as a result of a string of tragic events, and Kunwer Sachdev was forced to quit the company he had considered his own for 32 years of his career and distance himself from it after getting involved in various legal disputes. The man who altered the landscape of India's power backup industry was forced to fight his toughest battle. The business was closed for two years (April 2019-April 2022). There was no help available. Nobody was answering the phone calls or responding to emails. Dealers and customers both suffered greatly during this time.Khushboo Sachdev: A Blessing In DisguiseCustomers, distributors, suppliers, and other company associates were left with a void following Kunwer Sachdev's departure from the business that he started and oversaw from its beginning until 2018. Customers and dealers both suffered because they had unsold goods and services on their hands, and there was no way to resolve any warranty claims from customers. After great effort and difficulty, Kunwer Sachdev's wife, Khushboo Sachdev, stepped up to assist him in these circumstances.Su-Vastika And The Power WomanUnder the guidance of Kunwer Sachdev, Khushboo Sachdev launched a new business called Su-vastika with a lot of assistance and support from friends and family. She created this new company with financial assistance from Kunwer's friends and family despite having no prior experience in business management. Her own struggles compelled her to do so, and there was no turning back after that. She met people, made plans, and was aware of every step. Although she was inexperienced, she started Su-vastika with a team thanks to her tenacity and enthusiasm. She made do with her children and elevated Su-vastika.The brand experience, according to Kunwer, begins inward and moves outward from there. It is for this reason that, on the one hand, he provided fresh challenges for his employees to advance their abilities. On the other hand, he observed all the holidays with fervor and took several steps to strengthen the bonds among his team members. The establishment of one of the most admired Indian firms, which revolutionized the power backup market, has earned Kunwer Sachdev his place in history, just like Thomas Edison did. And he is not done yet.\n\nA real \"rags to riches\" story, Kunwer Sachdev was raised by a railway clerk in Delhi's Punjabi Bagh neighborhood while dreaming of starting his own company one day. Following his graduation from college in 1984, he started working full-time in his brother's pen business. He attended a public school where the curriculum was taught in Hindi. He quickly recognized the potential in the field of power backup because he was a visionary from an early age. Due to the challenges of a severe power deficit, he made the decision to shut down his cable TV business and start Su-Kam in 1998. He has since launched numerous additional enterprises, but he has maintained the same Su-Kam throughout his entrepreneurial career for all of his ventures. But where did the name Su-Kam originate? The initials of his daughter's name, his name, and the names of his future children were once combined in Kunwer's mind to form the name of his company.Su-Kam- The Unmatched ProductHe had a difficult time raising money for his business, so it surprised him when clients returned his first 100 inverters due to issues. Never one to give up, he improved his invention and fixed all the flaws to make it better than anything else on the market. Before making cold calls to prospective new clients, he first spoke with a number of his cable TV clients. Realizing that selling to people directly would not help him grow his business, he started approaching dealers and wholesalers. The majority of producers quickly realized that Su-Kam was unmatched in terms of product quality and price, even though the market was already crowded at the time.Su-Kam: MonopolyThey were therefore compelled to accept Kunwer's proposals in order to become his company's initial partner. Soon after, Su-Kam became the first company in the industry to start exporting its products to the aforementioned markets. Kunwer started expanding his business during this time by visiting other nations. Kunwer surmounted new barriers brought on by governmental restrictions, corporate traditions, legal frameworks, and rivalries to establish Su-Kam as a household name in many of these countries. For his achievements, Kunwer Sachdev was given various awards, including the \"Bharat Shiromani\" and the Ernst and Young \"Entrepreneur of the Year\" titles.Su-Kam BankruptcySu-Kam Power Systems Limited filed for bankruptcy as a result of a string of tragic events, and Kunwer Sachdev was forced to quit the company he had considered his own for 32 years of his career and distance himself from it after getting involved in various legal disputes. The man who altered the landscape of India's power backup industry was forced to fight his toughest battle. The business was closed for two years (April 2019-April 2022). There was no help available. Nobody was answering the phone calls or responding to emails. Dealers and customers both suffered greatly during this time.Khushboo Sachdev: A Blessing In DisguiseCustomers, distributors, suppliers, and other company associates were left with a void following Kunwer Sachdev's departure from the business that he started and oversaw from its beginning until 2018. Customers and dealers both suffered because they had unsold goods and services on their hands, and there was no way to resolve any warranty claims from customers. After great effort and difficulty, Kunwer Sachdev's wife, Khushboo Sachdev, stepped up to assist him in these circumstances.Su-Vastika And The Power WomanUnder the guidance of Kunwer Sachdev, Khushboo Sachdev launched a new business called Su-vastika with a lot of assistance and support from friends and family. She created this new company with financial assistance from Kunwer's friends and family despite having no prior experience in business management. Her own struggles compelled her to do so, and there was no turning back after that. She met people, made plans, and was aware of every step. Although she was inexperienced, she started Su-vastika with a team thanks to her tenacity and enthusiasm. She made do with her children and elevated Su-vastika.The brand experience, according to Kunwer, begins inward and moves outward from there. It is for this reason that, on the one hand, he provided fresh challenges for his employees to advance their abilities. On the other hand, he observed all the holidays with fervor and took several steps to strengthen the bonds among his team members. The establishment of one of the most admired Indian firms, which revolutionized the power backup market, has earned Kunwer Sachdev his place in history, just like Thomas Edison did. And he is not done yet.\n\nHe had a difficult time raising money for his business, so it surprised him when clients returned his first 100 inverters due to issues. Never one to give up, he improved his invention and fixed all the flaws to make it better than anything else on the market. Before making cold calls to prospective new clients, he first spoke with a number of his cable TV clients. Realizing that selling to people directly would not help him grow his business, he started approaching dealers and wholesalers. The majority of producers quickly realized that Su-Kam was unmatched in terms of product quality and price, even though the market was already crowded at the time.Su-Kam: MonopolyThey were therefore compelled to accept Kunwer's proposals in order to become his company's initial partner. Soon after, Su-Kam became the first company in the industry to start exporting its products to the aforementioned markets. Kunwer started expanding his business during this time by visiting other nations. Kunwer surmounted new barriers brought on by governmental restrictions, corporate traditions, legal frameworks, and rivalries to establish Su-Kam as a household name in many of these countries. For his achievements, Kunwer Sachdev was given various awards, including the \"Bharat Shiromani\" and the Ernst and Young \"Entrepreneur of the Year\" titles.Su-Kam BankruptcySu-Kam Power Systems Limited filed for bankruptcy as a result of a string of tragic events, and Kunwer Sachdev was forced to quit the company he had considered his own for 32 years of his career and distance himself from it after getting involved in various legal disputes. The man who altered the landscape of India's power backup industry was forced to fight his toughest battle. The business was closed for two years (April 2019-April 2022). There was no help available. Nobody was answering the phone calls or responding to emails. Dealers and customers both suffered greatly during this time.Khushboo Sachdev: A Blessing In DisguiseCustomers, distributors, suppliers, and other company associates were left with a void following Kunwer Sachdev's departure from the business that he started and oversaw from its beginning until 2018. Customers and dealers both suffered because they had unsold goods and services on their hands, and there was no way to resolve any warranty claims from customers. After great effort and difficulty, Kunwer Sachdev's wife, Khushboo Sachdev, stepped up to assist him in these circumstances.Su-Vastika And The Power WomanUnder the guidance of Kunwer Sachdev, Khushboo Sachdev launched a new business called Su-vastika with a lot of assistance and support from friends and family. She created this new company with financial assistance from Kunwer's friends and family despite having no prior experience in business management. Her own struggles compelled her to do so, and there was no turning back after that. She met people, made plans, and was aware of every step. Although she was inexperienced, she started Su-vastika with a team thanks to her tenacity and enthusiasm. She made do with her children and elevated Su-vastika.The brand experience, according to Kunwer, begins inward and moves outward from there. It is for this reason that, on the one hand, he provided fresh challenges for his employees to advance their abilities. On the other hand, he observed all the holidays with fervor and took several steps to strengthen the bonds among his team members. The establishment of one of the most admired Indian firms, which revolutionized the power backup market, has earned Kunwer Sachdev his place in history, just like Thomas Edison did. And he is not done yet.\n\nThey were therefore compelled to accept Kunwer's proposals in order to become his company's initial partner. Soon after, Su-Kam became the first company in the industry to start exporting its products to the aforementioned markets. Kunwer started expanding his business during this time by visiting other nations. Kunwer surmounted new barriers brought on by governmental restrictions, corporate traditions, legal frameworks, and rivalries to establish Su-Kam as a household name in many of these countries. For his achievements, Kunwer Sachdev was given various awards, including the \"Bharat Shiromani\" and the Ernst and Young \"Entrepreneur of the Year\" titles.Su-Kam BankruptcySu-Kam Power Systems Limited filed for bankruptcy as a result of a string of tragic events, and Kunwer Sachdev was forced to quit the company he had considered his own for 32 years of his career and distance himself from it after getting involved in various legal disputes. The man who altered the landscape of India's power backup industry was forced to fight his toughest battle. The business was closed for two years (April 2019-April 2022). There was no help available. Nobody was answering the phone calls or responding to emails. Dealers and customers both suffered greatly during this time.Khushboo Sachdev: A Blessing In DisguiseCustomers, distributors, suppliers, and other company associates were left with a void following Kunwer Sachdev's departure from the business that he started and oversaw from its beginning until 2018. Customers and dealers both suffered because they had unsold goods and services on their hands, and there was no way to resolve any warranty claims from customers. After great effort and difficulty, Kunwer Sachdev's wife, Khushboo Sachdev, stepped up to assist him in these circumstances.Su-Vastika And The Power WomanUnder the guidance of Kunwer Sachdev, Khushboo Sachdev launched a new business called Su-vastika with a lot of assistance and support from friends and family. She created this new company with financial assistance from Kunwer's friends and family despite having no prior experience in business management. Her own struggles compelled her to do so, and there was no turning back after that. She met people, made plans, and was aware of every step. Although she was inexperienced, she started Su-vastika with a team thanks to her tenacity and enthusiasm. She made do with her children and elevated Su-vastika.The brand experience, according to Kunwer, begins inward and moves outward from there. It is for this reason that, on the one hand, he provided fresh challenges for his employees to advance their abilities. On the other hand, he observed all the holidays with fervor and took several steps to strengthen the bonds among his team members. The establishment of one of the most admired Indian firms, which revolutionized the power backup market, has earned Kunwer Sachdev his place in history, just like Thomas Edison did. And he is not done yet.\n\nSu-Kam Power Systems Limited filed for bankruptcy as a result of a string of tragic events, and Kunwer Sachdev was forced to quit the company he had considered his own for 32 years of his career and distance himself from it after getting involved in various legal disputes. The man who altered the landscape of India's power backup industry was forced to fight his toughest battle. The business was closed for two years (April 2019-April 2022). There was no help available. Nobody was answering the phone calls or responding to emails. Dealers and customers both suffered greatly during this time.Khushboo Sachdev: A Blessing In DisguiseCustomers, distributors, suppliers, and other company associates were left with a void following Kunwer Sachdev's departure from the business that he started and oversaw from its beginning until 2018. Customers and dealers both suffered because they had unsold goods and services on their hands, and there was no way to resolve any warranty claims from customers. After great effort and difficulty, Kunwer Sachdev's wife, Khushboo Sachdev, stepped up to assist him in these circumstances.Su-Vastika And The Power WomanUnder the guidance of Kunwer Sachdev, Khushboo Sachdev launched a new business called Su-vastika with a lot of assistance and support from friends and family. She created this new company with financial assistance from Kunwer's friends and family despite having no prior experience in business management. Her own struggles compelled her to do so, and there was no turning back after that. She met people, made plans, and was aware of every step. Although she was inexperienced, she started Su-vastika with a team thanks to her tenacity and enthusiasm. She made do with her children and elevated Su-vastika.The brand experience, according to Kunwer, begins inward and moves outward from there. It is for this reason that, on the one hand, he provided fresh challenges for his employees to advance their abilities. On the other hand, he observed all the holidays with fervor and took several steps to strengthen the bonds among his team members. The establishment of one of the most admired Indian firms, which revolutionized the power backup market, has earned Kunwer Sachdev his place in history, just like Thomas Edison did. And he is not done yet.\n\nCustomers, distributors, suppliers, and other company associates were left with a void following Kunwer Sachdev's departure from the business that he started and oversaw from its beginning until 2018. Customers and dealers both suffered because they had unsold goods and services on their hands, and there was no way to resolve any warranty claims from customers. After great effort and difficulty, Kunwer Sachdev's wife, Khushboo Sachdev, stepped up to assist him in these circumstances.Su-Vastika And The Power WomanUnder the guidance of Kunwer Sachdev, Khushboo Sachdev launched a new business called Su-vastika with a lot of assistance and support from friends and family. She created this new company with financial assistance from Kunwer's friends and family despite having no prior experience in business management. Her own struggles compelled her to do so, and there was no turning back after that. She met people, made plans, and was aware of every step. Although she was inexperienced, she started Su-vastika with a team thanks to her tenacity and enthusiasm. She made do with her children and elevated Su-vastika.The brand experience, according to Kunwer, begins inward and moves outward from there. It is for this reason that, on the one hand, he provided fresh challenges for his employees to advance their abilities. On the other hand, he observed all the holidays with fervor and took several steps to strengthen the bonds among his team members. The establishment of one of the most admired Indian firms, which revolutionized the power backup market, has earned Kunwer Sachdev his place in history, just like Thomas Edison did. And he is not done yet.\n\nSu-Vastika And The Power WomanUnder the guidance of Kunwer Sachdev, Khushboo Sachdev launched a new business called Su-vastika with a lot of assistance and support from friends and family. She created this new company with financial assistance from Kunwer's friends and family despite having no prior experience in business management. Her own struggles compelled her to do so, and there was no turning back after that. She met people, made plans, and was aware of every step. Although she was inexperienced, she started Su-vastika with a team thanks to her tenacity and enthusiasm. She made do with her children and elevated Su-vastika.The brand experience, according to Kunwer, begins inward and moves outward from there. It is for this reason that, on the one hand, he provided fresh challenges for his employees to advance their abilities. On the other hand, he observed all the holidays with fervor and took several steps to strengthen the bonds among his team members. The establishment of one of the most admired Indian firms, which revolutionized the power backup market, has earned Kunwer Sachdev his place in history, just like Thomas Edison did. And he is not done yet.\n\nUnder the guidance of Kunwer Sachdev, Khushboo Sachdev launched a new business called Su-vastika with a lot of assistance and support from friends and family. She created this new company with financial assistance from Kunwer's friends and family despite having no prior experience in business management. Her own struggles compelled her to do so, and there was no turning back after that. She met people, made plans, and was aware of every step. Although she was inexperienced, she started Su-vastika with a team thanks to her tenacity and enthusiasm. She made do with her children and elevated Su-vastika.The brand experience, according to Kunwer, begins inward and moves outward from there. It is for this reason that, on the one hand, he provided fresh challenges for his employees to advance their abilities. On the other hand, he observed all the holidays with fervor and took several steps to strengthen the bonds among his team members. The establishment of one of the most admired Indian firms, which revolutionized the power backup market, has earned Kunwer Sachdev his place in history, just like Thomas Edison did. And he is not done yet.\n\nThe brand experience, according to Kunwer, begins inward and moves outward from there. It is for this reason that, on the one hand, he provided fresh challenges for his employees to advance their abilities. On the other hand, he observed all the holidays with fervor and took several steps to strengthen the bonds among his team members. The establishment of one of the most admired Indian firms, which revolutionized the power backup market, has earned Kunwer Sachdev his place in history, just like Thomas Edison did. And he is not done yet.\n\nThe brand experience, according to Kunwer, begins inward and moves outward from there. It is for this reason that, on the one hand, he provided fresh challenges for his employees to advance their abilities. On the other hand, he observed all the holidays with fervor and took several steps to strengthen the bonds among his team members. The establishment of one of the most admired Indian firms, which revolutionized the power backup market, has earned Kunwer Sachdev his place in history, just like Thomas Edison did. And he is not done yet.\n\nStay informed on all thelatest news, real-timebreaking newsupdates, and follow all the important headlines inindia newsandworld Newson Zee News.\n\nLive Tv\n\nThank you"
    },
    {
        "title": "The Inspirational Journey of Su-Kam's Founder Kunwer ...",
        "link": "https://www.mynation.com/webstories/india-untold/the-inspirational-journey-of-su-kam-founder-kunwer-sachdev-iwh-s3j5ld",
        "date": "N/A",
        "source": "MyNation",
        "snippet": "Kunwer Sachdev, the founder of Su-Kam company, began his journey with hardships but he never gave up. He sold pens door to door and in buses to support his ...",
        "content": "Kunwer Sachdev, the founder of Su-Kam company, began his journey with hardships but he never gave up.\n\nKunwer Sachdev sold pens door to door and in buses to support his education expenses.\n\nDue to financial constraints, Kunwer Sachdev completed his studies from a government school.\n\nKunwer Sachdev’s dream of becoming a doctor remained unfulfilled as he was unable to pass the medical entrance exam.\n\nKunwer Sachdev made the decision to leave his job and established Su-Kam Communication System.\n\nKunwer Sachdev’s solar products can provide electricity for up to 10 hours.\n\nAhad Ahmad: A Remarkable Journey to Achieving Success in UPPSC-J\n\nThe Leading Entrepreneurs of India\n\nRajpal Singh’s Life Changing Innovations and Farming Equipment\n\nThe success story of MRF Tyres, a trusted brand since independence"
    },
    {
        "title": "Kunwer Sachdev-The Founder and Managing Director ...",
        "link": "https://indianbillgates.com/kunwer-sachdev-the-founder-of-su-kam-power-systems-ltd/",
        "date": "N/A",
        "source": "INDIAN BILL GATES",
        "snippet": "Kunwer Sachdev is the founder and Managing Director of Su-kam Power Systems Ltd. Today, Su-Kam is the India-based power solutions provider which sells its ...",
        "content": "Kunwer Sachdev is the founder and Managing Director of Su-kam Power Systems Ltd. Today, Su-Kam is the India-based power solutions provider which sells its products in more than 70 countries. It also provides power back-up solutions for both domestic as well as industrial markets. Kunwer is an Indian entrepreneur who provided design sensibility by his sales distribution network. He has made millions of homes lit up during power outages. By his leadership he has manufactured intelligent power backup solutionsenergy-efficient and environment-friendly nature. It has even ventured solar solutions. He is a great innovator, marketer, motivational speaker and visionary entrepreneur of our country. He is never satisfied with his achievements. This makes him to create better technology.He is particularly interested in making green energy available to everyone in India. He predicted the solar systems use in the country and hence started with the solar panels.Glance at his lifeKunwer was born on 16 November 1962in a middle-class family. He studied in a government school in Punjabi Bagh in Delhi.  His father was a section officer in the Indian Railways. His brother started a business of selling writing instruments. Kunwer helped him in his business since childhood. He always wanted to become and entrepreneur and hence he did not focus on his studies. Still he completed his graduation from Hindu College in statistics and LLB from Delhi University.He has never let financial constraints stop him from becoming an entrepreneur from a young age. He sold pens on cycle with his older brother and founded a profitable business of cable TV communications in Delhi. He looked at the growth of the power backup industry in India and started Su-Kam Power Systems in the year 1988. He started off with an investment of 10,000 rupees. He capitalized the company in the top league in a short span. He made the company as the fastest growing organization among the country. He expanded the company by capturing the power market in Africa and Asia. Now the company includes the products solar off-grid power systems, home inverters, home UPS, Online UPS, line interactive UPS, batteries, battery chargers and Battery Equalizers.BooksHe has been featured in the book ‘Connect the Dots’ for which Rashmi Bansal has authored. The book is about 20 self-made entrepreneurs who had the modest backgrounds. These entrepreneurs did not have any formal business training for creating successful businesses.Another book ‘Making Breakthrough Innovations Happen: How 11 Indians Pulled Off the Impossible’ depicts about the company Su-Kam’s innovations that had created the inverter industry in the country.TV showsHe was interviewed by Renowned Indian journalist RichaAnirudh in the IBN Khabar’s show Zindagi Live. This portrayed the picture of Kunwer for he made Crores of money from the beginning stages.He was also interviewed by ET Now’s show Tee Time. This covered the over view of his successful life.AwardsIn 2011, he has been awarded Entrepreneur of the Year by theat Entrepreneur India awards. This was given for the contribution to the development of entrepreneurship in India.\n\nCategories:\n\nTags:\n\nYour email address will not be published.Required fields are marked*\n\nComment*\n\nName*\n\nEmail*\n\nWebsite\n\nSave my name, email, and website in this browser for the next time I comment."
    },
    {
        "title": "Selling Pens To Building Su-Kam, How Kunwer Sachdev ...",
        "link": "https://www.news18.com/business/selling-pens-to-building-su-kam-how-kunwer-sachdev-transformed-the-power-sector-8660476.html",
        "date": "Nov 14, 2023",
        "source": "News18",
        "snippet": "Su-Kam founder Kunwer Sachdev is the face of the power backup sector in India. The company is one of the most rapidly growing and progressive businesses in the ...",
        "content": "The introduction of electricity transformed the way our lives for decades, but the growing numbers of shortages and their lengthening frequency made the power backup industry necessary. Su-Kam founder Kunwer Sachdev is the face of the power backup sector in India. The company is one of the most rapidly growing and progressive businesses in the country. Sachdev has been an inspiration to many who have proven that dreams do come true if we put in our dedication and hard work with the right energy.\n\nKunwer Sachdev was raised in the family of a railway clerk in Delhi’s Punjabi Bagh neighbourhood while dreaming of starting his own company one day.\n\nFollowing his graduation in 1984, he started working in his brother’s pen business. Due to continuous power outrage, he quickly understood that there was a huge potential in the field of power backup. With the challenges of a severe power deficit, he decided to shut down his cable TV business and start Su-Kam in 1998.\n\nKunwer had a difficult time bringing investment for his business but it surprised him when clients returned his first 100 inverters due to some issues. He then improved them and made them better than the ones available in the market. After much research, he approached dealers and wholesalers. Even though the market was already crowded with various brands Su-kam’s inverters were unmatched in terms of price and quality.\n\nSu-Kam became the first company in the power industry which initiated exporting its products to the international markets.\n\nHe envisioned a Make in India campaign and his company to make a distinguished mark in the global market. He has also captured the markets in the Middle East, Bangladesh, Africa and Nepal where his products were valued for their quality and reliability.\n\nSwipe Left For Next Video\n\nKunwer expanded Su-Kam and made the brand widely known for its proficiency in the solar energy industry. However, due to a series of unfortunate circumstances, Su-Kam went into bankruptcy. Its assets were also frozen. All the services were closed instantly. Due to this, dealers, distributors and customers suffered due to lack of services.\n\nAfter so many hurdles, his wife Khushboo Sachdev, came forward to help give services to the customers.  Khushboo Sachdev started a new venture Su-vastika under the mentorship of Kunwer Sachdev with the help of her friends and distributors. The company has been able to give several services to dealers, distributors and customers. Now, the company will be filing for over 60 patents with 6 under their name.\n\nLatest Blogs"
    },
    {
        "title": "Kunwer Sachdev Email & Phone Number",
        "link": "https://contactout.com/Kunwer-Sachdev-42702598",
        "date": "N/A",
        "source": "ContactOut",
        "snippet": "Kunwer Sachdev phone number is +91.9810016168. How to contact Kunwer Sachdev? To contact Kunwer Sachdev send an email to kunwersachdev@gmail.com, kunwer@ ...",
        "content": "Business Mentor at Various Companies | Gurgaon, Haryana, India\n\nBusiness Mentor atVarious Companiesin April 2019 to Present\n\nMentor Su-vastika Systems Pvt. Ltd. atSu-vastika Systems Private Limitedin December 2019 to August 2024\n\nFounder atSu-kamin December 1988 to August 2019\n\nEx chairman atSu-Kam Power Systems Limitedin August 1988 to August 2019\n\nEx Chairman and Managing Director  atSu-Kam Power Systems Limitedin April 2008 to April 2019\n\nFounder atSu-Kam Power Systems Limitedin January 1988 to March 2019\n\nSee more\n\nSee less\n\nDelhi University, Bachelor's Degree, January 1986 to January 1989\n\nhindu college, statistics, January 1981 to January 1984\n\nGoverment School, Punjabi Bagh, New Delhi, High School, January 1973 to January 1981\n\nSee more\n\nSee less\n\nInnovation Development\n\nDigital Marketing\n\nStart-up Consulting\n\nMobile Marketing\n\nStartup Development\n\nProduct Innovation\n\nMarketing\n\nSales Processes\n\nInternational Business Development\n\nSales\n\nChange Champion\n\nTraining and Development (HR)\n\nInnovation Management\n\nDistribution Strategies\n\nDigital Strategy\n\nTeam Management\n\nSAP\n\nRetail\n\nNew Business Development\n\nKey Account Management\n\nEvent Management\n\nBusiness Development\n\nBusiness Strategy\n\nMarket Research\n\nProduct Development\n\nCRM\n\nForecasting\n\nIncubation\n\nTraining\n\nProduct Management\n\nCustomer Analysis\n\nContinuous Improvement\n\nKaizen\n\nBusiness Planning\n\nAutomotive\n\nManufacturing\n\nLeadership\n\nNegotiation\n\nStrategy\n\nSales Management\n\nMarketing Management\n\nAutomotive Aftermarket\n\nCompetitive Analysis\n\nChannel Partners\n\nManagement\n\nEntrepreneurship\n\nProject Management\n\nBrand Management\n\nMIS\n\nInternational Sales\n\nStart-ups\n\nTeam Building\n\nStrategic Planning\n\nMarketing Strategy\n\nProduct Marketing\n\nInternational Business\n\nOperations Management\n\nSales Operations\n\nChannel Sales\n\nSupply Chain Management\n\nProject Planning\n\nCross-functional Team Leadership\n\nDistributed Team Management\n\nP&L Management\n\nVendor Management\n\nSee more\n\nSee less\n\nEmail Kunwer Sachdev at[email protected],[email protected],[email protected]and[email protected]. This email is the most updated Kunwer Sachdev's email found in 2025.\n\nKunwer Sachdev phone number is +91.9810016168.\n\nTo contact Kunwer Sachdev send an email to[email protected],[email protected],[email protected]or[email protected]. If you want to call Kunwer Sachdev try calling on +91.9810016168.\n\nWhat company does Kunwer Sachdev work for?\n\nKunwer Sachdev works for Various Companies\n\nWhat is Kunwer Sachdev's role at Various Companies?\n\nKunwer Sachdev is Business Mentor\n\nWhat industry does Kunwer Sachdev work in?\n\nKunwer Sachdev works in the Information Technology & Services industry.\n\nFind personal and work emails for over 250M professionals.\n\nTop Searched People\n\nBaseball player\n\nAmerican actor\n\nCanadian film actress\n\nPeople like Kunwer Sachdev\n\nFirearms Instructor & Training Facility Private Investigator Private Patrol Operator RPS\n                                                                    at OSOS Security Services\n\nVP Platform Engineering\n                                                                    atCollectors\n\nService Manager\n                                                                    atAdobe\n\nCEO USA and APAC\n                                                                    atSngular\n\nPresident\n                                                                    atHarbor Compliance\n\nPresident\n                                                                    atECS\n\nSenior Security Program Manager\n                                                                    atMicrosoft\n\nDirector\n                                                                    atJohn S. Knight Journalism Fellowships at Stanford\n\nPresident\n                                                                    atCross Properties\n\nOwner/CEO\n                                                                    at Elect Home Care\n\nCEO/Executive Director\n                                                                    atMichigan Theater\n\nProject Manager\n                                                                    at Lenart Development LLC\n\nBrand Manager - XS Energy Drinks & Sports Nutrition\n                                                                    atAmway\n\nLogistics Manager\n                                                                    atRyder Supply Chain Solutions\n\nRick Beaubelle Owner\n                                                                    atSeattle Canine Club\n\nLead Business Analyst\n                                                                    atMerkle\n\nPrincipal\n                                                                    at The Voice of The Patient, Inc.\n\nHenry Crown Fellow\n                                                                    atThe Aspen Institute\n\nSenior Art Director\n                                                                    atTarget\n\nGlobal Head of Customer Success (Interim)\n                                                                    atBocada\n\nHawaii and Alaska Marketing/Military Liaison\n                                                                    atGEICO\n\nSales Manager\n                                                                    atLawrence Kia\n\nVP, Marketing, CNX - Home & Travel\n                                                                    atCondé Nast\n\nShow more\n\nShow less\n\nEnjoy unlimited access\n                                                                and discover candidates outside of LinkedIn\n\nTrusted by 1.4M users from 76% of\n                                    Fortune 500 companies\n\nThe mostaccuratedata ever\n\nFind anyone, anywherewith ContactOut today\n\nMaking remote or global hires? Connectingwith key decision-makers? We can help.\n\nNo credit card required\n\nProduct\n\nUse Cases\n\nUse Cases\n\nFeatures\n\nCompany\n\nLegal\n\nResources\n\nLegal"
    },
    {
        "title": "Once sold pens to fund his education, now runs Rs ...",
        "link": "https://www.mynation.com/webstories/india-news/once-sold-pens-to-fund-his-education-now-runs-rs-2-300-crore-company-meet-rtm-sh29bf",
        "date": "N/A",
        "source": "MyNation",
        "snippet": "Kunwer Sachdev is known as the 'Inverter Man of India', founder and former CEO of Su-Kam Power Systems. His journey of carving success through humble ...",
        "content": "Kunwer Sachdev is known as the 'Inverter Man of India', founder and former CEO of Su-Kam Power Systems. His journey of carving success through humble beginnings is inspiring.\n\nKunwer was born to a railway clerk father in Punjab Bagh, Delhi. He used to sell pens on the street for his brother's pen business. That's how he funded his education.\n\nAfter graduation, Kunwer wanted to become a doctor and study medical, however due to financial setbacks he had to drop his dream and sell pens to make a small income.\n\nSevere power outages in the city inspired Kunwer to establish Su-Kam in 1998. Initially, he faced challenges, however, he innovated and built better price and quality inverters.\n\nSu-Kam became India's first and largest power company to sell internationally to markets like the Middle East, Bangladesh, and Nepal. It made it a global name.\n\nKunwer revolutionized 'Make in India' and also ventured into solar power. The company expanded its business, however some bad decisions led to its bankruptcy and clients leaving.\n\nSu-Kam was revived by Kunwer's wife, Khushboo Sachdev, who founded Su-Vastika and gained support from clients and friends. Now Su-Kam has a market value of Rs 2,300 crore.\n\nShein is set to re-enter Indian Fashion market; Know how and when!\n\nSawan 2024: 7 Must visit Shiva and Parvati temples in India\n\nOnce sold snacks on cycle, now runs a Rs 4096 crore company, meet...\n\nGuru Purnima 2024: 7 Touching quotes to share with your 'Guru'"
    },
    {
        "title": "Once sold pens to fund his education, now runs Rs ...",
        "link": "https://www.mynation.com/webstories/india-news/once-sold-pens-to-fund-his-education-now-runs-rs-2-300-crore-company-meet-rtm-sh29bf",
        "date": "N/A",
        "source": "MyNation",
        "snippet": "Kunwer Sachdev is known as the 'Inverter Man of India', founder and former CEO of Su-Kam Power Systems. His journey of carving success through humble ...",
        "content": "Kunwer Sachdev is known as the 'Inverter Man of India', founder and former CEO of Su-Kam Power Systems. His journey of carving success through humble beginnings is inspiring.\n\nKunwer was born to a railway clerk father in Punjab Bagh, Delhi. He used to sell pens on the street for his brother's pen business. That's how he funded his education.\n\nAfter graduation, Kunwer wanted to become a doctor and study medical, however due to financial setbacks he had to drop his dream and sell pens to make a small income.\n\nSevere power outages in the city inspired Kunwer to establish Su-Kam in 1998. Initially, he faced challenges, however, he innovated and built better price and quality inverters.\n\nSu-Kam became India's first and largest power company to sell internationally to markets like the Middle East, Bangladesh, and Nepal. It made it a global name.\n\nKunwer revolutionized 'Make in India' and also ventured into solar power. The company expanded its business, however some bad decisions led to its bankruptcy and clients leaving.\n\nSu-Kam was revived by Kunwer's wife, Khushboo Sachdev, who founded Su-Vastika and gained support from clients and friends. Now Su-Kam has a market value of Rs 2,300 crore.\n\nShein is set to re-enter Indian Fashion market; Know how and when!\n\nSawan 2024: 7 Must visit Shiva and Parvati temples in India\n\nOnce sold snacks on cycle, now runs a Rs 4096 crore company, meet...\n\nGuru Purnima 2024: 7 Touching quotes to share with your 'Guru'"
    },
    {
        "title": "Kunwer Sachdev Email & Phone Number",
        "link": "https://contactout.com/Kunwer-Sachdev-42702598",
        "date": "N/A",
        "source": "ContactOut",
        "snippet": "Kunwer Sachdev phone number is +91.9810016168. How to contact Kunwer Sachdev? To contact Kunwer Sachdev send an email to kunwersachdev@gmail.com, kunwer@ ...",
        "content": "Business Mentor at Various Companies | Gurgaon, Haryana, India\n\nBusiness Mentor atVarious Companiesin April 2019 to Present\n\nMentor Su-vastika Systems Pvt. Ltd. atSu-vastika Systems Private Limitedin December 2019 to August 2024\n\nFounder atSu-kamin December 1988 to August 2019\n\nEx chairman atSu-Kam Power Systems Limitedin August 1988 to August 2019\n\nEx Chairman and Managing Director  atSu-Kam Power Systems Limitedin April 2008 to April 2019\n\nFounder atSu-Kam Power Systems Limitedin January 1988 to March 2019\n\nSee more\n\nSee less\n\nDelhi University, Bachelor's Degree, January 1986 to January 1989\n\nhindu college, statistics, January 1981 to January 1984\n\nGoverment School, Punjabi Bagh, New Delhi, High School, January 1973 to January 1981\n\nSee more\n\nSee less\n\nInnovation Development\n\nDigital Marketing\n\nStart-up Consulting\n\nMobile Marketing\n\nStartup Development\n\nProduct Innovation\n\nMarketing\n\nSales Processes\n\nInternational Business Development\n\nSales\n\nChange Champion\n\nTraining and Development (HR)\n\nInnovation Management\n\nDistribution Strategies\n\nDigital Strategy\n\nTeam Management\n\nSAP\n\nRetail\n\nNew Business Development\n\nKey Account Management\n\nEvent Management\n\nBusiness Development\n\nBusiness Strategy\n\nMarket Research\n\nProduct Development\n\nCRM\n\nForecasting\n\nIncubation\n\nTraining\n\nProduct Management\n\nCustomer Analysis\n\nContinuous Improvement\n\nKaizen\n\nBusiness Planning\n\nAutomotive\n\nManufacturing\n\nLeadership\n\nNegotiation\n\nStrategy\n\nSales Management\n\nMarketing Management\n\nAutomotive Aftermarket\n\nCompetitive Analysis\n\nChannel Partners\n\nManagement\n\nEntrepreneurship\n\nProject Management\n\nBrand Management\n\nMIS\n\nInternational Sales\n\nStart-ups\n\nTeam Building\n\nStrategic Planning\n\nMarketing Strategy\n\nProduct Marketing\n\nInternational Business\n\nOperations Management\n\nSales Operations\n\nChannel Sales\n\nSupply Chain Management\n\nProject Planning\n\nCross-functional Team Leadership\n\nDistributed Team Management\n\nP&L Management\n\nVendor Management\n\nSee more\n\nSee less\n\nEmail Kunwer Sachdev at[email protected],[email protected],[email protected]and[email protected]. This email is the most updated Kunwer Sachdev's email found in 2025.\n\nKunwer Sachdev phone number is +91.9810016168.\n\nTo contact Kunwer Sachdev send an email to[email protected],[email protected],[email protected]or[email protected]. If you want to call Kunwer Sachdev try calling on +91.9810016168.\n\nWhat company does Kunwer Sachdev work for?\n\nKunwer Sachdev works for Various Companies\n\nWhat is Kunwer Sachdev's role at Various Companies?\n\nKunwer Sachdev is Business Mentor\n\nWhat industry does Kunwer Sachdev work in?\n\nKunwer Sachdev works in the Information Technology & Services industry.\n\nFind personal and work emails for over 250M professionals.\n\nTop Searched People\n\nBaseball player\n\nAmerican actor\n\nCanadian film actress\n\nPeople like Kunwer Sachdev\n\nFirearms Instructor & Training Facility Private Investigator Private Patrol Operator RPS\n                                                                    at OSOS Security Services\n\nVP Platform Engineering\n                                                                    atCollectors\n\nService Manager\n                                                                    atAdobe\n\nCEO USA and APAC\n                                                                    atSngular\n\nPresident\n                                                                    atHarbor Compliance\n\nPresident\n                                                                    atECS\n\nSenior Security Program Manager\n                                                                    atMicrosoft\n\nDirector\n                                                                    atJohn S. Knight Journalism Fellowships at Stanford\n\nPresident\n                                                                    atCross Properties\n\nOwner/CEO\n                                                                    at Elect Home Care\n\nCEO/Executive Director\n                                                                    atMichigan Theater\n\nProject Manager\n                                                                    at Lenart Development LLC\n\nBrand Manager - XS Energy Drinks & Sports Nutrition\n                                                                    atAmway\n\nLogistics Manager\n                                                                    atRyder Supply Chain Solutions\n\nRick Beaubelle Owner\n                                                                    atSeattle Canine Club\n\nLead Business Analyst\n                                                                    atMerkle\n\nPrincipal\n                                                                    at The Voice of The Patient, Inc.\n\nHenry Crown Fellow\n                                                                    atThe Aspen Institute\n\nSenior Art Director\n                                                                    atTarget\n\nGlobal Head of Customer Success (Interim)\n                                                                    atBocada\n\nHawaii and Alaska Marketing/Military Liaison\n                                                                    atGEICO\n\nSales Manager\n                                                                    atLawrence Kia\n\nVP, Marketing, CNX - Home & Travel\n                                                                    atCondé Nast\n\nShow more\n\nShow less\n\nEnjoy unlimited access\n                                                                and discover candidates outside of LinkedIn\n\nTrusted by 1.4M users from 76% of\n                                    Fortune 500 companies\n\nThe mostaccuratedata ever\n\nFind anyone, anywherewith ContactOut today\n\nMaking remote or global hires? Connectingwith key decision-makers? We can help.\n\nNo credit card required\n\nProduct\n\nUse Cases\n\nUse Cases\n\nFeatures\n\nCompany\n\nLegal\n\nResources\n\nLegal"
    },
    {
        "title": "पेन बेचते बेचते खड़ा कर दिया 2300 करोड़ रुपये का कारोबार, जानिए ...",
        "link": "https://hindi.economictimes.com/news/kunwer-sachdeva-created-a-business-worth-rs-2300-crore-by-selling-pens-know-who-is-su-kam-power-systems-kunwar-sachdev/articleshow/113876623.cms",
        "date": "Oct 2, 2024",
        "source": "The Economic Times Hindi",
        "snippet": "ऐसे में आइए जानते हैं आखिर कैसे कुंवर सचदेव ने पैन बेचते बेचते करोड़ों रुपये की कंपनी खड़ी कर दी. Kunwer Sachdev ... kunwer sachdeva created a business worth rs 2300 ...",
        "content": ""
    },
    {
        "title": "Meet man who once used to sell pens on streets, now ...",
        "link": "https://www.dnaindia.com/business/report-meet-man-who-once-used-to-sell-pens-on-streets-now-owns-rs-2300-crore-company-got-idea-from-3077247",
        "date": "Feb 8, 2024",
        "source": "DNA India",
        "snippet": "Kunwar Sachdev is the man who once sold pens door-to-door and ... Growing up in the family of a railway clerk, Kunwer Sachdev is a ...",
        "content": "BUSINESS\n\nKunwar Sachdev is the man who once sold pens door-to-door and worked as a marketer to fund his education before founding a company worth Rs 2300 crore.\n\nRitik Raj\n\nUpdated :Feb 08, 2024, 10:09 AM IST| Edited by :Ritik Raj\n\nSetting goals and achieving goals are two different things because winners and losers have the same goals, but most fail and few win. Kunwar Sachdev is one such example of achieving his goal. The saying \"one thought changes your entire life\" is often heard but rarely demonstrated. Kunwar Sachdev, for example, used to make a little money by selling pens door to door. One day, however, he had an idea and decided to invest some money to launch a successful business that is now operating not just in India but also in many other countries.\n\nGrowing up in the family of a railway clerk, Kunwer Sachdev is a dreamer who has become a great inspiration in India's power backup industry. His path, characterized by inventiveness and perseverance, demonstrates the transforming potential of commitment. Kunwar had raised the money for his education by going door-to-door to sell pens. He had given up on his dream of becoming a doctor since he could not get medical admission.\n\nWhile working in marketing for a cable company after graduating, Kunwar Sachdev learned that the industry has a lot of room to grow and that not all challenges must be overcome from the start. He just quit his job and founded Su-Kam Communication, which subsequently concentrated solely on producing solar-related products.\n\nThe company owned by Kunwar Sachdev manufactures a variety of solar products that are in high demand in India and abroad. Kunwar Sachdev reportedly owns businesses worth Rs 2300 crore.\n\nSocial worker Ritu Narang wins 'Spirit of Yoga' award at DNA Women Achievers Awards 2025\n\nVersha Verma, Lucknow-based judo player and poet, wins 'Humanitarian of the Year' at DNA Women Achievers Awards 2025\n\n13 soldiers killed, 6 children injured in suicide bombing in Pakistan, here's what we know so far\n\nPankaj Bhadouria wins Super Chef of the Year award at DNA Women Achievers Awards 2025\n\nPadma Shri Dr Soniya Nityanand wins 'Light of India' award at DNA Women Achievers Awards 2025\n\nWarren Buffett takes big decision, donates Rs 51000 crore in Berkshire Shares to..., reason is...\n\nSuparna Sarkar wins Breaking Barriers award at DNA Women Achievers Awards 2025\n\nViral Video: Owner of Mahindra Scorpio parks car in an unusual place, internet jokes, 'Show room feeling'\n\nMLC 2025: Shimron Hetmyer does THIS against Kieron Pollard on last ball during Seattle Orcas vs MI New York match\n\nTrapped in Rs 499 EMIs: The silent financial crisis of India’s young generation\n\nShah Rukh Khan's KKR star batter to join Uttar Pradesh education department, Yogi govt to give him salary of Rs..., he is...\n\nSwati Kapoor, who provides 'Thaal Sewa' to over 1200 people daily, wins 'Social Worker of the Year' at DNA Women Achievers Awards 2025\n\n'Kashi Ki Didi' Ranjubala Singh wins 'Warrior Spirit' award at DNA Women Achievers Awards 2025\n\nICAI to cap individual CA annual audits to 60, from..., president says, ‘CA can also carry out...’\n\nWho is Elizabeth MacDonough? Senate Parliamentarian blocking US President Donald Trump's 'Big, Beautiful bill', can delay the bill beyond deadline of....\n\nAkshara Singh wins Powerhouse Performer of the Year at DNA Women Achievers Awards 2025\n\nKavya Maran's SRH star player grooves to THIS viral song in rickshaw in England, video goes viral, watch\n\nCricketer Virat Kohli has a massive earning from social media, his one Instagram post earns him Rs..., know his latest venture\n\nMeet actress who worked with Kareena Kapoor, Hrithik Roshan, Madhuri Dixit, faced casting couch in the South, received email demanding..., her name is..\n\nBad news for Team India as Jofra Archer likely to return for IND vs ENG match at Edgbaston\n\nBig tension for China, India signs this big deal with Sri Lanka, aim is to..., it will ensure...\n\nDonald Trump wanted Princess Diana to be..., regrets this one thing about her who once said, ‘he gives me...’\n\nThis family keeps 900-year-old heritage of sarees alive, price starts from Rs 1.5 lakh, has this link with Mukesh Ambani's wife Nita Ambani, it is...\n\nThis is world's most valuable company, not owned by Mukesh Ambani, Gautam Adani, Elon Musk, Mark Zuckerberg, Jeff Bezos, total market value is..., name is...\n\nJasprit Bumrah to miss crucial Edgbaston Test? Here's what we know so far\n\nShefali Jariwala's death 'suspicious'? Police launch preliminary investigation as husband Parag Tyagi makes first appearance with..., search her house, question..\n\nMeet royal princess who travelled world, founded organisation that helps..., owns biggest hotel chain in....\n\nChinese flight forced to make emergency landing due to...., passengers say 'plane started shaking...'\n\nIndia's Brahmos vs US' Tomahawk: Know which is more powerful cruise missile\n\nAnother big move by Kumar Mangalam Birla, set to acquire this American company for Rs 10740 crore, it is..., plans to...\n\nOver 3500 Indian millionaires are expected to relocate abroad in 2025 with their staggering wealth of Rs...., migrating to...\n\nIleana D’Cruz welcomes second child with Michael Dolan, names him..., shares first photo\n\nWho is Parag Tyagi? Shefali Jariwala’s husband first met her at dinner party, worked with Amitabh Bachchan in..., has special connection to Sushant Singh Rajput\n\n‘Was under pressure...’: Shefali Jariwala suffered from this neurological disease for 15 years\n\nCommon links between Shefali Jariwala and Sidharth Shukla's death revealed: Cardiac arrest, Bigg Boss 13, and...\n\n'6,6,6,6,6...': Vaibhav Suryavanshi's explosive batting helps India U19 to register comfortable win over England U19\n\nWho is Queen Maxima, lady whose NATO Summit photos went viral, allegedly mocked Donald Trump due to...\n\nKaanta Laga, Bigg Boss 13 fame Shefali Jariwala dies at 42, cause of death revealed to be..., suffered since age of 15 from..\n\nDonald Trump wants full removal of trade barriers in India deal, says Unthinkable, but...'\n\nBad news for Bangladesh, Modi govt bans import of these items via land routes amid strained ties, list includes...\n\nMeet woman, who took inspiration from Virat Kohli's hard work, studied for over 12 hours a day, cracked UPSC exam in first attempt with AIR..., her name is...\n\nAhead of assembly elections, Bihar becomes 1st Indian state to allow e-voting through app, but only available for..., step-by-step guide to register\n\nThis expressway to get India's first AI-powered smart traffic system, can catch violators by detecting..., know complete features\n\nIndia to boost its air defence with Tejas Mk-1A, know their match against F-16, JF-17, Rafale fighter jets\n\nNeeraj Chopra achieves BIG milestone, reclaims number one spot in javelin throw rankings, Pakistan's Arshad Nadeem is at...\n\nIran calls out US President Donald Trump's 'disrespectful' tone towards Supreme Leader Ali Khamenei, says, 'Put aside or...'\n\nDonald Trump issues big warning to Iran, says he will bomb Tehran again ‘without question’ if it continues to...\n\nShefali Jariwala, Kanta Laga and Bigg Boss 13 fame, passes away at 42: Report\n\nDiscover actual location of Panchayat's Phulera Village, X user shares real pictures, now going viral, it is in...\n\nBigg Boss 17 couple Aishwarya Sharma, Neil Bhatt headed for divorce? Actress breaks silence: 'Just because someone is...'\n\nMeet actress, class 12 topper, once a UPSC aspirant, later landed roles alongside John Abraham, Shahid Kapoor,\n\nKannappa box office collection day 1: Akshay Kumar, Prabhas, Mohanlal, Vishnu Manchu-starrer fails to get double-digit opening, earns just Rs...\n\n'It's not easy to...': Ex-India coach fires back at Yashasvi Jaiswal's critics after Leeds fielding nightmare\n\nComplaint filed against this Indian actor for supporting Diljit Dosanjh, Pakistani artists: 'Why these double standards...'\n\nNeeraj Chopra’s BIG surprise to fan after his NC Classic event wish, he offers him...\n\nViral video: IndiGo passenger caught trying to steal life jacket: 'Indians can't be defended'\n\n'Sahi track pe...': Prithvi Shaw reveals Sachin Tendulkar's powerful message sparking his revival\n\nNot Aamir Khan, Ranbir Kapoor, Alia Bhatt, Deepika Padukone; this Bollywood actor has been invited to join the Academy for Oscars 2026 voting\n\nViral video: Australian vlogger criticised for highlighting Delhi's Ghazipur garbage dump, WATCH\n\nGautam Adani’s Adani Power gives massive order of Rs 6500 crore to this company for the construction of...\n\nMeet man who, studied at IIT Kanpur, now joins Meta’s Superintelligence team after leaving OpenAI, he is...\n\nDNA TV Show: Months after RG Kar horror, another rape at Kolkata's Law College puts TMC in docks\n\nVaibhav Suryavanshi dons Virat Kohli's iconic No.18 jersey, smashes 48 off just 19 against England U19 in 1st Youth ODI\n\nJitendra Kumar is highest-paid actor in Panchayat Season 4, know how much Sachiv Ji earned in 8 episodes, net worth is...\n\nIran-Israel War: Iran's BIG statement on talks with US, says, 'Would like to state clearly that...'\n\n'Is it legal': Frustrated by housing prices, man asks if he can live on houseboat full-time\n\nIran’s Ali Khamenei declares ‘victory’ says ‘US intervention prevented Israel from...’, criticises Donald Trump of...\n\nNo India vs Pakistan in Asia Cup 2025? Broadcaster's social media poster sparks speculations\n\n‘Raw talent’: Man dances like MJ to ‘Chaiyya Chaiyya’ with kids, viral video hits 19 million views, WATCH\n\nZohran Mamdani’s old video slamming PM Modi goes viral, calls him..., netizens condemn remarks, ‘spreading fake news’\n\nHe is world's richest beggar, owns two flats in Mumbai, his net worth is...\n\nIran-Israel War: India's FIRST statement after ceasefire between Iran, Israel, says, 'Iran's perspective and thinking...'\n\nMillionaire migration 2025: 10 countries wealthy people are choosing to call home, check list\n\nThe Family Man Season 3 first look: Jaideep Ahlawat, Nimrat Kaur join Manoj Bajpayee; Prime Video show to release on...\n\n'There was threat': Rohit Sharma's shocking hotel revelation before T20 World Cup 2024 match vs Pakistan\n\nWill Donald Trump deport Zohran Mamdani? Indian-origin Democrat can become first Muslim mayor of...\n\nKolkata Law College Rape: TMC MP Kalyan Banerjee's SHOCKING advise to women, says, 'they should be...'\n\nTHIS Islamic nation plans to implement four-working-day system from..., employees will get three week offs! Not Pakistan, Saudi Arabia, Iran, it is...\n\n‘DeepSeek not been able to provide...’: German Federal agency pushes Google, Apple to remove China’s AI service, gives warning of...\n\nKalki 2 in the works? Amitabh Bachchan drops BIG hint about sequel of Prabhas, Deepika Padukone film: 'If they were to...'\n\n'If Lord Ganesha did not let Shiv Ji...': Pavitra Punia objects to male priests changing clothes of goddesses in temples\n\nIND vs ENG Edgbaston Test: Rishabh Pant set to join elite list of players including Sir Don Bradman if...\n\nSay no to frizz this rainy season: 7 effortless ways to keep your hair sleek\n\nTHESE countries helped Israel build atom bombs! How did India,  Nehru keep Jewish state on sidelines? Tel Aviv has... nuclear bombs\n\nJeff Bezos and Lauren Sanchez's pre-wedding party hit by heavy rain, thunderstorm, star-studded event cut short\n\nSHOCKING! West Indies' Gabba star embroiled in sexual harassment claims amid ongoing Australia Test series\n\nMeet man who once was monk, later returned home, now owns empire worth Rs 120 crore, he is...\n\nKolkata SHOCKER! Victim wept, touched his feet, pleaded with folded hands, but TMC leader did not let her go and...\n\nJeff Bezos’s fiancé Lauren Sanchez has a long portfolio, is trained in...,owns big business, her net worth is Rs...\n\nNeeraj Chopra’s heartfelt gesture wins internet after India’s Golden Boy does THIS for a fan seeking Rs 2,000 for…\n\n'Ronit Roy has villas, Sakshi Tanwar has enough money for six generations': Ram Kapoor reveals secret behind wealth of TV stars\n\nMeet Microsoft employee who was laid off after 23 years of service, still continues to go to office, because of...\n\nEngland Women vs India Women, 1st T20I live streaming: When and where to watch on TV and online\n\nMukesh Ambani calls this Reliance investment ‘biggest risk’ of his life but worth taking because...\n\nJanaki Vs State of Kerala: Malayalam film federation calls CBFC demand 'disturbing', condemns 'random takes' on films\n\nDhanush, Nayanthara, Ravi Mohan unite with top South directors, 10 ambitious films in 2 years for...\n\nIran-Israel War: Israel's BIG revelation days after ceasefire, says, 'If Khamenei had been...'\n\n'Saath dena hoga': Mohammed Shami calls out Prasidh, Siraj after Headingley loss, urges pacers to lift burden on Jasprit Bumrah\n\n'That's loo and order': Video of man joining Gujarat high court hearing from toilet goes viral\n\nDharmendra was highest-paid actor for Sholay, received Rs 1.5 lakh to play Veeru, Amitabh Bachchan got just Rs..., lowest earning cast member earned only Rs 35000, name is.."
    },
    {
        "title": "Change the market before it changes you: Su-Kam MD ...",
        "link": "https://energy.economictimes.indiatimes.com/news/power/change-the-market-before-it-changes-you-su-kam-md-kunwer-sachdev/61196561",
        "date": "Oct 24, 2017",
        "source": "ET EnergyWorld",
        "snippet": "New Delhi: Businesses must aim at adopting quickly with changed market conditions, Kunwer Sachdev, Managing Director of power backup ...",
        "content": "By commenting, you agree to theProhibited Content Policy\n\nBy commenting, you agree to theProhibited Content Policy\n\nNews\n\nSee whats happening in Energy sector right now\n\nExclusive\n\nRead and get insights from specially curated unique stories from editorial\n\nLeaders Speak\n\nBusiness leaders sharing their insights\n\nEvents\n\nExplore and discuss challenges & trends in India's leading B2B events\n\nAwards\n\nRecognise work that not only stood out but was also purposeful\n\nWebinars\n\nJoin leaders & experts for roundtables, conferences, panels and discussions\n\nSubscribe to our Daily Newsletter\n\nBy continuing you agree to ourPrivacy Policy&Terms & Conditions\n\nAdvertise With Us\n\nWe have various options to advertise with us including Events, Advertorials, Banners, Mailers, etc.\n\nDownload ETEnergyworld App\n\nSave your favourite articles with seamless reading experience\n\nGet updates on your preferred social platform\n\nFollow us for the latest news, insider access to events and more.\n\nAbout Us\n\nContact Us\n\nNewsletters"
    },
    {
        "title": "Leaderspeak with Kunwer Sachdev",
        "link": "https://www.businesstoday.in/magazine/leadership-spotlight/story/su-kam-power-systems-kunwer-sachdev-on-his-leadership-style-41824-2013-04-25",
        "date": "Apr 25, 2013",
        "source": "Business Today",
        "snippet": "Kunwer Sachdev, MD, Su-Kam Power Systems Ltd shares notes on his leadership style.",
        "content": "Home\n\nMarket\n\nBT TV\n\nReels\n\nMenu\n\nCopyright ©2025Living Media India Limited. For reprint rights: Syndications Today. India Today Group."
    },
    {
        "title": "My First Job: Kunwer Sachdev, Founder & Managing ...",
        "link": "https://content.timesjobs.com/my-first-job-kunwer-sachdev-founder-managing-director-su-kam-power-system-ltd/articleshow/59677843.cms",
        "date": "Jul 20, 2017",
        "source": "TimesJobs",
        "snippet": "Here is an account from Kunwer Sachdev , Founder & Managing Director, Su-Kam Power: 'My First Job' was: I started off by selling pens to support ...",
        "content": ""
    },
    {
        "title": "List of Indian entrepreneurs",
        "link": "https://en.wikipedia.org/wiki/List_of_Indian_entrepreneurs",
        "date": "N/A",
        "source": "Wikipedia",
        "snippet": "Kunwer Sachdev · Su-kam Power Systems · Lakshmi Mittal · ArcelorMittal · Laxmanrao Kirloskar · Kirloskar Group · M. M. Murugappan · Murugappa Group · Mallika ...",
        "content": "This is an accepted version of this page\n\nThis is a list ofnotable Indian entrepreneurs."
    },
    {
        "title": "ઝીરોથી હિરો: ખર્ચ ચલાવવા માટે એક સમયે બસમાં વેચી હતી પેન ...",
        "link": "https://www.divyabhaskar.co.in/news/nat-iftm-su-kam-company-owner-kunwer-sachdev-success-story-gujarati-news-5998606-nor.html",
        "date": "N/A",
        "source": "Divya Bhaskar",
        "snippet": "su kam company owner kunwer sachdev success story.",
        "content": "ગુરૂગ્રામ:શાહરૂખ ખાનની મૂવી ઝીરો રિલીઝ થઇ ચૂકી છે. જેમાં મેરઠના એક ઠીંગણા વ્યક્તિની કહાણી દર્શાવવવામાં આવી છે. આજે આપણે એવા શખ્સ વિશે જાણીએ છે રિયલમાં ઝીરોમાંથી હીરો બન્યો છે. જેને શૂન્યથી શરૂઆત કરી કરી હતી અને આજે એક મુકામ સુધી પહોંચ્યો છે. આ કહાણી છે ગુરૂગ્રામના કુંવર સચદેવની...\n\nનાનકડી દુકાનથી કરી હતી શરૂઆત\n\n-ઇન્વર્ટર બનાવનાર સુ-કૈમ પાવર સિસ્ટમ લિમિટેડ કંપની એક નાનકડી દુકાનથી શરૂ થઇ હતી. આજે તેના ઇન્વર્ટર, યૂપીએસ અને સોલર સિસ્ટમ 70થી વધુ દેશોમાં વેચાય છે.- આ કંપનીના બનાવનાર કુંવર સચદેવ છે જે હવે  સોલરમેન ઓફ ઇન્ડિયાને નામે ઓળખાય છે.- કુંવરે એક ઇન્ટરવ્યુમાં જણાવ્યું હતું કે, સુ-કૈમ શબ્દનો અર્થ થાય છે 'કંઇ જ નહીં' આ નામે મેં 31 વર્ષ પહેલા એક પેનના બિઝનેસ માટે નક્કી કર્યું હતું.\n\nબાળપણમાં ભાઈ સાથે વેચી પેન\n\n- કુંવર બાળપણમાં તેના મોટા ભાઇ સાથે સાઇકલ પર ગલી-ગલી ફરીને પેન વેચતો હતો.- સ્ટેટિસ્ટિક્સમાં ઓનર્સ બાદ બધો જ સમય ભાઈને પેન વેચવામાં મદદ કરતો હતો.- થોડા સમય બાદ પેન વેચવાનું બંધ કરીને દિલ્લી યુનિવર્સિટીમાં લોનો અભ્યાસ કર્યો.\n\nટીવી કેબલનું પણ કર્યું કામ\n\n- ગ્રેજયુએશન બાદ કુંવરે કેબલ ટીવી કંપનીમાં માર્કેટિંગનું પણ કર્યું કામ.- નોકરીમાંથી બચાવેવા 10 હજાર રૂપિયાથી 1988માં ખુદનો કેબલનો બિઝનેસ શરૂ કર્યો. જેનું નામ સુ-કૈમ રાખ્યું.- 1991માં ગ્લોબલાઇઝેશન બાદ ટીવી કેબલનો બિઝનેસ ખૂબ ચાલ્યો.\n\nઆ દુર્ઘટનાએ બદલી જિંદગી- વર્ષ 2000માં કુંવરના ઇન્વર્ટના કારણે બાળકને કરંટ લાગ્યાની ઘટના બની.- આ ઘટના બાદ કુંવર ખૂબ જ દુ:ખી થઇ ગયો અને પ્લાસ્ટિકની બોડીવાળા ઇન્વર્ટર બનાવવાનું શરૂ કર્યું.\n\nડો. બનવા ઇચ્છતા હતા કુમાર સચદેવ\n\n- કુંવરના પિતા રેલવેમાં સેક્શન ઓફિસર હતા અને તે સમયે તેનો પગાર વધુ ન હતો.- સચદેવ જ્યારે પાંચમાં ધોરણમાં હતો ત્યારે પિતાએ તેને પ્રાઇવેટ સ્કૂલમાંથી સરકારીમાં ટાન્સફર કરી દીધો.- 12માં ધોરણ બાદ સચદેવે મેડિકલની એક્ઝામ આપી જો કે સફળતા ન મળી,\n\nવાંચન અને સંગીતમાં રસ\n\n- કુંવરને બુક રીડીંગ, હાર્મોનિયમ વાગડવું, સ્વિમિંગ,યોગ, અને મેરાથોનમાં રસ છે.-સચદેવના મોટા દીકરા કણવે લંડનમાં અભ્યાસ કર્યો છે. તે સુ-કૈમમાં જ સેલ્સ, માર્કેટિંગ અને સર્વિસેસનું કામ સંભાળે છે. તેમને ફૂટબોલ અને ક્રિકેટ રમવું પસંદ છે.- બીજા દીકરા સૌર્યે ILNB પ્રોડક્શન્સ નામથી ફિલ્મ કંપની પણ ખોલી છે.\n\nCopyright © 2024-25 DB Corp ltd., All Rights Reserved\n\nThis website follows theDNPA Code of Ethics."
    },
    {
        "title": "पॉवर बैकअप से लेकर सोलर सेक्टर में ऐसे हुई क्रांति, 'द इन्वर्टर ...",
        "link": "https://www.tv9hindi.com/technology/kunwer-sachdev-the-inverter-man-of-india-gave-new-direction-to-world-in-power-backup-au564-1654820.html",
        "date": "Jan 10, 2023",
        "source": "TV9 Bharatvarsh",
        "snippet": "... Kunwer Sachdev, 'The Inverter Man of India, gave new direction to world in power backup. पॉवर बैकअप से लेकर सोलर ...",
        "content": "By signing in or creating an account, you agree with Associated Broadcasting Company'sTerms & ConditionsandPrivacy Policy.\n\n‘द इन्वर्टर मैन ऑफ इंडिया’ और ‘द सोलर मैन ऑफ इंडिया जैसे कई खिताबों से नवाजे जाने वाले कुंवर सचदेव(Kunwer Sachdev)ने पॉवर बैकअप की दुनिया में क्रांति लाने का काम किया है. कुंवर सचदेव ने Su-Kam कंपनी की शुरुआत साल 1998 से की थी, जिसके साथ वो 2018 के शुरुआत तक जुड़े हुए थे. आजकल वो पॉवर बैकअप और स्टोरेज कंपनीSu-vastika Power System private Limitedका मार्गदर्शन कर रहे हैं.\n\nकुंवर सचदेव एक उद्यमी, मार्केटर, इनोवेटर, मोटिवेशनल स्पीकर, थिंकर और लीडर हैं. उन्होंने इनावेटिव और यूजर फ्रेंडली प्रोडक्ट्स के साथ भारत में पॉवर बैकअप सेक्टर में क्रांति लाने का काम किया, इनके द्वारा भारत में बने इनवर्टर को न केवल भारत में बल्कि मध्य पूर्व, अफ्रीका और बांग्लादेश और नेपाल सहित दक्षिण पूर्व एशियाई देशों में एक घरेलू नाम बना दिया. यूपीएस/इन्वर्टर और सोलर सेक्टर में उनके योगदान के कारण, उन्हें ‘द इन्वर्टर मैन ऑफ इंडिया’ और ‘द सोलर मैन ऑफ इंडिया’ भी कहा जाता है.\n\n1990 के दशक में, जब भारत बिजली की समस्या से जूझ रहा था, कुंवर सचदेव ने पॉवर बैकअप इंडस्ट्री में असंगठित बाजार का तुरंत विश्लेषण किया, जो उस समय पूरी तरह से अव्यवस्थित था, जिसमें घटिया उत्पाद और लोकर प्लेयर मार्केट पर हावी थे. पॉवर बैकअप इंडस्ट्री को एक संगठित क्षेत्र में बदलने में उनका महत्वपूर्ण योगदान था. पॉवर बैकअप के क्षेत्र में आप जितने भी सफल इनोवेशन देखते हैं, उनमें से अधिकांश उन्हीं के दिमाग की उपज हैं.\n\nभारतीय होने के नाते ग्लोबल मार्केट में एक विशिष्ट पहचान बनाने के लिए एक ‘मेक इन इंडिया’ कंपनी की कल्पना की थी. जिसके बाद उन्होने मध्य पूर्व, अफ्रीका, बांग्लादेश और नेपाल के अंतरराष्ट्रीय बाजारों में अपनी धाक जमाई, जहां उनके उत्पादों को उनकी गुणवत्ता और विश्वसनीयता के लिए पसंद किया जाता है. इन देशों मे चाइना के उत्पाद को बाहर का रास्ता दिखा दिया. आज भी भारतीय इन्वर्टर और यूपीएस चाइनीज की तुलना में अधिक पसंद किए जाते हैं और इसके लिए उनके प्रयासों को बहुत बड़ा श्रेय जाता है. कुंवर सचदेव के मार्गदर्शन में, सु-काम तेजी से विस्तार करता रहा और सौर ऊर्जा उद्योग में अपनी विशेषज्ञता के लिए व्यापक रूप से जाना जाने लगा.\n\n1998 से संगठित हुई Su-Kam कंपनी कई कारणों की वजह से दिवालिया हो गयी थी. जिसके बाद कंपनी की संपत्ति को फ्रीज़ कर दिया गया था. इस तरह से कुंवर सचदेव से Su-Kam ब्रांड छीन गया. कंपनी के दिवालिया होने के बाद डीलर्स और डिस्ट्रीब्यूटर्स के साथ-साथ ग्राहकों को सेवाओं की कमी आ गयी थी और उनके सामान को भी ग्राहक द्वारा नहीं खरीदा जा रहा था जिससे वो परेशानी मे आ गए थे. अपने ग्राहकों, वितरकों और खुदरा विक्रेताओं की मदद करने में असमर्थ कुंवर सचदेव कुछ समय के लिए अवसाद में आ गए.\n\nइतने संघर्ष और चुनौतियों के बाद उनकी पत्नी खुशबू सचदेव उनके मदद के लिए आगे आयी. उन्होंने दोस्तों और रिश्तेदारों की काफी मदद के बाद, खुशबू सचदेव ने कुंवर सचदेव के मार्गदर्शन में एक नया उद्यम Su-vastika शुरू किया. Su-vastika में कुंवर सचदेव द्वारा बनाए गए उत्पाद अपनी आसान हैंडलिंग और मज़बूती के कारण मार्केट मे मौजूद दूसरे उत्पादों को पछाड़ने मेन सक्षम हैं. सचदेव ने Su-vastika में जो उत्पाद विकसित किए हैं, वे अगली पीढ़ी के पावर बैकअप समाधानों को भारत में लाने के लिए तैयार हैं.\n\nकुंवर सचदेव के योग्य मार्गदर्शन में, Su-vastika ने 6 पेटेंट के साथ 60 से अधिक पेटेंट फाइल करने के लिए पावर बैकअप उद्योग में एकमात्र कंपनी होने का रिकॉर्ड बनाया हैं. Su- Vastika में वे न केवल पावर बैकअप उद्योग में बल्कि ऊर्जा, आर्टिफिशियल इंटेलिजेंस, संचार आदि से संबंधित कई अन्य क्षेत्रों में लगातार नए पेटेंट विचारों के साथ नए उत्पादों को लेकर मार्केट मे आ रहे हैं.\n\nSu-vastika के संरक्षक के रूप में कुंवर सचदेव द्वारा विकसित कुछ प्रमुख उत्पादों में LiFEePO4 बैटरी प्रौद्योगिकी-आधारित एनर्जी स्टोरेज सिस्टम, EV के लिए स्वचालित परीक्षण सेटअप, PCB, BMS, सौर संगत EV चार्जर और लिफ्ट के लिए आपातकालीन बचाव उपकरण शामिल हैं. इसी के साथ कुंवर सचदेव का सपना हैं कि भारत का हर घर सौर ऊर्जा से परिपूर्ण हो जिसके लिए वो खुद कहते है की मैं भारत में हर घर को सौर ऊर्जा से संचालित होते देखना चाहता हूं. मैं चाहता हूं कि हर व्यवसाय, बड़ा या छोटा, सौर ऊर्जा में निवेश करे और निर्बाध लाभ प्राप्त करे."
    }
]