[
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar",
    "link": "https://en.wikipedia.org/wiki/Manohar_Lal_Khattar",
    "source": "Google",
    "snippet": "A prominent leader of the Bharatiya Janata Party, he has served as the 10th Chief Minister of Haryana from 26 October 2014 until his resignation on 12 March ...",
    "date": "N/A",
    "content": "\n\nManohar Lal Khattar(born 5 May 1954) is an Indian politician who has been serving as theMinister of PowerandMinister of Housing and Urban Affairsin thecentral Modi governmentsince June 2024. A prominent leader of theBharatiya Janata Party, he has served as the10thChief Minister of Haryanafrom 26 October 2014 until his resignation on 12 March 2024.\n\nIn the2024 Indian general election, he has been elected to theLok Sabha, thelower houseof theParliament of India, fromKarnal,Haryana.[2]While serving as Chief Minister, he has represented theKarnalconstituency in theHaryana Legislative Assemblyfrom 2014 to 2024.[3]He has also been aRSS pracharakand has served as the Organizational General Secretary of the BJP in Haryana from 2000 to 2014.\n\nKhattar was born on 5 May 1954 inNindanavillage ofMehamtehsil in theRohtak districtofEast Punjab, India into aPunjabi Hindufamily.[4][5]His father, Harbans Lal Khattar, had migrated to the village from theJhang districtofWest Punjabfollowing thePartition of Indiain 1947. His family initially settled in the BanyanivillageofRohtak districtand took up farming.[6]\n\nKhattar completed his matriculation (final year of high school) from Pandit Neki Ram SharmaGovernmentCollege,Rohtak.[7]He then moved in with relatives inDelhi, and ran a cloth shop with them nearSadar Bazar[8]while completing his bachelor's degree fromUniversity of Delhi.[9]\n\nKhattar joinedRashtriya Swayamsevak Sangh(RSS) in 1977 and became a full-time pracharak three years later.[10]As a pracharak, he is a lifelong bachelor.[11]He worked as a full-time pracharak for 17 years before moving to BJP, in 1994.[10][7]\n\nDuring 2000–2014, Khattar was Organizational General Secretary of the BJP in Haryana. during his tenure the state unit was also started a publication ofBhajpa Ki Baatmagazine in October 2000.[12]He was the Chairman of BJP's Haryana Election Campaign Committee for2014 Lok Sabha Elections.[13]Subsequently, he became a member of BJP's National Executive Committee.[13][14]\n\nIn 2014, Khattar was nominated as BJP's candidate fromKarnal constituencyfor the Haryana Legislative Assembly election, 2014. The party's workers and supporters in Karnal launched a signature campaign, asking the party leadership to field a local candidate instead of him.[15]His opponent, theIndian National Congresscandidate andDeepender Singh Hooda, accused Khattar of being an \"outsider\" not native to Karnal. But Modi wave helped Mr. Khattar win elections by heavy margin.[16]\n\nIn the elections, the BJP gained a majority in Haryana for the first time, and Khattar won his maiden election by a margin of 63,736 votes. During a party meeting, his name was proposed for theChief Minister of Haryanapost by Haryana BJP PresidentRam Bilas Sharma, seconded by other strong Chief Minister of Haryana claimantRao Inderjeet Singhand supported by manyMLAs. He became the BJP's first Chief Minister of Haryana after his swearing-in ceremony on 26 October 2014.[17][18]\n\nOn 27 October 2019, Khattar was sworn in as the chief minister for the second time, after making an alliance withDushyant Chautala'sJannayak Janta Partypost2019 Haryana Legislative Assembly election.[19][20]\n\nKhattar submitted his resignation to Haryana GovernorBandaru Dattatreyaon 12 March 2024 after the development came amid speculation of cracks emerging in the state's ruling BJP andJannayak Janta Party(JJP) coalition over seat sharing ahead of the2024 Lok Sabha elections,[21]and on 13 March he tendered his resignation from the Haryana Legislative Assembly.[22]\n\nIn March 2024, he was announced as the BJP candidate for theKarnal constituencyin the2024 Indian general election.[23]Khattar subsequently won from the seat.[2]In June 2024, Khattar was appointed theMinister of PowerandMinister of Housing and Urban Affairs.[24]\n\nKhattar announced that Haryana will have an all-woman police station in each district and around 500 woman constables will be recruited. He also started a 24×7 portal calledHarsamaythrough which anybody can file a complaint online.[25]\n\nHe has also suggested that Yoga to be a part of police constables' training to help keep the police personnel mentally and physically fit. According to media reports, Khattar has said that Police recruitments would be made on Transparent Recruitment Policy (TRP) and 3,060 new houses would be constructed for police personnel at a cost of Rs 550 crore in next three years.[26]\n\nManohar Lal Khattar has introduced e-services through Common Service Centres including biometric attendance system in all the government offices through which attendance of all officers will be available online and monitored.[27]\n\nIn July 2022, Manohar Lal Khattar championed the cause ofIndian reunification, declaringopposition to the partition of India.[28]Khattar likened the present divisions in the Indian subcontinent to those of East and West Germany, which were dissolved withGerman reunificationin the 1990s.[28]\n\nManohar Lal Khattar's Government has been in news for taking steps to implementBeti Bachao, Beti Padhao Yojanascheme that was flagged off by India's Prime MinisterNarendra Modi. The child gender ratio has been improved in Haryana since he assumed power. It is now 889 girls per 1,000 boys. \"Efforts are being made to further take it (child gender ratio) to above 900,\" Khattar has said in a public statement.[29]\n\nManohar Lal Khattar has publicly declared that his government will build a memorial to mark the sacrifice of Garud Commando Gursewak Singh, who was killed in a terrorist attack in Pathankot.[30]\n\nManohar Lal Khattar is criticised for his remarks on rape and women issues.[31]During his election campaign for 2014 polls in India, he said: \"If they (women) want freedom, why don't they just roam around naked? Freedom has to be limited.\"[32][33]Likewise, on 16 November 2018, he has stated, \"The biggest concern is that in 80-90% of rapes and eve-teasing cases, the accused and the victim know each other. In many cases, they know each other for a long time, and on one day, when there is an argument,... an FIR is lodged, saying that this person has raped me.\" This evoked strong condemnation from the opposition.[34]On 3 April 2023, he again stirred a controversy by making a remark that a \"[high court] judge needed to be \"fixed\". The opposition believes this is interference with the judiciary and have demanded an apology and that a contempt of court notice be issued against him.[35]"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal (@mlkhattar) • Instagram photos and videos",
    "link": "https://www.instagram.com/mlkhattar/?hl=en",
    "source": "Google",
    "snippet": "Minister of Housing and Urban Affairs, Minister of Power (Government of India) manoharlalkhattar.in",
    "date": "N/A",
    "content": ""
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Latest News on Manohar Lal Khattar",
    "link": "https://www.business-standard.com/about/who-is-manohar-lal-khattar",
    "source": "Google",
    "snippet": "Manohar Lal Khattar is an Indian politician who is the Union Minister of Power and also holds the Housing and Urban Affairs portfolio under the newly formed ...",
    "date": "N/A",
    "content": "❌ Error extracting content"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar: Latest News, Photos, Videos & Updates",
    "link": "https://indianexpress.com/about/manohar-lal-khattar/",
    "source": "Google",
    "snippet": "Manohar Lal Khattar has been the chief minister of Haryana for two consecutive terms since 2019. Khattar and his cabinet ministers resigned on March 12, 2024, ...",
    "date": "N/A",
    "content": "Other Related Pages:\n\nJune 12, 2025 12:32 pm\n\nIf the government's move is approved, it could change how Indians use their ACs at home and in public spaces like hotels and cars.\n\nMay 09, 2025 2:53 am\n\nThe meeting between Delhi CM Rekha Gupta and Union minister Manohar Lal Khattar was to discuss several ongoing projects in Delhi, including cleaning the Yamuna river and improving city infrastructure.\n\nMarch 23, 2025 12:28 pm\n\nThe buzz in the BJP was that the choice for the next BJP party chief would boil down to Bhupender Yadav or Dharmendra Pradhan. Yadav is backed by Suresh Soni and Pradhan by Dattatreya Hosabale, both RSS heavyweights. But recently, Manohar Lal Khattar’s name also cropped up as a potential contender.\n\nJanuary 09, 2025 10:53 pm\n\nDelhi electorate's caste composition also seems to have determined BJP’s pick of 16 campaigners from Haryana, with CM Saini and Khattar belonging to OBC and Punjabi groups respectively\n\nDecember 22, 2024 2:05 am\n\nThe funeral pyre was lit by Chautala’s sons —  JJP leader Ajay Chautala and INLD leader Abhay Chautala —  in the presence of their family members, friends and hundreds of party workers.\n\nNovember 09, 2024 9:10 am\n\nKhattar pushes for separate electricity bills for domestic and commercial categories\n\nNovember 09, 2024 8:49 am\n\nSo far, 1,867 homeowners have installed solar systems, while over 4,500 have yet to comply.\n\nNovember 08, 2024 8:34 pm\n\nUnion minister Khattar said the Metro will be a very costly operation given the low ridership.\n\nOctober 22, 2024 4:14 am\n\nCurrently, Namo Bharat operates at nine stations including Sahibabad, Ghaziabad, Guldhar, Duhai, Duhai Depot, Muradnagar, Modinagar South, Modinagar North and Meerut South.\n\nOctober 22, 2024 3:03 am\n\nIn 2019, Manohar Lal Khattar took charge of the finance ministry but the home portfolio went to Anil Vij.\n\nA faceless outfit with East Delhi address is at heart of probes in 6 states; banks claim they follow process, KYC norms, but how red flags are ignored even as cyber scamsters passed crores of stolen money right under their noses through ghost accounts opened by fictitious outfits\n\nJanuary 10, 2021 3:40 pm\n\nThe police had to resort  to mild lathi-charge against the farmers. Water canons and teargas was also used but to no avail. The landing spot for Haryana CM Manohar Lal Khattar’s helicopter was moved to a different location due to the breach in security.\n\nJune 03, 2016 7:10 pm\n\n\n\nApril 24, 2016 3:56 pm\n\n\n\nFebruary 19, 2016 8:16 am\n\nChandigarh, Feb 19 (ANI): An all-party meeting called by Haryana Chief Minister Manohar Lal Khattar was held in Chandigarh to discuss the rising demand for Jat reservation. Bharatiya Janata Party (BJP) spokesperson Jawahar Yadav said the meeting had been called to find a solution regarding the BJP-supported reservation issue. Jat community in Haryana has been repeatedly demanding reservation in government jobs and educational institutions under the Other Backward Class (OBC) category.\n\nFebruary 10, 2016 11:38 am\n\nChennai, Feb 10 (ANI): Supporting the Haryana's Health Minister Anil Vij statement on beef, Haryana Chief Minister Manohar Lal Khattar on Wednesday said there should be no controversy on Vij's remark, as they already have an act banning beef in the state. Totally agreeing with Vij's statement, he said that no beef in Haryana. Anil Vij on Wednesday stroked a fresh row saying those who cannot live without eating beef should not visit the state where stringent cow protection law is in place.\n\nDecember 24, 2015 9:52 am\n\nHaryana Chief Minister Manohar Lal Khattar, who completes one year in office later this month as the head of a BJP government, told The Indian Express in an interview that the cow, the Gita and Saraswati were articles of faith for the majority in the country, and that Muslims would not be violating their religious beliefs by giving up beef."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Surprise! The rise, fall & rise of Manohar Lal Khattar",
    "link": "https://timesofindia.indiatimes.com/city/chandigarh/surprise-the-rise-fall-rise-of-manohar-lal-khattar/articleshow/110722264.cms",
    "source": "Google",
    "snippet": "In 2014, Khattar was a first-time MLA, an unknown face in the state's politics who had surprised everyone by being handed the top post after BJP ...",
    "date": "Jun 5, 2024",
    "content": "Ajay Sura is Senior Assistant Editor with The Times of India Chandigarh. He covers news concerning the State of Haryana, Punjab & Haryana High Court and Defence & Military Affairs. He likes to analyse political developments and decoding judicial pronouncements. His hobbies include travelling, mountaineering and trekking.Read More\n\n10 most beautiful pictures of space shared by NASAâs James Webb\n\n10 fascinating facts about actress Kayadu Lohar\n\nMesmerizing looks of Srinidhi Shetty\n\nIn pics: Elegant looks of actress Nandita Swetha\n\n10 ways to add sooji to daily breakfast\n\n10 biggest airports in the world by area\n\n10 places to visit around Delhi NCR to escape dust storm and air pollution\n\n10 easy-to-grow flowers to sow in May that will bloom beautifully by July-August\n\n9 exceptional books that will magically improve your communication & negotiation skills\n\n8 fish that rule the ocean with the fastest speed"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "503 Cm Manohar Lal Khattar Photos & High Res Pictures",
    "link": "https://www.gettyimages.com/photos/cm-manohar-lal-khattar",
    "source": "Google",
    "snippet": "Haryana Chief Minister Manohar Lal Khattar during the Voice of Unity Concert at Tau Devi Lal Stadium, on January 31, 2017 in Gurugram, India. The...",
    "date": "N/A",
    "content": ""
  },
  {
    "query": "Manohar lal Khattar",
    "title": "PM Modi greets ML Khattar on his birthday",
    "link": "https://ddnews.gov.in/en/commendable-efforts-towards-boosting-urban-infrastructure-pm-modi-greets-ml-khattar-on-his-birthday/",
    "source": "Google",
    "snippet": "Born on May 5, 1954, in Nindana village of Meham tehsil, Rohtak district, Khattar hails from a family that migrated from Jhang district (now in ...",
    "date": "May 5, 2025",
    "content": "Feedback| Tuesday, July 01, 2025\n\n05/05/25 | 9:44 am| ML Khattar| PM Modi\n\nPrime Minister Narendra Modi on Monday extended warm birthday wishes to Union Minister Manohar Lal Khattar on the occasion of his 71st birthday, commending his contributions to urban infrastructure and the power sector.\n\nIn a post on X, PM Modi said, “Best wishes to Union Minister Shri Manohar Lal Khattar Ji on his birthday. His efforts towards boosting urban infrastructure and strengthening India’s power sector are commendable. Praying for his long and healthy life.”\n\nUnion Home Minister Amit Shah also conveyed his birthday greetings, highlighting Khattar’s role in advancing the Prime Minister’s vision of housing for all.\n\n“Heartiest birthday wishes to Union Minister Shri Manohar Lal Khattar Ji. You are doing remarkable work towards making the country self-reliant in the field of energy and in realising Modi Ji’s dream of ensuring every poor person has their own house. I pray to God for your good health and long life,” Shah wrote on X.\n\nUttar Pradesh Chief Minister Yogi Adityanath, in his message, referred to Khattar as a “popular politician” and wished him a long and prosperous life.“Heartiest birthday wishes to Honourable Union Minister Shri Manohar Lal Khattar Ji! I pray to Lord Shri Krishna, Dwarkadheesh, to bless you with good health, a long life, and continued glory,” the Chief Minister posted.\n\nManohar Lal Khattar currently serves as the Union Minister of Housing and Urban Affairs as well as the Minister of Power. He represents the Karnal constituency in Haryana in the Lok Sabha.\n\nA seasoned politician and former RSS pracharak, Khattar was the 10th and the first BJP Chief Minister of Haryana. He first assumed office on October 26, 2014, following the BJP’s victory in the state assembly elections. He was re-elected in 2019 and formed an alliance government with the Jannayak Janta Party, appointing Dushyant Chautala as Deputy Chief Minister.\n\nBorn on May 5, 1954, in Nindana village of Meham tehsil, Rohtak district, Khattar hails from a family that migrated from Jhang district (now in Pakistan) to Haryana during the Partition in 1947.\n\n—IANS\n\n06/05/25 | 8:19 am\n\n25/05/25 | 12:49 pm\n\n04/04/25 | 2:52 pm\n\n15/06/25 | 11:16 am\n\n14/05/25 | 9:54 am\n\n14/05/25 | 9:54 am\n\n14/05/25 | 9:54 am\n\n14/05/25 | 9:54 am\n\n14/05/25 | 9:54 am\n\nWe will send you breaking news right to your inbox"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Latest News, Photos, Videos on Manohar Lal Khattar",
    "link": "https://www.ndtv.com/topic/manohar-lal-khattar",
    "source": "Google",
    "snippet": "Union Minister and BJP leader Manohar Lal Khattar on Saturday attacked the Congress, saying its \"lies\" will not work in the Haryana assembly polls, and exuded ...",
    "date": "N/A",
    "content": "❌ Error extracting content"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Former Haryana CM Khattar gets two ministries, Power and ...",
    "link": "https://m.economictimes.com/news/india/former-haryana-cm-khattar-gets-two-ministries-power-and-urban-development-in-pm-modis-new-cabinet/articleshow/110879290.cms",
    "source": "Google",
    "snippet": "Former Haryana Minister Manohar Lal Khattar has been allocated Ministry of Power, Housing and Urban Development in Prime Minister Narendra Modi's new cabinet.",
    "date": "Jun 10, 2024",
    "content": "\n\nFrom RSS pracharak to Union Minister, former Haryana CM Khattar begins new innings\n\nModi Cabinet portfolios allocated; Sitharaman retains finance ministry, Jaishankar to serve as EAM again\n\nBJP President JP Nadda gets two ministries, Health and Fertilizers, in PM Modi's new cabinet\n\n(Catch all theBusiness News,Breaking News,Budget 2025Events andLatest NewsUpdates onThe Economic Times.)\n\nSubscribe toThe Economic Times Primeand read theET ePaperonline.\n\n(Catch all theBusiness News,Breaking News,Budget 2025Events andLatest NewsUpdates onThe Economic Times.)\n\nSubscribe toThe Economic Times Primeand read theET ePaperonline.\n\n\n\nCrash. Silence. Confusion. How India’s air accident watchdog is failing its biggest test yet\n\nOil, war, and the Hormuz gambit: Why the 2025 standoff won’t mirror the 2022 shock!\n\nIndex funds were meant to simplify investing. Why are they overwhelming investors now?\n\nHow Vedanta’s Anil Agarwal bettered Warren Buffett in returns\n\nLooking for quick buck in unlisted shares? Better think twice!\n\nProfits plenty, prices attractive, still PSU stocks languish. Why?\n\n'Big beautiful bill': US Senate clears Trump's ambitious bill\n\nPuri Stampede: Three dead, several injured\n\nPM's light-hearted chat with Shubhanshu Shukla\n\nHouthis launch ballistic missile at Israel\n\nIran mourns commanders killed in Israeli strikes\n\n‘I love you...’: Trump's viral moment with reporter\n\nBJP's Sambit Patra addresses a press conference\n\nTensions rise as Israel strikes Lebanon again\n\nShefali Jariwala dies at 42\n\n‘Stubborn mule’: Trump blasts Fed Chair Powell\n\nHot on Web\n\nIn Case you missed it\n\nTop Searched Companies\n\nTop Calculators\n\nTop Commodities\n\nTop Slideshow\n\nTop Prime Articles\n\nPrivate Companies\n\nTop Story Listing\n\nTop Definitions\n\nTop Market Pages\n\nLatest News\n\nFollow us on:\n\nFind this comment offensive?\n\nChoose your reason below and click on the Report button. This will alert our moderators to take action\n\nReason for reporting:\n\nYour Reason has been Reported to the admin.\n\nLog In/Connect with:\n\nWill be displayed\n\nWill not be displayed\n\nWill be displayed\n\nWorry not. You’re just a step away.\n\nIt seems like you're already an ETPrime member with\n\nLogin using your ET Prime credentials to enjoy all member benefits\n\nLog out of your current logged-in accountand log in again using your ET Prime credentials  to enjoy all member benefits.\n\nBig Price Drop! Flat 40% Off\n\n\n\n\n\nOffer Exclusively For You\n\nSave up to Rs. 700/-\n\nON ET PRIME MEMBERSHIP\n\nOffer Exclusively For You\n\nGet 1 Year Free\n\nWith 1 and 2-Year ET prime membership\n\nOffer Exclusively For You\n\nGet 1 Year Free\n\nWith 1 and 2-Year ET prime membership\n\nOffer Exclusively For You\n\nGet Flat 40% Off\n\nThen  ₹ 1749 for 1 year\n\nOffer Exclusively For You\n\nET Prime at ₹ 49 for 1 month\n\nThen  ₹ 1749 for 1 year\n\nSpecial Offer\n\nGet flat 40% off on ETPrime\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat’s Included with\n\nETPrime Membership\n\nTrump temper on H-1B visas is forcing Indians to do these things to stay put in US\n\nWhat Adani’s US indictment means for India Inc’s overseas fundraising\n\nWhy veterans like Reliance, L&T are on acquisition spree? Aswath Damodaran has an answer.\n\nWill China’s dollar bond sale in Saudi Arabia trump the US in financial world?\n\nHuawei launches its own OS to compete with Google and Apple. But can it win beyond China?\n\nThe problem with lab grown diamonds\n\nWhy a falling rupee is a better option for the economy\n\nA list of top 20 momentum stocks that have delivered massive returns in one year\n\nInvestment Ideas\n\nGrow your wealth with stock ideas & sectoral trends.\n\nStock Reports Plus\n\nBuy low & sell high with access to Stock Score, Upside potential & more.\n\nBigBull Porfolio\n\nGet to know where the market bulls are investing to identify the right stocks.\n\nStock Analyzer\n\nCheck the score based on the company's fundamentals, solvency, growth, risk & ownership to decide the right stocks.\n\nMarket Mood\n\nAnalyze the market sentiments & identify the trend reversal for strategic decisions.\n\nStock Talk Live at 9 AM Daily\n\nAsk your stock queries & get assured replies by ET appointed, SEBI registered experts.\n\nePaper - Print View\n\nRead the PDF version of ET newspaper. Download & access it offline anytime.\n\nePaper - Digital View\n\nRead your daily newspaper in Digital View & get it delivered to your inbox everyday.\n\nWealth Edition\n\nManage your money efficiently with this weekly money management guide.\n\nTOI ePaper\n\nRead the PDF version of TOI newspaper. Download & access it offline anytime.\n\nDeep Explainers\n\nExplore the In-depth explanation of complex topics for everyday life decisions.\n\nHealth+ Stories\n\nGet fitter with daily health insights committed to your well-being.\n\nPersonal Finance+ Stories\n\nManage your wealth better with in-depth insights & updates on finance.\n\nNew York Times Exclusives\n\nStay globally informed  with exclusive story from New York Times.\n\nTimesPrime Subscription\n\nAccess 20+ premium subscriptions like Spotify, Amazon Prime & more.\n\nDocubay Subscription\n\nStream new documentaries from all across the world every day.\n\nLeadership | EntrepreneurshipPeople | Culture\n\nLeadership | EntrepreneurshipPeople | Culture\n\nLeadership | EntrepreneurshipPeople | Culture\n\nLeadership | EntrepreneurshipPeople | Culture\n\nLeadership | EntrepreneurshipPeople | Culture\n\nStories you might be interested in"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar(Bharatiya Janata Party(BJP)) - KARNAL",
    "link": "https://www.myneta.info/haryana2014/candidate.php?candidate_id=99",
    "source": "Google",
    "snippet": "Manohar Lal Khattar (Winner) KARNAL (KARNAL) Party:BJP S/o|D/o|W/o: Sh. Harbans Lal Age: 60 Name Enrolled as Voter in: 63 Kalanaul, Rohtak (Haryana) ...",
    "date": "N/A",
    "content": "Self Profession:Tution Work & AgriculturistSpouse Profession:\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election.\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election.\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election.\n\nDisclaimer: This information is an archive of the candidate's self-declared affidavit that was filed during the elections. The current status of this information may be different. For the latest available information, please refer to the affidavit filed by the candidate to the Election Commission in the most recent election.\n\n( यदि आप हलफनामों और इस पेज पर दी गयी जानकारी के बीच कोई विसंगति/भिन्नता पाते है तो आप नीचे के संदेश बॉक्स के उपयोग से हमें संदेश भेज सकते हैं)\n\n\n\nAbout MyNetaAbout ADRState CoordinatorsContactTerms of UseFAQs"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Shri Manohar Lal Khattar ji: Bring ISI helmet in the ...",
    "link": "https://www.amazon.com/Shri-Manohar-Lal-Khattar-mandatory/dp/1547158638",
    "source": "Google",
    "snippet": "Book overview. I am Ullhas PR. A social film maker trying to bring positive changes in the society through social films. This book is an appeal and is not for ...",
    "date": "N/A",
    "content": ""
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Shri Manohar Lal",
    "link": "https://sansad.in/ls/members/biography/5792?from=members",
    "source": "Google",
    "snippet": "Union Cabinet Minister of Housing and Urban Affairs; and Minister of Power. June 2024. Elected to 18th Lok Sabha.",
    "date": "Jun 9, 2024",
    "content": ""
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Latest News on manohar lal khattar",
    "link": "https://www.aninews.in/topic/manohar-lal-khattar/",
    "source": "Google",
    "snippet": "Union Minister Manohar Lal Khattar held meeting with Delhi Chief Minister Rekha Gupta at the Delhi Secretariat on Thursday to discuss key issues such as water ...",
    "date": "N/A",
    "content": "❌ Error extracting content"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Who is Manohar Lal Khattar? Why Did He Resign As CM of ...",
    "link": "https://www.jagranjosh.com/general-knowledge/why-did-manohar-lal-khattar-resign-1710256340-1",
    "source": "Google",
    "snippet": "Manohar Lal Khattar, a prominent political figure in Indian politics, served as the Chief Minister of Haryana from October 2014 to his recent ...",
    "date": "Mar 12, 2024",
    "content": "Manohar Lal Khattar, a prominent political figure in Indian politics, served as the Chief Minister of Haryana from October 2014 to his recent resignation on March 12, 2024. His tenure was marked by various reforms and challenges, making him a key player in the state's political landscape.\n\nBorn on May 5, 1954, in Nindana village of Rohtak district, Manohar Lal Khattar's early life was rooted in rural Haryana. Before entering politics, he had a successful career in the Rashtriya Swayamsevak Sangh (RSS), a Hindu nationalist, volunteer-based organisation. Khattar joined the Bharatiya Janata Party (BJP) in 1994 and gradually climbed the political ladder, becoming the party's national executive member.\n\nManohar Lal Khattar's ascent to the position of Chief Minister of Haryana in 2014 marked a significant moment in his political career. Under his leadership, the state witnessed several reforms and initiatives, including efforts to improve infrastructure, promote agricultural growth, and enhance law and order.\n\nOne of the notable initiatives during Khattar's tenure was the Beti Bachao, Beti Padhao campaign, aimed at addressing gender imbalance and promoting the education of girls. Additionally, the Swachh Bharat Abhiyan, a nationwide cleanliness drive, received attention in Haryana under his leadership.\n\nDespite his achievements, Manohar Lal Khattar's resignation in 2024 took many by surprise. The deterioration of the relationship between the Bharatiya Janata Party (BJP) and the Jannayak Janta Party (JJP), led by Deputy Chief Minister Dushyant Chautala, stemmed from their inability to reach a consensus on seat-sharing for the upcoming Lok Sabha polls in the state. Notably, the BJP had achieved success in all 10 Lok Sabha constituencies in Haryana during the 2019 elections.\n\nRecent reports indicate that the BJP is hesitant to allocate two seats to the Dushyant Chautala-led party for the upcoming polls, preferring to contest all 10 seats independently. Independent MLA Nayan Pal Rawat asserted earlier on Tuesday that the alliance was on the verge of collapse. Nevertheless, some independent MLAs supporting the Manohar Lal Khattar government are anticipated to play a pivotal role in ensuring its continuity, as per news agency ANI. Currently, the BJP holds 41 seats in the 90-member House, while the JJP has 10. The ruling coalition also enjoys the support of six out of seven independent legislators, potentially positioning the BJP to form a new government in Haryana with the backing of Independent MLAs.\n\nIn the aftermath of the chief minister's resignation, both the BJP and the JJP leadership have convened separate meetings with their respective MLAs. Preceding these gatherings, Manohar Lal Khattar is set to hold a meeting of all BJP ministers at his residence.\n\nContent Writer\n\nNikhil comes from a commerce background, but his love for writing led him on a different path. With more than two years of experience as a content writer, he aspires to breathe life into words. He completed his B.Com. from DU and finds joy in traveling and exploring new and hidden places. Do drop your feedback for him atnikhil.batra@jagrannewmedia.comand let him know if you love his work\n\nIf You Think You As Sharp As Sherlock Holmes, Spot Which Passport Is Fake In 5 Seconds!\n\nIQ Test: Only 140+ IQ Holders Can Find the Mistake in the Picture in 7 Seconds!\n\nImportant Days in July 2025: National and International Special Dates List\n\nGet herecurrent GKandGK quiz questionsin English andHindiforIndia, World,Sportsand Competitive exam preparation. Download the Jagran JoshCurrent Affairs App.\n\nkarresults.nic.in Result 2025 OUT: Download Karnataka 2nd PUC Exam 3 Marks Memo at kseab.karnataka.gov.in, Result Link Active\n\nMPSOS Result 2025 Out: रूक जाना नहीं एमपी बोर्ड रिजल्ट हुआ जारी, यहां डायरेक्ट लिंक से करें चेक\n\nCUET Result 2025 LIVE: NTA CUET Undergraduate Result Releasing Today at cuet.nta.nic.in, Download Final Answer Key and Scorecard PDF Link Here\n\nIs 6 or 7 July a Public Holiday - Will Schools Remain Closed due to Muharram 2025? Check Here\n\nKarnataka PUC 2 Exam 3 Results 2025: KSEAB Released Exam 3 Round Result at kseab.karnataka.gov.in, Link Active\n\nChartered Accountant Day 2025: Career Guide, Eligibility, Qualifications & B.Com College List\n\nRRB NTPC Answer Key 2025 LIVE: Railway RRB NTPC to Release Graduate Level CBT 1 Provisional Answer Key PDF at rrbcdg.gov.in - Direct Link Here\n\nIBPS PO Syllabus 2025: Prelims and Mains Syllabus PDF Download, New Exam Pattern\n\nAKTU Result 2025 OUT at aktu.ac.in; Direct Link to Download AKTU One View UG and PG Marksheet PDF\n\n50+ Self Introduction Sentences in Japanese for School Students with English Meaning\n\nभारत के सभी राज्यों और केंद्र शासित प्रदेशों के मुख्यमंत्रियों की पूरी लिस्ट, यहां देखें\n\nRajju Bhaiya University Result 2025 OUT at prsuniv.ac.in; Download UG and PG Even Semester Marksheet PDF\n\nMAHATRANSCO Admit Card 2025 Out for AE and LDC Posts,   Download Assistant Engineer Hall Ticket at mahatransco.in\n\nIf You Think You As Sharp As Sherlock Holmes, Spot Which Passport Is Fake In 5 Seconds!\n\nIQ Test: Only 140+ IQ Holders Can Find the Mistake in the Picture in 7 Seconds!\n\nImportant Days in July 2025: National and International Special Dates List\n\nList of Most Popular Sports in the US: Check theTotal Number of American Fans\n\nPunjab Board PSEB 12th Philosophy Syllabus 2025-26; Download FREE PDF\n\n1 जुलाई 2025 से आपके लिए बदल गए ये सभी सरकारी नियम?\n\nRajasthan Police Constable Exam Date 2025, Check Complete Schedule and Other Details Here"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar NEWS",
    "link": "https://www.cnbctv18.com/tags/manohar-lal-khattar.htm",
    "source": "Google",
    "snippet": "Haryana CM Manohar Lal Khattar rides a motorcycle to promote Car-free Day in Karnal. environment | Sept 26, 2023 1:47 PM IST",
    "date": "N/A",
    "content": "News\n\nLive TV\n\nMarket\n\nPopular Categories\n\nCalculators\n\nTrending Now\n\nLet's Connect with CNBCTV 18\n\nNetwork 18 Group :\n\n©TV18 Broadcast Limited. All rights reserved."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar Launches Three Online Platforms to ...",
    "link": "https://www.newsonair.gov.in/manohar-lal-khattar-launches-three-online-platforms-to-boost-power-sector-efficiency-transparency/",
    "source": "Google",
    "snippet": "Union Minister of Power Manohar Lal Khattar has launched three online platforms to enhance the efficiency, transparency, and effectiveness ...",
    "date": "Aug 20, 2024",
    "content": "DownloadMobile App\n\nSite Admin |August 20, 2024 10:14 PM\n\nUnion Minister of Power Manohar Lal Khattar has launched three online platforms to enhance the efficiency, transparency, and effectiveness of power sector in New Delhi today. The portals are named as Portal for Online Monitoring of Projects – Thermal (PROMPT), Disaster Resilient Infrastructure for Power Sector (DRIPS) and JAL VIDYUT DPR.\n\n\n\nSpeaking at the launch event, the Minister emphasised that the launch of these three online portals will enable transparent, coordinated, and effective working of the power sector in the country. He further highlighted the importance of power sector as the key element towards achieving the goal of Viksit Bharat by 2047.\n\n\n\nMr Khattar remarked that the electricity is the key driver for the ongoing economic activities in the country. He added that the demand for power is also increasing therefore completion of ongoing schemes and a thermal project in time bound manner is extremely critical.\n\n03/05/24 | 12:50 pm\n\n24/03/24 | 9:14 pm\n\n17/03/24 | 2:07 pm\n\n08/05/24 | 1:53 pm\n\n03/05/24 | 2:17 pm\n\nPrivacy Policy| Copyright © 2025 News On Air. All rights reserved\n\nLast Updated:1st Jul 2025|  Visitors:1480625"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Topic: Manohar Lal Khattar",
    "link": "https://theprint.in/tag/manohar-lal-khattar/",
    "source": "Google",
    "snippet": "Union Power Minister Khattar has announced new timeline for the 2,800-MW project, now delayed by a decade from its original target. Modi govt faces heat over ...",
    "date": "N/A",
    "content": "Required fields are marked*\n\n\n\nName*\n\nEmail*\n\n\n\nΔ\n\nCopyright © 2025 Printline Media Pvt. Ltd. All rights reserved."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "IANS - X",
    "link": "https://x.com/ians_india/status/1939700120075005984",
    "source": "Google",
    "snippet": "Delhi: Union Minister Manohar Lal Khattar says, \"...While we would eventually gain independence, there was no guarantee that we could sustain it ...",
    "date": "N/A",
    "content": "❌ Error extracting content"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar: Minister of Housing and Urban Affairs of ...",
    "link": "https://politicianinfo.in/manohar-lal-khattar/",
    "source": "Google",
    "snippet": "Shri Manohar Lal Khattar is a veteran Indian politician and a dedicated member of the Bharatiya Janata Party (BJP).",
    "date": "May 9, 2025",
    "content": "Shri Manohar Lal Khattar is a veteran Indian politician and a dedicated member of the Bharatiya Janata Party (BJP). He currently serves as theUnion Minister of PowerandMinister of Housing and Urban Affairsin the Modi 3.0 cabinet (as of 2024). Formerly the10th Chief Minister of Haryana, Manohar Lal Ji has made a significant impact in both state and central politics with his administrative acumen and grassroots connection.\n\n•Full Name: Manohar Lal Khattar•Date of Birth: May 5, 1954 (Age 70)•Birthplace: Nindana village, Rohtak district, Haryana•Current Positions: Union Minister of Power & Housing and Urban Affairs•Political Party: Bharatiya Janata Party (BJP)•Previous Role: 10th Chief Minister of Haryana (2014–2024)•Constituency: Karnal•Religion: Hindu•Marital Status: Unmarried\n\nShri Manohar Lal was born on May 5, 1954, in Nindana village, Rohtak district, then part of East Punjab. His father,Harbans Lal Khattar, experienced the hardships of the Partition of India in 1947 and later resettled inBanyani village, Haryana, where the family took up farming.\n\nManohar Lal completed his schooling atPandit Neki Ram Sharma Government Collegein Rohtak. To support his family, he moved toDelhi, where he opened a shop nearSadar Bazarand simultaneously completed hisbachelor’s degree from Delhi University.\n\nManohar Lal Ji began his political journey by joining theRashtriya Swayamsevak Sangh (RSS)as aPracharak. After dedicating over 40 years to organizational work, he joined the BJP and was appointedSangathan Mahamantri(Organization Secretary) in Haryana. His administrative skills and deep understanding of public service led him to connect withShri Narendra Modiduring this time.\n\nIn2014, he was unanimously elected theBJP Legislature Party leaderin Haryana and sworn in asChief MinisteronOctober 26, 2014, despite being a first-time MLA—a first in Haryana’s political history.\n\n•2014–2024: Chief Minister of Haryana•2024: Resigned as CM on March 12, after a decade in power•2024: Elected MP from Karnal and inducted asUnion Minister of Power and Housing & Urban Affairs\n\n• First BJP CM of Haryana• Promoted theBeti Bachao, Beti Padhaocampaign in Haryana• Contributed to theimprovement of the sex ratio and girl child educationin the state• Advocated for urban development, transparency in governance, and digitization\n\nName: Manohar Lal Khattar (Shri Manohar Lal)Current Position: Union Minister of Power & Housing and Urban AffairsMobile Numbers:• 090413-99899• (+91) 90560-02595Email IDs:•[email protected]•[email protected]Office Numbers: 0172-2749396 / 0172-2749409Permanent Address: H. No. 719, Prem Nagar, Karnal, Haryana – 132001Residential Address: House No. 1, Sector-3, Chandigarh – 160047Present Address: House No. 1, Sector-3, Chandigarh – 160047Website:https://manoharlalkhattar.in\n\nShri Manohar Lal is very active on social media, sharing regular updates about policies, governance, and public welfare initiatives.\n\n•X (Twitter):x.com/mlkhattar•Facebook:facebook.com/manoharlalkhattar•Instagram:instagram.com/mlkhattar•YouTube:youtube.com/@ManoharLal\n\nQ: What is Manohar Lal Khattar’s current role in 2024?He is the Union Minister of Power and Minister of Housing and Urban Affairs.\n\nQ: Which constituency does Manohar Lal represent?He represents theKarnal Assemblyand was elected as MP in the 2024 general elections.\n\nQ: Has Manohar Lal Khattar ever served as Chief Minister?Yes, he served as the10th Chief Minister of Haryanafrom 2014 to 2024.\n\nQ: Is Manohar Lal Khattar married?No, he is unmarried.\n\nQ: How can I contact Manohar Lal Khattar?You can contact him via email at[email protected]or call his official numbers listed above.\n\nShri Manohar Lal Khattar stands out as a leader known for integrity, discipline, and development-focused governance. His transition from grassroots RSS Pracharak to a central cabinet minister demonstrates his dedication to public service. With an impactful tenure as Haryana’s CM and now as a Union Minister, he continues to shape India’s political and developmental landscape.\n\nMamata Banerjee: Chief Minister of West Bengal\n\nBhagirath Choudhary – Member of Parliament (MP Lok Sabha)\n\nYour email address will not be published.Required fields are marked*\n\nName*\n\nEmail*\n\nWebsite\n\nSave my name, email, and website in this browser for the next time I comment.\n\n\n\nCopyright © 2025 Politician Information"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar",
    "link": "https://prsindia.org/mlatrack/manohar-lal-khattar",
    "source": "Google",
    "snippet": "This MLA was the Chief Minister from 27 Oct 2019 to 12 Mar 2024. Ministers represent the government in debates, so we do not report their participation ...",
    "date": "N/A",
    "content": "FIND YOUR MP\n\nFIND YOUR MP\n\nPRS Legislative Researchis licensed under aCreative Commons Attribution 4.0 International License\n\nDisclaimer: This data is being furnished to you for your information. PRS makes every effort to use reliable and comprehensive information, but PRS does not represent that this information is accurate or complete. PRS is an independent, not-for-profit group. This data has been collated without regard to the objectives or opinions of those who may receive it."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Latest News, Updates & Articles on MANOHAR-LAL-KHATTAR",
    "link": "https://www.outlookbusiness.com/topic/manohar-lal-khattar",
    "source": "Google",
    "snippet": "Haryana Chief Minister Manohar Lal Khattar. News · Manohar Lal Khattar, Dushyant Chautala Hail Central Government's Decision To Relax Wheat Procurement Norms.",
    "date": "N/A",
    "content": "Get magazine delivered to your doorstep\n\nGet latest issue delivered instantly\n\nOnly in Delhi-NCR, Mumbai, Bengaluru & Pune\n\nGet magazine delivered to your doorstep\n\nGet latest issue delivered instantly\n\nOnly in Delhi-NCR, Mumbai, Bengaluru & Pune\n\nBYPTI\n\nBYOutlook Planet Desk\n\nBYPTI\n\nBYAditi Ray Chowdhury\n\nBYAditi Ray Chowdhury\n\nBYPTI\n\nBYPTI\n\nBYPress Trust of India\n\nBYPress Trust of India\n\nBYPress Trust of India\n\nBYPress Trust of India\n\nCopyright © 2025 Outlook Publishing India Pvt Ltd.\n\nCopyright © 2025 Outlook Publishing India Pvt Ltd. All pages of the Website are subject to our terms and conditions and privacy policy. You must not reproduce, duplicate, copy, sell, resell or exploit any material on the Website for any commercial purposes."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Sh. Manohar Lal Khattar",
    "link": "https://www.ashoka.edu.in/new-young-professionals-vision-is-crucial-in-addressing-current-governance-challenges-union-minister-for-power-housing-urban-affairs-sh-manohar-lal-khattar/",
    "source": "Google",
    "snippet": "Union Minister for Power, Housing & Urban Affairs, Sh. Manohar Lal Khattar said that the vision of new young professionals is essential in addressing the ...",
    "date": "N/A",
    "content": "Other links:\n\nOther links:\n\nAshoka University is the strategic partner in the program and has engaged to identify passionate young professionals to work with the District Administrations in Haryana.\n\nUnion Minister for Power, Housing & Urban Affairs, Sh. Manohar Lal Khattar said that the vision of new young professionals is essential in addressing the present challenges faced by governance and administration. He mentioned that by 2035, the country’s current electricity demand will double and housing will need to be provided for 130 crore people of the country. Achieving these big goals will require special cooperation from new young professionals so that new dimensions can be achieved nationwide.\n\nThe Union Minister expressed these views while speaking as the chief guest at an event organised in honour of completion of eight years of the Chief Minister’s Good Governance Associates (CMGGA) programme in Haryana, held at Sushma Swaraj Bhavan in New Delhi last evening.\n\nThe event was attended by former CMGGA associates, senior officials of Haryana government, private sector partners of the programme and 22 graduating associates who have been working in the state for the past 15 months.\n\nDuring the programme, Sh. Manohar Lal Khattar shared his experiences, saying, “When I took over the responsibility of the state as Chief Minister in Haryana, I had no experience, and it was my first time as an MLA. When I discussed this with Prime Minister, Sh. Narendra Modi, he said that when he became Chief Minister, he was not even an MLA when appointed as CM of Gujarat. As you work, you learn, and the cycle of learning and teaching continues.” He also recounted his experience during the 1996 floods in Rohtak, where he worked with the administration despite not knowing any bureaucrats in Haryana, except the then Deputy Commissioner of Rohtak, Sh. TVSN Prasad, who is now the current Chief Secretary of Haryana. He emphasised that with the spirit of serving people during the floods, he learned by working with the administration.\n\nThe Union Minister said that when he took over as Chief Minister in Haryana, the state was termed as having a policy paralysis, and there were no rules and regulations followed in the government system. Therefore, he took up the task of establishing a system governed by rules in the interest of society and the state. Various new initiatives were started and yielded positive results, such as the Beti Bachao-Beti Padhao programme, the CM-Window programme and the formation of the Pond Authority for the renovation of ponds. Good governance associates played a significant role in the success of these programmes, he added. “We are Proud of the CMGGA Programme, which has become integrated with everyone today,” he further said.\n\nHe said, “We are proud of the CMGGA programme, which has become integrated with everyone today.” He mentioned that opposition members criticised the programme, but he stated that it was implemented for his assistance. He clarified that the CMGGA programme was not a job but a one-year programme based on merit for solving problems. The CMGGA programme provided social exposure for the youth, becoming a support for them as it provided a good platform for their future. He thanked everyone involved in the programme for successfully running it as a team.\n\n“The CMGGA Programme served as a bridge between people and the government,” said Dr. Amit Agrawal, Additional Principal Secretary to the Chief Minister and Project Director of CMGGA. Dr. Amit Agrawal, said that Sh. Manohar Lal was the chief architect of the CMGGA programme, which successfully made operational under his leadership. He said that 148 good governance associates have successfully collaborated on various governance initiatives. This programme served as a bridge between people and the government, promoting citizen-centric governance. Initiatives like the ‘Beti Bachao-Beti Padhao’ programme saw significant improvements in the sex ratio in Haryana. The state, previously known for female infanticide, is now recognised for promoting its daughters. “Over 10 crore Services Provided Through Saral Centres,” said Dr. Amit Agrawal.\n\nDr. Amit Agrawal apprised that in the past eight years, all good governance associates have closely collaborated with district administration and various state government departments, opening over 660 Antyodaya Saral centres and providing more than 10 crore services through these centres, earning the Platinum Award from the President under ‘Excellence in Digital Governance. Good governance associates have played a key role in implementing e-office, Mukhyamantri Antyodaya Parivar Utthan Yojana, Amrit Sarovar Yojana, The Haryana Pond and Waste Water Management Authority, Saksham Haryana Initiative and the Playway School Scheme for Anganwadi upliftment. These initiatives have benefited people and over 20 good governance associates are currently working as advisors in various departments.\n\n“The support provided by the Good Governance Associates helped in better implementation of various schemes,” said Dr. Rakesh Gupta, Additional Secretary President’s Secretariat, Government of India and former Project Director of CMGGA. Dr. Rakesh Gupta shared his experiences regarding the implementation of the Haryana Online Transfer Policy. He explained how the online transfer policy was implemented and received appreciation nationwide. He mentioned that Sh. Manohar Lal emphasised tech-governance and using IT in government system. Sh. Rakesh Gupta, while discussing the work done by the Good Governance Associates, said that their support helped in better implementation of various schemes. He expressed hope that similar programmes will continue in the future.\n\nDuring the programme, the Director of the Urban Local Bodies Department, Sh. Yashpal Yadav also shared his thoughts. In the programme, Chief Feedback Officer Mohit Soni, who was also a CMGGA, shared information about the work done with Sh. Manohar Lal during his tenure as CMGGA and expressed his views very eloquently. On this occasion, Ashoka University’s Vice Chancellor Somak Raychaudhuri, along with Gaurav Goel, Vineet Gupta, and Dr. Pramath Raj Sinha from the University, also addressed the gathering. The event was also addressed by senior bureaucrats, private sector partners of the programme and parents of graduating associates. The function was attended by 22 associates of the graduating cohort who have worked in the state for the last 15 months, their parents, past associates, senior bureaucrats of Haryana and private sector partners of the programme. It is significant to note that the Chief Minister’s Good Governance Associates Programme, started in 2016, is the longest running district fellowship programme across the country. It is a flagship initiative aimed at improving governance and public service delivery in Haryana. By engaging young professionals as associates, the programme seeks to bring fresh perspectives and innovative solutions to governance challenges, thereby fostering citizen-centric governance.\n\nOn this occasion, Sh. Manohar Lal also released a film and a coffee table book showcasing eight years of CMGGA’s work. The programme began with the lighting of the lamp by the Chief Guest, Sh. Manohar Lal and others. Sh. Manohar Lal was also honored with a plant. During the event, Sh. Manohar Lal presented appreciation certificates and mementos to CMGGA posted in various districts.\n\nOn this occasion, State Election Commissioner Dhanpat Singh, Director of Urban Local Bodies Department Yashpal Yadav, Director of Town and Country Planning Department Amit Khatri, Additional Deputy Commissioner of Jhajjar Saloni Sharma, Chief Feedback Officer Mohit Soni, Gaurav Goel, Vineet Gupta, Somak Raychaudhuri and Dr. Pramath Raj Sinha including various former and current CMGGAs family’s members and other dignitaries were present.\n\nAshoka University is the strategic partner in the programme and has engaged to identify, train and build capacity in socially minded young professionals to work with the District Administrations in Haryana.\n\n\n\n\n\n\n\n\n\n\n\n\n\nProgramme Interested InUndergraduate ProgrammeYoung India FellowshipYSPPhDMA - EconomicsMA EnglishMSC Biology\n\nYear of Admission2025-262026-272027-28Others\n\nSubscribe to our communications\n\n\n\nPlot No. 2, Rajiv Gandhi Education City, National Capital Region P.O. Rai, Sonepat\n                                Haryana-131029 (India)\n\nAshoka University Plot no.222, Second floor, Okhla Industrial Estate, Phase III, New Delhi-110020\n\nEmail Address*\n\nCopyright © Ashoka University"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar, Chief Minister of Haryana, India",
    "link": "https://srisathyasaisanjeevani.org/testimonial/manohar-lal-khattar-chief-minister-of-haryana-india/",
    "source": "Google",
    "snippet": "Manohar Lal Khattar, Chief Minister of Haryana, India. “What we believe is Man is the embodiment of God and the poor man is the true embodiment of God. While ...",
    "date": "N/A",
    "content": "“What we believe is Man is the embodiment of God and the poor man is the true embodiment of God. While a child of such poor man is being served here, it is truly serving God himself and this is truly a divine work which is done here. All those who are working here whether it is Doctors, support staff, Management, I congratulate all of you and thank you for the noble work you all are doing. Whatever support is needed from the Government, it shall be given.”\n\nPosted in\n\nComments are closed."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Haryana Cm Manohar Lal Khattar NEWS",
    "link": "https://www.cnbctv18.com/tags/haryana-cm-manohar-lal-khattar.htm",
    "source": "Google",
    "snippet": "Punjab's Amarinder Singh calls out Haryana CM's 'anti-farmer agenda' as blame game continues · Bypass to be constructed in Karnal at Rs 1,300 crore: Haryana CM.",
    "date": "N/A",
    "content": "News\n\nLive TV\n\nMarket\n\nPopular Categories\n\nCalculators\n\nTrending Now\n\nLet's Connect with CNBCTV 18\n\nNetwork 18 Group :\n\n©TV18 Broadcast Limited. All rights reserved."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Insider track | What ticks in Manohar Lal Khattar's favour as ...",
    "link": "https://www.newindianexpress.com/nation/2025/Jan/20/insider-track-what-ticks-in-manohar-lal-khattars-favour-as-next-bjp-president-face",
    "source": "Google",
    "snippet": "Manohar Lal Khattar could be the top contender for the next BJP president for several reasons. He kicked off his political career by joining the Rashtriya ...",
    "date": "Jan 20, 2025",
    "content": "Manohar Lal Khattar could be the top contender for the next BJP president for several reasons. He kicked off his political career by joining the Rashtriya Swayamsevak Sangh (RSS) as a permanent member in 1977, sticking with it for 17 years before joining the BJP in 1994. Fast forward to 2014, Khattar debuted as an MLA, and BJP chose him to be the Chief Minister of Haryana.\n\nAfter a solid decade of leading the state, in March 2024, he handed over the reins to his close ally Nayab Singh Saini, making way for himself to enter the Lok Sabha. His first attempt at the general elections was a resounding success he won the Karnal seat by a massive margin of over 2.35 lakh votes, leaving Congress’s Divyanshu Budhiraja in the dust.\n\nMany also say Khattar shares a strong bond with Prime Minister Narendra Modi, having worked together in the party’s organisational wing back in the 1990s.\n\nPT Usha, sports ministry locked in combat over ‘Kalaripayattu’\n\nThe ongoing clash between the legendary Indian athlete and president of the Indian Olympic Association, PT Usha, and the Union Sports Ministry has been either making headlines or part of the corridor talks recently. The latest issue revolves around including Kalaripayattu, a martial art from PT Usha’s home state of Kerala, in the upcoming National Games in Uttarakhand starting January 28.\n\nUsha, who remained firm on the matter, even told some delegates from Kerala that as the president of the Indian Olympic Association, she couldn’t think from a state-specific perspective. This came despite Kerala’s impressive performance at the last National Games in Goa, winning 19 golds, two silvers, and one bronze. Usha didn’t budge despite nudges from the Sports Ministry.\n\nThe situation escalated when Harshita Yadav, a Kalaripayattu practitioner from Haryana and a student of Delhi University, approached the Delhi High Court, which ruled in favour of reinstating Kalaripayattu as a competitive event. Harshita had trained under Dr PB Sumesh, a Malayali and Vice-President of the Indian Kalaripayattu Federation. The Indian Olympic Association is under pressure to either comply with the court’s order or challenge it in a higher court before the Prime Minister inaugurates the event on January 28.\n\nRare recognition for Jaishankar at ambassadors’ meet in Madrid\n\nThis moment stood out as quite unique in the realm of diplomacy, where optics matter a lot. External Affairs Minister Dr S Jaishankar received the rare honour of addressing the 9th Annual Conference of Ambassadors, organised by Spain’s Ministry of Foreign Affairs in Madrid.\n\nTypically, such meetings are reserved for internal discussions among heads of missions and with their ministers and leadership. Jaishankar’s official visit to Spain on January 13-14, 2025, marked his first trip to Madrid as Minister, and it was undoubtedly a befitting honour.\n\nFollow The New Indian Express channel on WhatsApp\n\nDownload the TNIE app to stay with us and follow the latest\n\n\n\nCopyright - newindianexpress.com 2024. All rights reserved.\n\n"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Union Minister Manohar Lal Khattar Chairs High-Level ...",
    "link": "https://www.newsonair.gov.in/union-minister-manohar-lal-khattar-chairs-high-level-meeting-at-dvc-headquarters-in-kolkata/",
    "source": "Google",
    "snippet": "Union Minister of Power Manohar Lal Khattar today chaired a high level meeting in Kolkata at Damodar Valley Corporation (DVC) headquarters.",
    "date": "Jul 17, 2024",
    "content": "DownloadMobile App\n\nSite Admin |July 17, 2024 5:55 PM\n\nUnion Minister of Power Manohar Lal Khattar today chaired a high level meeting in Kolkata at Damodar Valley Corporation (DVC) headquarters. Khattar has told that DVC is the first river multipurpose project in India and it is contributing to the development of the country. DVC chairman S. Suresh and other high level officials were present in the meeting. Minister stressed to increase the share of renewable energy in the power sector.\n\n\n\nThe Minister also joined a ‘BJP after-poll review meeting’ in the city. BJP state president and Union minister of state Education Dr. Sukanto Majumdar was also present in the review meeting.\n\n03/05/24 | 12:50 pm\n\n24/03/24 | 9:14 pm\n\n17/03/24 | 2:07 pm\n\n08/05/24 | 1:53 pm\n\n03/05/24 | 2:17 pm\n\nPrivacy Policy| Copyright © 2025 News On Air. All rights reserved\n\nLast Updated:1st Jul 2025|  Visitors:1480625"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Haryana Chief Minister Shri Manohar Lal Khattar visits and ...",
    "link": "https://www.pib.gov.in/PressReleseDetailm.aspx?PRID=1998086",
    "source": "Google",
    "snippet": "Haryana Chief Minister Shri Manohar Lal Khattar addressing the gathering at IISF, Faridabad. On day four the India International Science ...",
    "date": "Jan 20, 2024",
    "content": "JavaScript must be enabled in order for you to use the Site in standard view. However,\r\n                it seems JavaScript is either disabled or not supported by your browser. To use\r\n                standard view, enable JavaScript by changing your browser options.\n\n\n\nHaryana Chief Minister Shri Manohar Lal Khattar addressing the gathering at IISF, Faridabad\n\nOn day four the India International Science Festival (IISF) 2023 got the presence of Shri Manohar Lal Khattar, Chief Minister of Haryana, as the esteemed Chief Guest for the occasion. The mega science festival, organized from January 17 to 20, 2024, brought together the brightest minds in science and innovation, fostering a spirit of exploration and collaboration.\n\nIn his address, Shri Manohar Lal Khattar emphasized the boundless benefits that science offers to society without any discrimination. Recognizing the importance of science in shaping the future, he expressed his commitment to further integrate science with society through a significant announcement.\n\nShri Khattar announces the plans for the development of a state-of-the-art Science City in Faridabad (Haryana) spanning across 50 acres. This ambitious project aims to create a dedicated space for scientific exploration, learning, and engagement, fostering a culture of curiosity and discovery among the public, especially children.\n\nProf. Abhay Karandikar, Secretary DST felicitating Hon’ble Chief Minister Shri Manohar Lal Khattar\n\nThe proposed Science City in Faridabad is poised to become a hub for scientific innovation, education, and outreach. It will serve as a platform for researchers, educators, and students to come together, exchange ideas, and contribute to the advancement of scientific knowledge.\n\nIn his announcement, Shri Manohar Lal Khattar highlighted the importance of nurturing a scientific temperament among the youth and creating an ecosystem that encourages innovation and research. The Science City is envisioned as a dynamic center that will play a pivotal role in promoting scientific awareness, fostering a love for learning, and inspiring the next generation of scientists. He said that the country is marching ahead under the leadership of our Prime Minister Shri Narendra Modi in all walks of life including science and technology.\n\nShri Khattar highlighted the crucial role that the public engagement platforms like IISF play in fostering a scientific temperament among citizens. He emphasized that the festival serves as a bridge between the scientific community and the general public, demystifying complex concepts and showcasing the transformative power of science.\n\nProf. Abhay Karandikar (Secretary, DST), Dr. Shivkumar Sharma (National Organizing Secretary, Vijnana Bharati), Dr. Arvind C Ranade (Chief Coordinator, IISF 2023) & Dr. PS Goel (Chairman, National Innovation Foundation) were present on the occasion.\n\n********\n\nSNC/PK\n\n\n\nSite is hosted by National Informatics Centre (NIC). Information is provided and updated by Press Information Bureau “A” wing, Shastri Bhawan, Dr. Rajendra Prasad Road, New Delhi – 110001, Phone: 23389338."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar: Age, Biography, Education, Wife, ...",
    "link": "https://www.oneindia.com/politicians/manohar-lal-khattar-64155.html",
    "source": "Google",
    "snippet": "Manohar Lal Khattar is a prominent figure in Indian politics. He assumed the role of the 10th Chief Minister of Haryana, although his tenure was interrupted by ...",
    "date": "N/A",
    "content": "❌ Error extracting content"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Do you think Haryana CM Manohar Lal Khattar is a weak ...",
    "link": "https://www.quora.com/Do-you-think-Haryana-CM-Manohar-Lal-Khattar-is-a-weak-leader",
    "source": "Google",
    "snippet": "Yes, he can't take decisions on its own. He lacks both administrative and political skills. Power is centralized,only 4–5 people are running full government.",
    "date": "N/A",
    "content": "Something went wrong. Wait a moment and try again."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar-Lal-Khattar - TimesContent.com",
    "link": "https://timescontent.timesofindia.com/photo/news/Manohar-Lal-Khattar/468467",
    "source": "Google",
    "snippet": "Manohar Lal Khattar, Chief Minister of Haryana during his visit to Chennai, Tamil Nadu on February 10, 2016. Japanese auto major Suzuki is examining the ...",
    "date": "N/A",
    "content": "Manohar Lal Khattar, Chief Minister of Haryana during his visit to Chennai, Tamil Nadu on February 10, 2016. Japanese auto major Suzuki is examining the option of investing in Haryana, according to the State Chief Minister Manohar Lal Khattar, told at a press conference in Chennai."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "New AC Rules Soon: Centre to Standardise Temperature ...",
    "link": "https://www.timesnownews.com/india/new-ac-rules-soon-centre-to-standardise-temperature-between-20c28c-says-manohar-lal-khattar-article-151828200",
    "source": "Google",
    "snippet": "Union Minister of Housing and Urban Affairs, Manohar Lal Khattar on Tuesday said that India will be soon conducting an experiment regarding ...",
    "date": "Jun 11, 2025",
    "content": "Theme\n\nIndia\n\nCities\n\nMumbai\n\nDelhi\n\nKolkata\n\nBengaluru\n\nHyderabad\n\nChennai\n\nPune\n\nNoida\n\nUpdated Jun 11, 2025, 15:35 IST\n\nUnion Minister Manohar Lal Khattar (File Image)\n\nApoorva Shukla is a  journalist at Times Now, where she thrives on dissecting political developments both at home and abroad. A graduate of Delhi Univ...View More\n\nnews\n\nindia news\n\nFollow us :\n\n© 2025 Bennett, Coleman & Company Limited"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "MP Jangra's remark is personal, not party's stance",
    "link": "https://www.tribuneindia.com/news/haryana/mp-jangras-remark-is-personal-not-partys-stance-union-minister-manohar-lal-khattar/",
    "source": "Google",
    "snippet": "... Manohar Lal Khattar. MP Jangra's remark is personal, not party's stance: Union Minister Manohar Lal Khattar. Says, \"It was indeed a mistake ...",
    "date": "May 25, 2025",
    "content": "Amid controversy surrounding BJP Rajya Sabha MP Ram Chander Jangra’s recent remarks on women who lost their husband or family members in the Pahalgam terror attack, Union Power Minister Manohar Lal Khattar said that the comments reflected personal opinion and should not be interpreted as the party’s stance.\n\n\n\nUrging closure of the matter, the minister emphasised that Jangra has already issued a clarification and expressed regret for any hurt caused. In a day-long visit to his constituency, Khattar, while interacting with media persons, said, “Jangra expressed a sentiment, but it was presented in the wrong context. Making comments about women who have lost their husbands is not appropriate. It was indeed a mistake, and he has expressed regret. I, too, believe this issue should now be considered closed.”\n\nEarlier, Khattar tuned in to PM Narendra Modi’s ‘Mann Ki Baat’ programme with party leaders and workers at the party’s district office ‘Karna Kamal’.\n\n\n\nOn being asked about the surge in Covid cases in Haryana, Khattar assured that the state and Union governments are closely monitoring the situation. “Some cases have been reported. The health department is alert, and precautionary measures are already in place. This issue was also raised during the recent NITI Aayog meeting. We are determined to prevent the situation from escalating,” he said.\n\nTake your experience further with Premium access.Thought-provoking Opinions, Expert Analysis, In-depth Insights and other Member Only Benefits\n\nAlready a Member?Sign In Now\n\nThe Tribune, now published from Chandigarh, started publication on February 2, 1881, in Lahore (now in Pakistan). It was started by Sardar Dyal Singh Majithia, a public-spirited philanthropist, and is run by a trust comprising five eminent persons as trustees.The Tribune, the largest selling English daily in North India, publishes news and views without any bias or prejudice of any kind. Restraint and moderation, rather than agitational language and partisanship, are the hallmarks of the newspaper. It is an independent newspaper in the real sense of the term.The Tribune has two sister publications, Punjabi Tribune (in Punjabi) and Dainik Tribune (in Hindi).\n\nRemembering Sardar Dyal Singh Majithia"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Saurav Sharma | New Air conditioner rule in India. . . . . . [AC ...",
    "link": "https://www.instagram.com/reel/DKzWmVmzJA5/",
    "source": "Google",
    "snippet": "... Manohar Lal Khattar, electricity consumption, power saving, AC standardization, energy efficiency India, electricity peak demand, Japan AC rules, Italy AC ...",
    "date": "N/A",
    "content": ""
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Haryana CM Manohar Lal Khattar presents Rs 1, ...",
    "link": "https://www.chinimandi.com/haryana-cm-manohar-lal-khattar-presents-rs-189876-61-crore-budget-for-fy-2024-25/",
    "source": "Google",
    "snippet": "Haryana CM Manohar Lal Khattar presents Rs 1,89,876.61 crore Budget for FY 2024-25 ... Chandigarh (Haryana) [India], February 23 (ANI): Haryana ...",
    "date": "Feb 23, 2024",
    "content": "Chandigarh (Haryana) [India], February 23 (ANI): Haryana Chief Minister Manohar Lal Khattar on Friday presented the State Budget with a total outlay of Rs 1,89,876.61 for the year 2024-25 at the Assembly in Chandigarh.\n\nA budget of Rs 1,89,876.61 crore was proposed for the year 2024-25, which shows an increase of 11.37 percent over the revised estimates of Rs 1,70,490.84 crore for the year 2023-24. The budget includes Rs 1,34,456.36 crore as revenue outlay and Rs 55,420.25 crore as capital outlay which accounts for 70.81 per cent and 29.19 per cent of the total budget respectively.\n\n“India will be the fastest growing economy in the world with a growth rate of 6.7 per cent in the year 2023. In the Amrit Kaal period, India will be one of the leading developed countries of the world and will again become the world leader. In this journey of developed India, developed Haryana will play an important role,” Haryana Chief Minister Manohar Lal Khattar said.\n\n“Over the period 2014-15 to 2023-24, the annual compound growth rate of Gross State Domestic Product at constant prices stood at 6.1 per cent. It is estimated to increase from Rs 3,70,535 crore in the year 2014-15 to Rs 6,34,027 crore in the year 2023-24, read the budget document. During the same period, an annual compound growth rate of 5.6 per cent was recorded in GDP at constant prices at the national level,” the CM added.\n\nHaryana’s GSDP in All India Gross Domestic Product is estimated to increase from 3.5 per cent in 2014-15 to 3.7 per cent in 2023-24. Haryana’s gross state domestic product is estimated to increase by 8.0 per cent in the year 2023-24.\n\nThe national per capita income of Haryana at current prices is projected to increase from Rs 86,647 in 2014-15 to Rs 1,85,854 in 2023-24, an increase of 114 per cent.\n\nIn Haryana, it is estimated to increase from Rs 1,47,382 in the year 2014-15 to Rs 3,25,759 in the year 2023-24, which is an increase of 121 per cent.\n\nThe share of secondary sector in the total gross state value added at current prices in the year 2023-24 is estimated at 29.3 per cent.\n\nIn the year 2023-24, the share of the tertiary sector in gross state value added is estimated to increase to 52.6 per cent and the share of the primary sector to 18.1 per cent.\n\nPrimary, secondary and tertiary sectors are estimated to grow by 8.6 per cent, 6.3 per cent and 13.8 per cent respectively in the year 2023-24.\n\n“Public sector undertakings also plan to spend an amount of Rs 8,119.24 crore on creation of capital infrastructure in the year 2024-25. Overall, our outlay for this year is estimated to be Rs 63,539.49 crore,” Haryana CM Manohar Lal Khattar said.\n\nNo new tax proposed has been tabled in this year’s budget, added Harayana CM.\n\n“Estimated revenue receipts is at Rs 1,16,638.90 crore, which includes tax revenue of Rs 84,551.10 crore and non-tax revenue of Rs 9,243.46 crore. The share of central tax is Rs 13,332.23 crore and central grant-in-aid is Rs 9,512.11 crore. Apart from this, capital receipt is estimated at Rs 72,722.01 crore\n\nThe fiscal deficit in the revised estimate 2023-24 is estimated to be capped at 2.80 per cent which is under the permissible limit of 3.5 per cent.\n\nFor the year 2024-25, fiscal deficit is proposed to be 2.77 per cent of Gross State Domestic Product, which is within the permissible limit of 3.5 per cent.\n\nSpeaking about the debt status of the Haryana government, CM Manohar Lal Khattar said, “The ratio of debt to gross state domestic product in the revised estimate 2023-24 was 26 per cent, which is within the prescribed limit of the norm of 33.10 per cent. The debt stock for the year 2024-25 is estimated at 26.15 percent of Gross State Domestic Product, which is much lower than the prescribed norms of 32.80 percent.”\n\n“The turnover of state public sector undertakings is estimated to be Rs 79,907 crore in the year 2023-24, which is an increase of 11.94 percent from last year. During the year 2013-14, only 13 out of 43 public sector undertakings earned a profit of Rs 804 crore. The number of profit-making public sector undertakings increased to 20 during the year 2022-23, whose a total profit was Rs 1767 crore. The combined debt of all public sector undertakings declined by 27.4 per cent from Rs 60,576 crore in March 2014 to Rs 43,955 crore in March 2023,” said Haryana CM.(ANI)\n\n\n\n\n\nSave my name, email, and website in this browser for the next time I comment.\n\n\n\n"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "BJP's Manohar Lal Khattar says Jawahar Lal Nehru ...",
    "link": "https://www.moneycontrol.com/news/india/bjp-s-manohar-lal-khattar-says-jawahar-lal-nehru-became-pm-by-accident-congress-hits-back-12908474.html",
    "source": "Google",
    "snippet": "Union minister for power and Former Haryana Chief Minister Manohar Lal Khattar. Union minister for power and former Haryana Chief Minister ...",
    "date": "Jan 12, 2025",
    "content": "My Account\n\nFollow us on:\n\nPowered By\n\nSee the top gainers, losers, invest and get updated what's happening in the crypto market\n\nInvest Now\n\nPowered By\n\nThis functionality will provide users with ease of access navigation and enable create a new revenue line by generating leads of potential customers for brokers in a more integrated manner.\n\nInvest Now\n\nUnion minister for power and former Haryana Chief Minister Manohar Lal Khattar on Sunday at an event said that Pandit Jawahar Lal Nehru became India's first prime minister by accident. The senior BJP leader said, \"I want to say that Pandit JL Nehru became a prime minister by accident. In his place, someone who deserved it (to become India's first PM) was Sardar Vallabhbhai Patel and Dr BR Ambedkar,\"  while addressing a gathering at Maharshi Dayanand University in Rohtak, Haryana.\n\nVIDEO | \"I want to say that Pandit JL Nehru became a prime minister by accident. In his place, someone who deserved it (to become India's first PM) was Sardar Vallabhbhai Patel and Dr BR Ambedkar,\" says Union Minister Manohar Lal Khattar (@mlkhattar), while addressing a gatheringpic.twitter.com/vJwwlEyGhrPress Trust of India (@PTI_News)January 12, 2025\n\nManohar Lal Khattar further said, “I would like to say that the Constitution of this country is our holy book and we should always remember the contribution of Dr. BR Ambedkar in shaping it.\n\nVIDEO | \"He himself became an accidental chief minister and that's why he is talking like this,\" says Congress leader Bhupinder Singh Hooda (@BhupinderShooda) on Union Minister Manohar Lal Khattar's 'JL Nehru became PM by accident' remark.(Full video available on PTI Videos -pic.twitter.com/MrAZ9PBs7VPress Trust of India (@PTI_News)January 12, 2025\n\n\n\nMeanwhile, the Congress party reacted strongly to Manohar Lal Khattar's remark that Pandit Jawahar Lal Nehru became PM by accident' and senior Congress leader  Bhupinder Singh Hooda said,\"He himself became an accidental chief minister and that's why he is talking like this,\" says Congress leader Bhupinder Singh Hooda\n\n\n\nDiscover the latestBusiness News,Budget 2025 News,Sensex, andNiftyupdates. ObtainPersonal Financeinsights, tax queries, and expert opinions onMoneycontrolor download theMoneycontrol Appto stay updated!\n\nSensex LiveHDB Financial Services IPOKalpataru Projects Share PriceIndia News LiveTelangana Pharma Company BlastElon MuskGSTShefali Jariwala DeathApollo Hospitals share priceAir India Crash\n\nBusinessMarketsStocksIndia NewsCity NewsEconomyMutual FundsPersonal FinanceIPO NewsStartups\n\nHomeCurrenciesCommoditiesPre-MarketIPOGlobal MarketBonds\n\nHomeLoans up to 50 LakhsCredit Cards Lifetime FreeFinance TrackerNewFixed DepositsFixed Deposit ComparisonFixed Income\n\nHomeMC 30Top Ranked FundsETFsMutual Fund Screener\n\nIncome Tax CalculatorEMI CalculatorRetirement PlanningGratuity Calculator\n\nStock Markets\n\nNews18FirstpostCNBC TV18News18 HindiCricketnextOverdrive\n\nAbout UsContact UsAdvisory AlertAdvertise with UsSupportDisclaimerPrivacy PolicyCookie PolicyTerms & ConditionsFinancial Terms (Glossary)SitemapInvestors\n\nCopyright © Network18 Media & Investments Limited. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form or medium without express written permission of moneycontrol.com is prohibited.\n\nYou are already a Moneycontrol Pro user."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "\"Politically Insignificant Sentiment\": Manohar Lal Khattar ...",
    "link": "https://www.ndtv.com/india-news/politically-insignificant-sentiment-manohar-lal-khattar-on-tej-prataps-expulsion-8509159",
    "source": "Google",
    "snippet": "Union Minister Manohar Lal Khattar has alleged that the decision of Rashtriya Janata Dal (RJD) supremo Lalu Yadav to expel his son and party ...",
    "date": "May 26, 2025",
    "content": "❌ Error extracting content"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Ministry of Power conceives an 'India Energy Stack ...",
    "link": "https://www.pib.gov.in/PressReleseDetail.aspx?PRID=2140416",
    "source": "Google",
    "snippet": "Tools for consumer empowerment, market access, and innovation. Speaking on this development, Shri Manohar Lal Khattar, Hon'ble Minister for ...",
    "date": "3 days ago",
    "content": "JavaScript must be enabled in order for you to use the Site in standard view. However,\r\n                it seems JavaScript is either disabled or not supported by your browser. To use\r\n                standard view, enable JavaScript by changing your browser options.\n\nSite is hosted by National Informatics Centre (NIC). Information is provided and updated by Press Information Bureau “A” wing, Shastri Bhawan, Dr. Rajendra Prasad Road, New Delhi – 110001, Phone: 23389338."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Good And Bad Of Khattar's Legacy And The BJP-JJP Split",
    "link": "https://swarajyamag.com/politics/good-and-bad-of-khattars-legacy-and-the-bjp-jjp-split",
    "source": "Google",
    "snippet": "The biggest failure for the Khattar government would definitely be infrastructure development. Haryana's roadways have been generating a lot of ...",
    "date": "Mar 15, 2024",
    "content": "Politics\n\nDiksha Yadav\n\nMar 15, 2024, 03:35 PM | Updated  03:47 PM IST\n\nSave & read from anywhere!\n\nBookmark stories for easy access on any device or theSwarajya app.\n\nHere are the four key highlights from Diksha Yadav's podcastWhat This Meanswith Rohit Pathania, focusing on the latest political developments in Haryana. (To listen,click here for Spotify, andhere Swarajya App).\n\n1. Why was CM Manohar Lal Khattar asked to resign?\n\nManohan Lal Khattar was certainly not winning any popularity contests, despite his efforts to the maximum in the last year. One of the things that was going against him definitely was the sort of allegation of policy paralysis within the government.\n\nEven basic tasks such as conducting tender processes for panchayats turned into a nightmare due to the various panchayat heads being at loggerheads with their respective political parties and the central government. This led to an increase in the minimum amount for tendering. Although this initiative aimed to eradicate corruption at the grassroots level, it ultimately backfired.\n\nFurthermore, this whole idea that the government was probably working at the behest ofsahukars, seths, etc., — the popular narrative that comes with a lot of leftist ideology or even socialist belief within Haryana — it still carries some traction, especially within the agricultural communities. There is this effort by the government to seem as if it has nothing to do with any of them.\n\nThe fact remains that the government has not necessarily attracted a lot of large-scale investments in recent years, or created more jobs than what was being necessarily done within government circles.\n\n2. BJP-JJP Alliance split was anticipated\n\nThe fact that the BJP-JJP Alliance was on tenterhooks for a while was more than evident.\n\nIf you remember, we had filed a story more than a year ago in which it was highlighted how the BJP was scouting for faces from within the Jat community, particularly. At that time, there was a lot of rumour of Kiran Chaudhary, the daughter-in-law of Bansi Lal, joining in, but eventually that move didn't materialise.\n\nShe was coming in from the Congress because her own base had probably diminished quite a bit, but it was becoming increasingly evident that there was a lack of confidence within the alliance between BJP and JJP.\n\nMoreover, Dushyant Chautala was also probably not happy with the fact that the BJP was not willing to concede more than one seat in the upcoming Lok Sabha elections.\n\nIn fact, all leaders of the BJP had been continuously hoping on contesting all 10 seats of Haryana at the Lok Sabha level. And it is actually Dushyant who probably lost the most in the alliance. He fought the 2019 assembly election on anti-BJP plank and the BJP itself was seen by the larger Jat vote base at that time as being an anti-Jat party. In fact, that was the key calling card for Dushyant's Jannayak Janata Party, but an alliance with the BJP certainly did not win the JJP any talking points.\n\nSo a lot has been going on, but generally there has been a sense of unpopularity that has been developing around the BJP-JJP combined government, and the alliance probably was not achieving any meaningful results.\n\nTo add to that, there is Bhupinder Singh Hooda who is making all efforts to ensure that Congress is in a very strong position when it contests the Lok Sabha and the Vidhan Sabha that are due subsequently this year.\n\nWe see that the Congress has been on a kind of resurgence despite there being dissatisfaction among many senior leaders because it has really managed to come under one umbrella in a way, and that has brought in a sense of confidence within the party that it can actually fare much better than anticipated in Haryana's assembly elections.\n\nThough of course, Lok Sabha might certainly vote a certain way that everybody is anticipating already, Vidhan Sabha would definitely be game on from the Congress perspective.\n\n3. Khattar's Legacy: Achievements and Failures\n\nThe biggest failure for the Khattar government would definitely be infrastructure development. Haryana's roadways have been generating a lot of complaints in recent years, and nothing much concrete has happened on it despite a lot of assurances.\n\nAlso, the inability to bring in big ticket investments is something that a lot of people have been criticising this government for. The alliance, too, was not very helpful.\n\nIn terms of positives, I would say that one of the biggest achievements of Manohar Lal Khattar as Chief Minister was the fact that the Beti Bachao, Beti Padhao initiative was successful in Haryana. And the fact that the sex ratio in the state improved massively under his leadership with constant effort on implementing the central government scheme.\n\nEven from the perspective of other central government schemes, coverage levels have been very high thanks to the dedicated efforts of his government.\n\nI think one of the other big achievements of Mr Khattar is that he has been able to run a clean government. There have been no major scams that are associated with his government, even though one could say that no action means no corruption.\n\nBut, given the kind of allegations and back and forth that used to happen with Hooda government during his 10 year tenure, it was a big achievement in a way that there was, for a change, a government that at least did not face any allegations of corruption or there was never a perception about it.\n\nA third thing would be the fact that despite what happened in 2016–17, especially with the Jat reservation agitations, generally, the state has not seen major flare-ups amongst communities, which used to be very common prior to Khattar's tenure.\n\nAlso, the kind of social stability that has come in Haryana under his government. I think kudos to Mr Khattar and his government for ensuring that there was no reason to complain at least, apart from probably political representation.\n\n4. JJP, the biggest loser?\n\nFrankly, the biggest loser of all that's been going on in the last two or three days is the JJP. It is more than evident that there will be quite a bit of vote splitting that will happen. There would be more than one party vying for the precious Jat vote of Haryana, which is the single largest community in the state. One thing, of course, is that Dushyant Chautala has not been very popular despite being the deputy chief minister in the state.\n\nEven with the 10 seats that he (Dushyant and his party JJP) has this time, I would be surprised if he manages to hold on to 50 per cent of them, should the next election come.\n\nAnd since the BJP and the Congress will also contest on all 10 Lok Sabha seats, neither party is willing to accommodate them or even INLD, the parent party of Om Prakash Chautala, from which the JJP broke away. So let's see how it works out. I don't see either INLD or JJP making any gains anytime soon.\n\nThe state has become fairly bipolar now. And except for a few independents, I don't see any scope for third parties.\n\nP.S. Rohit Pathania also talks about the two-three seats of the 10 seats in Haryana that can be challenging for the BJP in the upcoming 2024 Lok Sabha elections. Listen to the full episode here:🎙️𝗛𝗮𝗿𝘆𝗮𝗻𝗮—𝗧𝗵𝗲 𝗕𝗝𝗣-𝗝𝗝𝗣 𝗦𝗽𝗹𝗶𝘁, 𝗖𝗮𝗯𝗶𝗻𝗲𝘁 𝗥𝗲𝘀𝗵𝘂𝗳𝗳𝗹𝗲, 𝗞𝗵𝗮𝘁𝘁𝗮𝗿'𝘀 𝗟𝗲𝗴𝗮𝗰𝘆.\n\nDiksha Yadav is a senior sub editor at Swarajya.\n\nJoin ourWhatsApp channel- no spam, only sharp analysis\n\nComments↓\n\nAbout Swarajya\n\nShaping the modern Indian's worldview, speaking on behalf of those invested in the cultural and economic prosperity of India. Published since 1956.\n\nSwarajya is a publication by Kovai Media Private Limited.\n\nUseful Links\n\nUseful Links\n\nParticipate\n\nStay Connected"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar says sixteen-fold rise in urban sector ...",
    "link": "https://www.thehindu.com/news/national/sixteen-fold-rise-in-urban-sector-investments-since-2014-says-manohar-lal-khattar/article68968899.ece",
    "source": "Google",
    "snippet": "Addressing a press conference on achievements of his Ministry, the Union Housing and Urban Affairs Minister said investments have increased 16- ...",
    "date": "Dec 10, 2024",
    "content": "June 6, 2025e-Paper\n\nThe View From IndiaLooking at World Affairs from the Indian perspective.\n\nKarnataka TodayYour daily dose of news highlights from Karnataka\n\nFirst Day First ShowNews and reviews from the world of cinema and streaming.\n\nToday's CacheYour download of the top 5 technology stories of the day.\n\nScience For AllThe weekly newsletter from science writers takes the jargon out of science and puts the fun in!\n\nData PointDecoding the headlines with facts, figures, and numbers\n\nHealth MattersRamya Kannan writes to you on getting to good health, and staying there\n\nThe Hindu On BooksBooks of the week, reviews, excerpts, new titles and features.\n\nJune 6, 2025e-Paper\n\nUpdated- December 10, 2024 05:33 pm IST - New Delhi\n\nManohar Lal Khattar. File\n                                          | Photo Credit: PTI\n\nUnion Minister Manohar Lal Khattar on Tuesday (December 10, 2024) said there has been a substantial increase in investments in the urban sector since 2014 and emphasised the Centre’s dedication to realising the vision of‘Viksit Bharat’ by 2047.\n\nAddressing a press conference on achievements of his Ministry, the Union Housing and Urban Affairs Minister said investments have increased 16-fold, rising from approximately ₹1,78,053 crore between 2004 and 2014 to ₹28,52,527 crore since 2014.\n\n“Urban development schemes have been expanded and implemented with greater speed and efficiency in the past six months, asserting that the rapid pace of urbanisation has made urban development a key pillar of India’s growth strategy,” he said.\n\nThe Minister said that under the Jawaharlal Nehru National Urban Renewal Mission (JNNURM) between 2004 and 2014, projects worth ₹66,837 crore were sanctioned, but the Modi government has sanctioned projects worth ₹2.73 lakh crore under the Atal Mission for Rejuvenation and Urban Transformation (AMRUT) since 2014.\n\nTalking about urban housing and PMAY 2.0, Mr. Khattar said a new rental housing vertical has been introduced under the second phase of the Pradhan Mantri Awas Yojana (Urban), benefiting the migrant population.\n\nUnder this scheme, new initiatives such as provisional sanctions for around 7% of the planned one crore urban houses based on the population of States signing MoUs, have been made and it will ensure timely allocation and expediting the process.\n\n“To streamline operations, sanctions to States will be finalised based on the demand received by March 31, 2025, providing clarity on yearly house allocations,” he said, adding that 88.32 lakh houses have competed under the PMAY 2.0.\n\nMr. Khattar said a revamped National Urban Livelihoods Mission (NULM) will soon be launched, informed by the results of a pilot project currently under way in 25 cities.\n\nGiving details about the PM Street Vendor's AtmaNirbhar Nidhi (PM SVANidhi), the Union Minister said loan amounts of 13,422 crore have been disbursed under the scheme so far. Under the Swachh Bharat Mission, since June 9, 2024, the government has released more than ₹1,123 crore.\n\nOver the past six months since June 9, two major dumpsites in Ahmedabad and Hyderabad have been completely remediated, successfully addressing approximately 2.5 lakh metric tonnes of legacy waste, Mr. Khattar added.\n\nPublished- December 10, 2024 05:07 pm IST\n\ninvestments\n\nCopyright© 2025, THG PUBLISHING PVT LTD. or its affiliated companies. All rights reserved.\n\nBACK TO TOP\n\nTerms & conditions|Institutional Subscriber\n\nComments have to be in English, and in full sentences. They cannot be abusive or personal. Please abide by ourcommunity guidelinesfor posting your comments.\n\nWe have migrated to a new commenting platform. If you are already a registered user of The Hindu and logged in, you may continue to engage with our articles. If you do not have an account please register and login to post comments. Users can access their older comments by logging into their accounts on Vuukle."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Old Photo Shared as Manohar Lal Khattar Vacating House ...",
    "link": "https://www.thequint.com/news/webqoof/manohar-lal-khattar-vacating-residence-after-resignation-viral-image-fact-check",
    "source": "Google",
    "snippet": "An image which shows an elderly man carrying bags in his hands is going viral with users identifying him as former Haryana Chief Minister ...",
    "date": "Mar 22, 2024",
    "content": "An image which shows an elderly man carrying bags in his hands is going viral with users identifying him as formerHaryanaChief MinisterManohar Lal Khattar.\n\nWhat have users said?:Those sharing the image have uploaded with a caption mentioning that it shows Khattar vacating his official residence with his bags after resigning as the CM. It added that the image shows Khattar's possessions.\n\nThe post had recorded over 1.7 lakhs on the platform. We received a query about the viral image on our WhatsApp tipline as well.\n\n(More archives of similar claims can be foundhere,here, andhere.)\n\nIs the claim true?:The image has been available online since at least October 2019 and predates Khattar's resignation as the Haryana CM.\n\nThe man in the viral image does not match facial and physical specifications of Khattar.\n\nHow did we find that out?:On performing a Google Lens search, we found the sameimage uploadedon an unverified Facebook handle.\n\nThe image was uploaded on 24 October 2019 with a caption that said, \"We arefaqir(needy men), we will carry our bag and leave.\"\n\nThe caption also carried a hashtag '#HaryanaAssemblyPolls', which insinuated a dig at Khattar.\n\nWe found another older version of the sameimage sharedon X in September 2020. This, too, was uploaded to take a dig at Khattar.\n\nComparing Khattar's image with the viral one: Team WebQoofcompared the viral image with Khattar's photograph and found that there are several notable physical differences.\n\nKhattar's resignation:Ahead of the upcoming Haryana Assembly elections, Khattar along with his entire cabinetresignedon 12 March.\n\nThe resignation came after the Jannayak Janata Party (JJP) withdrew its support to the BJP-led government in the state.\n\nNayab Singh Saini was chosen as the new chief minister.\n\nWe have reached out to Haryana's CMO and Khattar to seek clarifications on the viral image. This report will be updated as and when a response is received.\n\nConclusion:While we could not independently identify the person seen in the viral image, it is clear that it is not recent.\n\n(Not convinced of a post or information you came across online and want it verified? Send us the details onWhatsApp at 9540511818, or e-mail it to us atwebqoof@thequint.comand we'll fact-check it for you. You can also read all our fact-checked storieshere.)\n\n(At The Quint, we question everything. Play an active role in shaping our journalism bybecoming a membertoday.)\n\nLoading Comments..."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Results For \"Haryana Chief Minister Manohar Lal Khattar \"",
    "link": "https://www.nationalheraldindia.com/topic/haryana-chief-minister-manohar-lal-khattar",
    "source": "Google",
    "snippet": "Read Haryana Chief Minister Manohar Lal Khattar Latest News Stories on National Herald, Haryana Chief Minister Manohar Lal Khattar Photo gallery, ...",
    "date": "N/A",
    "content": "Follow Us\n\nNation\n\nNation\n\nIndia\n\nNation\n\nNation\n\nNation\n\nNation\n\nIndia\n\nOpinion\n\nNation"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Why Manohar Lal Khattar was not at PM Modi's Haryana ...",
    "link": "https://indianexpress.com/article/political-pulse/bjps-haryana-poll-pitch-dalits-obcs-9589427/",
    "source": "Google",
    "snippet": "The BJP has decided to selectively deploy Khattar, a former CM and current Union Cabinet Minister, who was not present at the PM's Gohana rally.",
    "date": "Sep 27, 2024",
    "content": "BJP leaders on the Haryana poll campaign trail are increasingly focusing on issues of Dalits, Other Backward Classes (OBCs), and reservation, while trying to play on the tension between senior Congress leaders Bhupinder Singh Hooda (a Jat) and Kumari Selja (a Dalit).\n\nIn his last two public rallies in Haryana, Prime MinisterNarendra Modiaccused the Congress of being “anti-Dalit”. “The Congress has cheated the people who belong to backward castes or are Dalits,” the PM said in Gohana, Sonipat, on Wednesday. “Before 2014, when the Congress was in power and Hooda ji was the CM, there was not a single year when incidents of atrocities on Dalits or backward castes did not come to light… The Dalits in Haryana are watching the drama that is going on in the Haryana Congress these days. It is the DNA of the Congress to oppose reservation.”\n\nNot just the PM, other seniorBJPleaders such asAmit ShahandManohar Lal Khattartoo have been targeting the Congress on Dalit and OBC issues. To ensure that its OBC and Dalit pitch does not lose focus, the BJP has decided to selectively deploy Khattar, a former CM and current Union Cabinet Minister, who was not present at the PM’s Gohana rally.\n\nBJP sources said it was because “he (Khattar) is deputed by the party for campaigning in other areas and also the party wants to send a message that CM Nayab Singh Saini who comes from an OBC community is the party’s only chief ministerial candidate”.\n\nSeveral BJP leaders in core Jat areas such as Sonipat, Jhajjhar, and Charkhi Dadri toldThe Indian Expresswhy there was a degree of anger against Khattar.\n\n“We have got a new face to present before the voters and party workers … Party workers were upset with Khattar because of his reluctance to meet them. After assuming charge, Saini started meeting the workers and assured everyone their grievance would be addressed. This encouraged the workers to participate in the election process with tan, mann, dhan (physically, with focus, and financially),” said a BJP leader in Charkhi Dadri.\n\nKhattar, a Punjabi Khatri, is also missing from the BJP’s hoardings and publicity materials in some parts of the state. He did not also find a mention in a four-page pamphlet that the party distributed in all 90 constituencies describing the differences between the Congress government and the two BJP tenures.\n\nIn the constituency of Rai in Sonipat, local BJP leaders said they did not want Khattar to campaign. “It will be better if he (Khattar) does not come here,” said one. “There was strong resentment against the government when he was the CM. He lacked connection with public and party workers and the same was the attitude of MLAs and ministers who were close to him.”\n\nAt the BJP office in Jhajjar, an SC-reserved seat, a leader said, “Khattar nahi chahiye (We don’t want Khattar). He brought the party to this position. If Saini had got an opportunity two years ago, BJP would have been in a better situation. Saini did not get enough time, so we are appealing to voters to give him a full term.”\n\nComprising 33% of the state’s population, OBCs form the majority of voters in Haryana. They are followed by Jats at 26-27% and Dalits at 21%. The majority of the OBCs and Dalits are found in 35 Assembly constituencies, including the 17 reserved for Scheduled Caste (SC) candidates. In 2019, the BJP won 21 of these seats while the Congress won 15, and the Jannayak Janta Party (JJP) eight. Jats, on the other hand, are the dominant group in 25-30 seats.\n\nIn the Lok Sabha polls, the Congress-Aam Aadmi Party(AAP) coalition is believed to have got more than half of the Dalit votes, with the BJP losing both the SC-reserved parliamentary constituencies to the Congress. An analysis of the results shows that across the 47 Assembly segments with an SC population of more than 20%, the BJP led in 18, the Congress in 25, and the AAP in four segments.\n\nThe Assembly polls, however, may prove to be a different ball game since the Congress and the AAP are not contesting together and there are other players in the fray with the potential of cutting into the Congress’s votes. While the Abhay Chautala-led Indian National Lok Dal (INLD) and theBahujan Samaj Party(BSP) have tied up, the JJP and the Chandrashekhar Aazad-led Azad Samaj Party (Kanshi Ram) are in the fray together.\n\nThe Congress is concentrating on consolidating Jat votes but here too the INLD and the JJP, both Jat-dominated parties, may cut into its votes. The BJP, on the other hand, is attempting to consolidate non-Jat votes and win back the SC and OBC votes that it lost to the Congress in the parliamentary polls. For the party, a major hurdle has been the ongoing farmers’ protests, with several of its candidates, including MLAs and Cabinet Ministers, facing protests while campaigning in rural Haryana.\n\nLalmani is an Assistant Editor with The Indian Express, and is based in New Delhi. He covers politics of the Hindi Heartland, tracking BJP, Samajwadi Party, BSP, RLD and other parties based in UP, Bihar and Uttarakhand. Covered the Lok Sabha elections of 2014, 2019 and 2024; Assembly polls of 2012, 2017 and 2022 in UP along with government affairs in UP and Uttarakhand.... Read More\n\nA faceless outfit with East Delhi address is at heart of probes in 6 states; banks claim they follow process, KYC norms, but how red flags are ignored even as cyber scamsters passed crores of stolen money right under their noses through ghost accounts opened by fictitious outfits"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Page 2 - Latest Updates on Manohar Lal Khattar",
    "link": "https://www.business-standard.com/about/who-is-manohar-lal-khattar/page-2",
    "source": "Google",
    "snippet": "Page 2 - Manohar Lal Khattar: Manohar Lal Khattar is an Indian politician who is the Union Minister of Power and also holds the Housing and Urban Affairs ...",
    "date": "N/A",
    "content": "❌ Error extracting content"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Lok Sabha Elections 2024 | Manohar Lal Khattar takes ...",
    "link": "https://www.deccanherald.com/elections/india/lok-sabha-elections-2024-manohar-lal-khattar-takes-charge-as-power-minister-3061663",
    "source": "Google",
    "snippet": "RSS pracharak and Haryana's former chief minister Manohar Lal Khattar on Tuesday took charge as union power minister in the Modi 3.0 government.",
    "date": "Jun 11, 2024",
    "content": "Follow Us :"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Khattar Angry Over Selfie Bid | Chandigarh News",
    "link": "https://timesofindia.indiatimes.com/city/chandigarh/khattar-angry-over-selfie-bid/articleshow/113752344.cms",
    "source": "Google",
    "snippet": "Jind: Former Haryana chief minister and current Union Minister Manohar Lal Khattar reprimanded a BJP worker for attempting to take a selfie ...",
    "date": "Sep 28, 2024",
    "content": "â10 spotted animals and their distinct markingsâ\n\n8 habits to train your brain for peace and happiness\n\n10 brain-boosting activities based on ancient Indian traditions\n\n8 Healthy South Indian dinner ideas\n\nâ10 animals that use tools to get work done like humansâ\n\nHow to make perfect Lentil soup (Dal soup) for fever\n\nâ10 behavior kids copy directly from their momâ\n\nâ10 birds with names starting with the letter M\n\n10 health benefits of doing pranayam\n\n10 healthy breakfasts from different parts of the world"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "BJP And Khattar's Rise From 'Outsider' To The 'Fourth Lal'",
    "link": "https://www.ndtvprofit.com/elections/haryana-elections-bjp-and-manohar-lal-khattars-rise-from-outsider-to-the-fourth-lal",
    "source": "Google",
    "snippet": "Haryana votes on Oct. 21, along with Maharashtra. The state is poised for a multi-cornered contest mainly between the Bharatiya Janata Party, ...",
    "date": "N/A",
    "content": ""
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Government Plans India Energy Stack to Digitalize Power ...",
    "link": "https://www.mercomindia.com/government-conceives-india-energy-stack-to-digitalize-power-sector",
    "source": "Google",
    "snippet": "Manohar Lal Khattar, Minister for Power, said, “DPIs, such as IES, will play a vital role in integrating renewable energy, enhancing ...",
    "date": "1 day ago",
    "content": "Markets & Policy\n\nTenders & Auctions\n\nSolar Projects\n\nLarge-Scale Projects\n\nRooftop\n\nC&I\n\nManufacturing\n\nModules\n\nInverters & BOS\n\nTechnology\n\nFinance and M&A\n\nMarkets & Policy\n\nT&D\n\nUtilities\n\nSmart Grid\n\nMicrogrid\n\nEvents\n\nWebinars\n\nInterviews\n\nNandan Nilekani will head the task force on creating the DPI\n\nJune 30, 2025\n\nFollowMercom India on WhatsApp for exclusive updates on clean energy news and insights\n\nTheMinistry of Powerhas announced the launch of a task force to establish the India Energy Stack (IES), an initiative aimed at creating a unified, secure, and interoperable digital infrastructure for the country’s energy sector.\n\nThe task force, comprising experts from the technology, power, and regulatory segments, will be headed by Nandan Nilekani, Co-founder and Non-Executive Chairman, Infosys. It will steer IES’ development, pilot implementation, and nationwide scale-up.\n\nThe Ministry stated that IES aims to address India’s fragmented energy systems and a lack of seamless digital integration. These issues remain key hurdles to energy transformation, despite the accelerated growth in the country’s renewable energy and electric vehicle sectors, as well as an increase in consumer participation in the energy market.\n\nIES will be a digital public infrastructure (DPI) that ensures a standardized, secure, and open platform to manage, monitor, and support innovation across the electricity value chain.\n\nThe Ministry’s initiative has been approved under the Revamped Distribution Sector Scheme (RDSS) with REC as the program nodal agency. The RDSS wasdevisedto improve the quality and reliability of power supply to consumers through a financially sustainable and operationally efficient distribution sector.\n\nManohar Lal Khattar, Minister for Power, said, “DPIs, such as IES, will play a vital role in integrating renewable energy, enhancing distribution company (DISCOM) efficiency, and delivering transparent, reliable, and future-ready power services.”\n\nThe energy stack will offer the following features:\n\nThe Ministry stated that it will partner with select utilities to undertake a 12-month proof-of-concept study, demonstrating the IES under real-world use cases. These demonstrations will include piloting the energy stack’s utility intelligence platform. This platform will be a modular and analytics-driven application. It will be built on the IES to support utilities, policymakers, and consumers with real-time insights and smarter energy management.\n\nThe Ministry expects the following outcomes from the task force:\n\nIn 2021, the Department of Science and Technologyissueda call for research, development, and demonstration projects aimed at identifying and resolving significant challenges in digital transformation for the green energy transition.\n\nStaff\n\nRELATED POSTS\n\n© 2025 by Mercom Capital Group, LLC. All Rights Reserved."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar Appointed Union Power Minister in ...",
    "link": "https://www.etvbharat.com/en/!bharat/manohar-lal-khattar-appointed-union-power-minister-in-the-new-government-enn24061006453",
    "source": "Google",
    "snippet": "In 2014, Khattar became the MLA for the first time and took over as Chief Minister of Haryana. In March 2024, he was replaced by his confidante ...",
    "date": "Jun 10, 2024",
    "content": "National\n\nETV Bharat/bharat\n\nByPTI\n\nPublished :June 10, 2024 at 8:33 PM IST\n\nNew Delhi:RSS pracharak and Haryana's former chief minister Manohar Lal Khattar has been appointed as power minister in the newly-formed Union Cabinet of the Prime Minister Narendra Modi-led government, an official statement said on Monday. Khattar will replace R K Singh who lost elections from Arrah in Bihar.\n\nShripad Yesso Naik, who won the Lok Sabha election from North Goa, has been appointed as the Minister of State for Ministries of Power and New & Renewable Energy. As power minister Khattar will have to deal with various issues including high power demand and coal supply issues faced by power producers across the country.\n\nThe power demand has already touched an all-time high of 250 GW in May this year. Earlier, the power ministry had projected that peak power demand was estimated to touch 260 GW during this summer season. Many power plants have been maintaining coal stock at lower than normative levels.\n\nKhattar would have to work in close coordination with the ministries of coal as well as railways to ensure adequate supply of dry fuel at all power stations across the country. The coal-based thermal power still serves the base load to the national grid, despite having over 190 GW of renewable energy including large hydro (25 MW or above each plant).\n\nKhattar defeated Divyanshu Budhiraja of Indian National Congress in Karnal constituency during the latest general election. In 2014, Khattar became the MLA for the first time and took over as Chief Minister of Haryana. In March 2024, he was replaced by his confidante Nayab Singh Saini. According to some accounts, Khattar is considered close to Prime Minister Modi with whom he worked in the BJP during 1990s. Khattar, a bachelor, worked for almost 40 years as an RSS pracharak. In 1996, Khattar started working with Modi, who was then the BJP in-charge of Haryana.\n\nComing from an agricultural background, his family arrived in Haryana from Pakistan post-partition. His family settled at Nindana, a village in Haryana's Rohtak district. He was born in Nindana in 1954. In 2014, when the BJP formed the government in Haryana on its own for the first time, Khattar became the state's first non-Jat chief minister in nearly two decades, fracturing Jats' longstanding domination in the state's politics.\n\nDuring his first stint as chief minister, Khattar came under criticism over his handling of the February 2016 Jat quota stir, which saw large-scale violence and arson in several parts of the state. The stir was followed by a flurry of violent incidents which claimed many lives in 2017, when Dera Sacha Sauda chief Gurmeet Ram Rahim Singh was convicted by a court in Panchkula in a rape case.\n\nFor his second stint as CM, which lasted four-and-a-half years, the BJP had to take support of JJP after it fell short of majority in 2019 assembly polls. Khattar's second stint also saw his government face criticism over farmers' stir against now-repealed farm laws. During his two stints as chief minister, Khattar was credited with the decision to introduce pre-qualification conditions for the candidates contesting panchayat elections and ensuring transparent recruitment.\n\nHe also introduced the 'Parivar Pehchan Patra' scheme, under which the Haryana government issues every family a unique family identity. Khattar was also credited for maintaining cordial relations with ally Jannayak Janta Party. However, JJP's tie-up with BJP ended after Khattar was removed from Haryana CM's post.\n\nOn the party's move to bring in Nayab Saini as CM in March, Khattar had said that the move was not sudden and that it was he who had suggested Saini's name to Modi more than a year ago.\n\n\"The reality is when I had served as the chief minister for eight to eight-and-a-half years, I myself told Prime Minister Narendra Modi that in any person's life if he hands over the baton to anyone on his own will, there cannot be a matter of greater happiness. I had said this to him about myself more than a year ago,\" Khattar had said.\n\nSworn in into the fresh Union Cabinet on Sunday, the BJP veteran now is set to begin his new innings as a parliamentarian and a Union Minister.\n\nNew Delhi:RSS pracharak and Haryana's former chief minister Manohar Lal Khattar has been appointed as power minister in the newly-formed Union Cabinet of the Prime Minister Narendra Modi-led government, an official statement said on Monday. Khattar will replace R K Singh who lost elections from Arrah in Bihar.Shripad Yesso Naik, who won the Lok Sabha election from North Goa, has been appointed as the Minister of State for Ministries of Power and New & Renewable Energy. As power minister Khattar will have to deal with various issues including high power demand and coal supply issues faced by power producers across the country.The power demand has already touched an all-time high of 250 GW in May this year. Earlier, the power ministry had projected that peak power demand was estimated to touch 260 GW during this summer season. Many power plants have been maintaining coal stock at lower than normative levels.Khattar would have to work in close coordination with the ministries of coal as well as railways to ensure adequate supply of dry fuel at all power stations across the country. The coal-based thermal power still serves the base load to the national grid, despite having over 190 GW of renewable energy including large hydro (25 MW or above each plant).Khattar defeated Divyanshu Budhiraja of Indian National Congress in Karnal constituency during the latest general election. In 2014, Khattar became the MLA for the first time and took over as Chief Minister of Haryana. In March 2024, he was replaced by his confidante Nayab Singh Saini. According to some accounts, Khattar is considered close to Prime Minister Modi with whom he worked in the BJP during 1990s. Khattar, a bachelor, worked for almost 40 years as an RSS pracharak. In 1996, Khattar started working with Modi, who was then the BJP in-charge of Haryana.Coming from an agricultural background, his family arrived in Haryana from Pakistan post-partition. His family settled at Nindana, a village in Haryana's Rohtak district. He was born in Nindana in 1954. In 2014, when the BJP formed the government in Haryana on its own for the first time, Khattar became the state's first non-Jat chief minister in nearly two decades, fracturing Jats' longstanding domination in the state's politics.During his first stint as chief minister, Khattar came under criticism over his handling of the February 2016 Jat quota stir, which saw large-scale violence and arson in several parts of the state. The stir was followed by a flurry of violent incidents which claimed many lives in 2017, when Dera Sacha Sauda chief Gurmeet Ram Rahim Singh was convicted by a court in Panchkula in a rape case.For his second stint as CM, which lasted four-and-a-half years, the BJP had to take support of JJP after it fell short of majority in 2019 assembly polls. Khattar's second stint also saw his government face criticism over farmers' stir against now-repealed farm laws. During his two stints as chief minister, Khattar was credited with the decision to introduce pre-qualification conditions for the candidates contesting panchayat elections and ensuring transparent recruitment.He also introduced the 'Parivar Pehchan Patra' scheme, under which the Haryana government issues every family a unique family identity. Khattar was also credited for maintaining cordial relations with ally Jannayak Janta Party. However, JJP's tie-up with BJP ended after Khattar was removed from Haryana CM's post.On the party's move to bring in Nayab Saini as CM in March, Khattar had said that the move was not sudden and that it was he who had suggested Saini's name to Modi more than a year ago.\"The reality is when I had served as the chief minister for eight to eight-and-a-half years, I myself told Prime Minister Narendra Modi that in any person's life if he hands over the baton to anyone on his own will, there cannot be a matter of greater happiness. I had said this to him about myself more than a year ago,\" Khattar had said.Sworn in into the fresh Union Cabinet on Sunday, the BJP veteran now is set to begin his new innings as a parliamentarian and a Union Minister.\n\nNew Delhi:RSS pracharak and Haryana's former chief minister Manohar Lal Khattar has been appointed as power minister in the newly-formed Union Cabinet of the Prime Minister Narendra Modi-led government, an official statement said on Monday. Khattar will replace R K Singh who lost elections from Arrah in Bihar.\n\nShripad Yesso Naik, who won the Lok Sabha election from North Goa, has been appointed as the Minister of State for Ministries of Power and New & Renewable Energy. As power minister Khattar will have to deal with various issues including high power demand and coal supply issues faced by power producers across the country.\n\nThe power demand has already touched an all-time high of 250 GW in May this year. Earlier, the power ministry had projected that peak power demand was estimated to touch 260 GW during this summer season. Many power plants have been maintaining coal stock at lower than normative levels.\n\nKhattar would have to work in close coordination with the ministries of coal as well as railways to ensure adequate supply of dry fuel at all power stations across the country. The coal-based thermal power still serves the base load to the national grid, despite having over 190 GW of renewable energy including large hydro (25 MW or above each plant).\n\nKhattar defeated Divyanshu Budhiraja of Indian National Congress in Karnal constituency during the latest general election. In 2014, Khattar became the MLA for the first time and took over as Chief Minister of Haryana. In March 2024, he was replaced by his confidante Nayab Singh Saini. According to some accounts, Khattar is considered close to Prime Minister Modi with whom he worked in the BJP during 1990s. Khattar, a bachelor, worked for almost 40 years as an RSS pracharak. In 1996, Khattar started working with Modi, who was then the BJP in-charge of Haryana.\n\nComing from an agricultural background, his family arrived in Haryana from Pakistan post-partition. His family settled at Nindana, a village in Haryana's Rohtak district. He was born in Nindana in 1954. In 2014, when the BJP formed the government in Haryana on its own for the first time, Khattar became the state's first non-Jat chief minister in nearly two decades, fracturing Jats' longstanding domination in the state's politics.\n\nDuring his first stint as chief minister, Khattar came under criticism over his handling of the February 2016 Jat quota stir, which saw large-scale violence and arson in several parts of the state. The stir was followed by a flurry of violent incidents which claimed many lives in 2017, when Dera Sacha Sauda chief Gurmeet Ram Rahim Singh was convicted by a court in Panchkula in a rape case.\n\nFor his second stint as CM, which lasted four-and-a-half years, the BJP had to take support of JJP after it fell short of majority in 2019 assembly polls. Khattar's second stint also saw his government face criticism over farmers' stir against now-repealed farm laws. During his two stints as chief minister, Khattar was credited with the decision to introduce pre-qualification conditions for the candidates contesting panchayat elections and ensuring transparent recruitment.\n\nHe also introduced the 'Parivar Pehchan Patra' scheme, under which the Haryana government issues every family a unique family identity. Khattar was also credited for maintaining cordial relations with ally Jannayak Janta Party. However, JJP's tie-up with BJP ended after Khattar was removed from Haryana CM's post.\n\nOn the party's move to bring in Nayab Saini as CM in March, Khattar had said that the move was not sudden and that it was he who had suggested Saini's name to Modi more than a year ago.\n\n\"The reality is when I had served as the chief minister for eight to eight-and-a-half years, I myself told Prime Minister Narendra Modi that in any person's life if he hands over the baton to anyone on his own will, there cannot be a matter of greater happiness. I had said this to him about myself more than a year ago,\" Khattar had said.\n\nSworn in into the fresh Union Cabinet on Sunday, the BJP veteran now is set to begin his new innings as a parliamentarian and a Union Minister.\n\nFor All Latest Updates\n\nTAGGED:\n\nATF Price Hiked By Steep 7.5%, Commercial LPG Rate Cut By Rs 58.5\n\n6 Workers Die In Explosion At Firecracker Factory Near Sivakasi In Tamil Nadu\n\nFIFA Club World Cup: Manchester City, Inter Milan Face Shock Exit With Defeats Against Al Hilal, Fluminense\n\nChartered Accountants' Day 2025: With 15 CAs, This Jaipur Family Carries Forward A Legacy\n\nDigital India Bridged Divide, Democratised Opportunity: PM Modi\n\nPomegranate Pioneer: Why Maharashtra's IT Engineer Quit Lucrative Job To Grow And Export Fruits\n\nEnvironment | Shipra In Madhya Pradesh, Another Holy River In Death Throes\n\nFeeding Pigeons In Public ? You Could Be Contributing To Serious Health Risks\n\nWhat Saturn’s Transit Means for Your Bones, Brain, and Burnout, Here’s How to Work with the Energy, Not Against It\n\nCopyright ©2025Ushodaya Enterprises Pvt. Ltd.,All Rights Reserved."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar Donates His Entire Ancestral Property ...",
    "link": "https://en.theharyanastory.com/article/1746/manohar-lal-khattar-donates-his-entire-ancestral-property-to-pm-relief-fund",
    "source": "Google",
    "snippet": "Union Minister for Energy and Urban Development Manohar Lal Khattar has donated his entire ancestral property to the Prime Minister's Relief Fund.",
    "date": "Mar 21, 2025",
    "content": "ALL RIGHTS RESERVED\n\nUnion Minister for Energy and Urban Development Manohar Lal Khattar has donated his entire ancestral property to the Prime Minister's Relief Fund, setting what many consider an unprecedented example among Indian politicians since independence.\n\nKhattar owned approximately 12 kanal of land in Baniyana village in Rohtak district, valued at around Rs 35 lakh. He had previously donated his ancestral house in the same village to establish a public library.\n\nAccording to his election affidavit, Khattar had fixed deposits worth Rs 1.30 crore in the State Bank of India, along with Rs 1,554 in Punjab National Bank and Rs 25,000 in another State Bank of India account. He has now donated all these assets to the Prime Minister's Relief Fund.\n\nPost-Partition Life\n\nAfter Partition, Khattar's family migrated from Pakistan and initially settled in Nidana village in Rohtak district. Later, they were allotted some land in Baniyana village. His father, Harbans Lal, opened a small shop in the village and began farming.\n\nKhattar, who devoted his entire life to the Rashtriya Swayamsevak Sangh (RSS), never married. He inherited around 12 kanal of land in the village as his share of the family property.\n\nSimple Lifestyle\n\nThroughout his public life, Khattar has lived without a house of his own. He believes the entire state is his family, and his life is completely dedicated to national interest. He maintains a simple lifestyle.\n\nAfter graduating from Delhi University in 1975, he devoted himself completely to the RSS. From 1977 to 1994, he worked in various positions within the organization for 17 consecutive years.\n\nIn 1994, he was appointed as BJP's organization secretary and often stayed at the BJP office in Rohtak. He always eats simple food and even after becoming Chief Minister, he continued to make his own tea and food in the Chief Minister's residence kitchen for quite some time, though this habit gradually faded as his responsibilities increased.\n\nA message going viral on social media notes, \"Former Haryana Chief Minister and current Union Cabinet Minister Manohar Lal has made history after independence by donating his entire property to the Prime Minister's National Relief Fund and his private residence for a public library.\"\n\n\n\n\n\n\n\n© THS MEDIA PRIVATE LIMITED"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar न्यूज़",
    "link": "https://www.livehindustan.com/tags/manohar-lal-khattar",
    "source": "Google",
    "snippet": "राज्यों से परमाणु संयंत्रों के लिए प्रस्ताव भेजने को कहाः खट्टर. केंद्रीय ऊर्जा मंत्री मनोहर लाल खट्टर ने गोवा में परमाणु ऊर्जा संयंत्र स्थापित करने की संभावना पर चर्चा की। खट्टर ने कहा कि केंद्र ने राज्य सरकारों से प्रस्ताव भेजने को कहा है ...",
    "date": "N/A",
    "content": "केंद्रीय ऊर्जा मंत्री मनोहरलाल खट्टर ने कहा कि बिहार में न्यूक्लियर पावर प्लांट लगाया जाएगा। बिहार सरकार इस पर काम शुरू करे, केंद्र इसमें पूरी मदद करेगा।\n\nऊर्जा मंत्रियों के सम्मेलन में शामिल होने के लिए केंद्रीय ऊर्जा मंत्री मंगलवार सुबह पटना आएंगे। सम्मेलन में वर्ष 2030 तक बिजली की उपलब्धता, खपत, संचरण क्षमता, साइबर सुरक्षा को लेकर की जाने वाली तैयारी, विद्युत प्रणाली में द्वीप योजनाएं, ट्रांसमिशन सिस्टम पर चर्चा होगी।\n\nमुख्यमंत्री धामी ने कहा कि दिल्ली से मेरठ तक इस आरआरटीएस योजना पर पहले से ही काम चल रहा है। इस योजना को हरिद्वार तक बढ़ा कर यूपी से लेकर उत्तराखंड के शेष पूरे क्षेत्र को लाभांवित किया जा सकता है।\n\nकेंद्रीय मंत्री मनोहर लाल खट्टर ने कहा कि नए मानकों का मकसद एसी के उपयोग में एकरूपता लाना और अत्यधिक बिजली खपत को कम करना है। यह कदम भारत के ऊर्जा संरक्षण और बिजली मांग को कम करने के प्रयासों का हिस्सा है।\n\nकेंद्रीय ऊर्जा मंत्री मनोहर लाल खट्टर ने गोवा में परमाणु ऊर्जा संयंत्र स्थापित करने की संभावना पर चर्चा की। खट्टर ने कहा कि केंद्र ने राज्य सरकारों से प्रस्ताव भेजने को कहा है। वर्तमान में भारत 8...\n\nकेंद्रीय मंत्री मनोहर लाल खट्टर ने पहलगाम आतंकी हमले की निंदा की और कहा कि सरकार इस दिशा में काम कर रही है कि ऐसी घटनाएँ फिर न हों। उन्होंने करनाल में एक नौसेना अधिकारी के परिजनों से मुलाकात के दौरान...\n\nपंचकूला के जिलाध्यक्ष अजय मित्तल होंगे। इसके अलावा अनिल विज का गढ़ कहे जाने वाले अंबाला जिले में संगठन की कमान मंदीप राणा संभालेंगे। यमुनानगर से राजेश सपरा को चुना गया है। कुरुक्षेत्र से तेजेंद्र गोल्डी पार्टी की कमान संभालेंगे। कैथल में महिला नेतृत्व चुना गया है। यहां ज्योति सैनी जिलाध्यक्ष होंगी।\n\nमानेसर नगर निगम में निर्दलीय मेयर प्रत्याशी डॉ. इंद्रजीत यादव विजयी रहे हैं। कांग्रेस का 10 में से किसी भी एक सीट पर खाता नहीं खुल सका है। इसके अलावा 21 नगर परिषदों के चुनाव में भी कांग्रेस को करारा झटका लगा है। सोनीपत, पानीपत, गुरुग्राम से लेकर फरीदाबाद तक में भाजपा को जोरदार जीत मिली है।\n\nकेंद्रीय मंत्री ने बताया कि मृतक के परिवार को कुल राशी 3 करोड़ 10 लाख रुपये मिली है। बच्चों को पढ़ाई और पत्नी को मासिक खर्च जैसी आर्थिक मदद दिलाने की बात कही गई है।\n\nकेंद्रीय मंत्री मनोहर लाल खट्टर समीक्षा के दौरान अधिकारियों को मेट्रो निर्माण कार्य में तेजी लाने का निर्देश दिया, ताकि यह परियोजना समय पर पूरी हो सके। उन्होंने शहरी परिवहन व्यवस्था को सुचारू बनाने के लिए आधुनिक तकनीकों का उपयोग कर जनता को बेहतर सुविधाएं देने को कहा\n\nआरएसएसविज्ञापन र॓टहमार॓ साथ काम करेंहमारे बारे मेंसंपर्क करेंगोपनीयतासाइट जानकारी\n\nAdvertise with usAbout usCareersPrivacyContact usSitemapCode Of Ethics\n\nPartner sites:Hindustan TimesMintHT TechShineHT TeluguHT BanglaHT TamilHT MarathiHT AutoHealthshotsHT SmartcastFAB Play"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Ahead of Lok Sabha polls, Manohar Lal Khattar resigns as ...",
    "link": "https://www.thenewsminute.com/news/ahead-of-lok-sabha-polls-manohar-lal-khattar-resigns-as-haryana-chief-minister",
    "source": "Google",
    "snippet": "Haryana Chief Minister Manohar Lal Khattar has resigned as the state's Chief Minister. He tendered his resignation to Governor Bandaru Dattatreya on Monday.",
    "date": "Mar 12, 2024",
    "content": "Haryana Chief Minister Manohar Lal Khattar has resigned as the state’s Chief Minister. He tendered his resignation to Governor Bandaru Dattatreya on Monday, March 12. The move comes amid rumours of a rift between the ruling Bharatiya Janata Party (BJP) and Jannayak Janta Party (JJP) alliance regarding Lok Sabha elections seat-sharing. A cabinet reshuffle is expected in the evening.\n\nAccording to reports, the central BJP leadership has appointed Union ministers Arjun Munda and the party's national general secretary Tarun Chugh as observers in the state. Earlier in the day, Khattar had called an emergency meeting of all party legislators along with seven Independent MLAs in the state capital.\n\nSenior BJP leaders told IANS that the JJP was demanding tickets for 10 Lok Sabha seats. A meeting between BJP President JP Nadda and Haryana Deputy Chief Minister and JJP leader Dushyant Chautala regarding the matter did not yield any result. The BJP has started looking at independent legislators to keep the government intact, at least till the Assembly polls in October.\n\nIn the 2018 Assembly polls, the ruling BJP had won 40 seats but failed to cross the halfway mark in the 90-member Assembly. Congress won 31 seats, while the then less-than-year-old JJP, which broke away from the state's once major regional Indian National Lok Dal (INLD), won 10 seats. BJP, which was six short of a majority, had an alliance with the JJP.\n\nAt that time, seven independent MLAs had extended support to the BJP, helping it reach a tally of 57 seats.\n\n(With inputs from IANS)\n\n© thenewsminute 2025"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Haryana Chief Minister Manohar Lal Khattar | Latest & ...",
    "link": "https://www.moneycontrol.com/news/tags/haryana-chief-minister-manohar-lal-khattar.html",
    "source": "Google",
    "snippet": "Get all latest & breaking news on Haryana Chief Minister Manohar Lal Khattar. Watch videos, top stories and articles on Haryana Chief Minister Manohar Lal ...",
    "date": "N/A",
    "content": "My Account\n\nFollow us on:\n\nPowered By\n\nSee the top gainers, losers, invest and get updated what's happening in the crypto market\n\nInvest Now\n\nPowered By\n\nThis functionality will provide users with ease of access navigation and enable create a new revenue line by generating leads of potential customers for brokers in a more integrated manner.\n\nInvest Now\n\nHaryana Lok Sabha Elections 2024: Seat-sharing talks between BJP and JJP have appeared to hit a roadblock. Manohar Lal Khattar may contest from Karnal in the upcoming Lok Sabha elections.\n\nMaking the announcement in the state assembly, Khattar said police commissionerate has already been established in the three Haryana districts which fall in NCR – Faridabad, Gurugram and Sonipat.\n\nThe protesters had planned to 'gherao' Chief Minister Khattar's residence in Karnal but were stopped by police, who deployed personnel in large numbers and erected barricades. AAP workers tried to force their way through the barricades but failed, following which some squatted on the road.\n\nThe announcement was made by Chief Minister Manohar Lal Khattar here on Monday.\n\nInteracting with the state's farmers through audio conferencing during the 'CM ki Vishesh Charcha' programme, Khattar praised their efforts to reduce stubble burning incidents, according to an official release.\n\nSpeaking as the chief guest at the Dhanteras Mahila Samman Samaroh organised at Surajkund, Faridabad, Khattar said that women play an indispensable role during festivals.\n\nThe initiatives launched on the occasion of Haryana's formation day will enhance healthcare and well-being of the people, an official statement said.\n\nThis will not only enhance their income but will also ensure the protection of the environment. The farmers' future centres around crop diversity, it said\n\nKhattar also offered prayers at the Nalheshwar Mahadev temple in Nalhar village, where a procession led by the Vishva Hindu Parishad (VHP) had been attacked.\n\nVehicles are being checked at the borders. Drones are also being used for security, the officials said, adding that foot patrolling is being conducted in many areas and senior officers are interacting with locals.\n\nKhattar said the National Green Tribunal has imposed a fine of Rs 45 crore on Rajasthan for releasing polluted water from Bhiwadi towards Dharuhera, but the neighbouring state has approached the court and got a stay on the matter.\n\nThe government will take a decision regarding the scheme within a month, Khattar said\n\n\n\nThe hospitals will come up in Hisar, Ambala, Karnal, Sonipat, Rohtak and Panchkula districts of Haryana\n\nThe recent notification issued by Manohar Lal Khattar-led BJP government specifies the criteria for exclusion of people in the “creamy layer” from reservations in Haryana. However, the Congress party has alleged that it is simply a copy of another notification quashed recently by the Supreme Court.\n\nHaryana CM Manohar Lal Khattar urged Punjab CM Amarinder Singh to desist from misleading farmers, pointing out that he has already pledged to quit politics if the Minimum Support Price (MSP) mechanism is ever dismantled.\n\nKhattar also directed all educational institutions to take the help of the regional passport office to complete the process so that the documents can be handed over to the students along with their graduation degree.\n\nDuring the 2019 Haryana Assembly election campaign, Khattar had vowed to implement the contentious NRC in his state to curb illegal immigration\n\nHaryana CM Manohar Lal Khattar has maneuvered extensively through the constituency, with elaborate campaigns and public speeches\n\nThe parents of the survivor alleged that police officials refused to take their complaint\n\nPeople visiting MG Road, Sadar Bazaar, Sector 29 market and Sarhaul Village can enjoy free Wi-Fi sessions on their devices. Users will be able to enjoy a free daily quota limit of 30 minutes per day per device, Airtel said in a statement.\n\nReferring to the 'Beti Bachao-Beti Padhao' campaign, he said the sex ratio in the state has increased to 900 from 837 due to the sincere efforts by the government with people's support.\n\nOn the power grid project, he said, \"Within two years, there will be no power crisis in Gurgaon as a smart power grid is being developed here which will supply 24 hours electricity in the city. This task will be completed in four phases. The first phase tender process has been completed.\"\n\nReacting to the Budget proposals here, the Chief Minister was all praise for the goal to double the income of farmers in five years and the provision of Rs 35,984 crore for their welfare.\n\nKhattar has clarified that Jats will be given reservation under special category, not in OBC category\n\nSensex LiveHDB Financial Services IPOKalpataru Projects Share PriceIndia News LiveTelangana Pharma Company BlastElon MuskGSTShefali Jariwala DeathApollo Hospitals share priceAir India Crash\n\nBusinessMarketsStocksIndia NewsCity NewsEconomyMutual FundsPersonal FinanceIPO NewsStartups\n\nHomeCurrenciesCommoditiesPre-MarketIPOGlobal MarketBonds\n\nHomeLoans up to 50 LakhsCredit Cards Lifetime FreeFinance TrackerNewFixed DepositsFixed Deposit ComparisonFixed Income\n\nHomeMC 30Top Ranked FundsETFsMutual Fund Screener\n\nIncome Tax CalculatorEMI CalculatorRetirement PlanningGratuity Calculator\n\nStock Markets\n\nNews18FirstpostCNBC TV18News18 HindiCricketnextOverdrive\n\nAbout UsContact UsAdvisory AlertAdvertise with UsSupportDisclaimerPrivacy PolicyCookie PolicyTerms & ConditionsFinancial Terms (Glossary)SitemapInvestors\n\nCopyright © Network18 Media & Investments Limited. All rights reserved. Reproduction of news articles, photos, videos or any other content in whole or in part in any form or medium without express written permission of moneycontrol.com is prohibited.\n\nYou are already a Moneycontrol Pro user."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar Resigns As Haryana Chief Minister",
    "link": "https://swarajyamag.com/news-brief/haryana-cm-khattar-likely-to-resign-as-bjp-jjp-alliance-set-to-end-heres-what-we-know-so-far",
    "source": "Google",
    "snippet": "Amidst escalating tensions within the ruling coalition in Haryana, Chief Minister Manohar Lal Khattar resigned from his position on Tuesday ...",
    "date": "Mar 12, 2024",
    "content": "News Brief\n\nNayan Dwivedi\n\nMar 12, 2024, 11:08 AM | Updated  01:02 PM IST\n\nSave & read from anywhere!\n\nBookmark stories for easy access on any device or theSwarajya app.\n\nAmidst escalating tensions within the ruling coalition in Haryana, Chief Minister Manohar Lal Khattar resigned from his position on Tuesday (12 March), according tomedia reports.\n\nReportssuggest that Nayab Saini or Sanjay Bhatia may emerge as potential replacements.\n\nAdditionally, there are indications that Khattar could be nominated as a candidate from Karna in the upcoming Lok Sabha elections.\n\nAgainst the backdrop of this development, Chief Minister Khattar had summoned a meeting of BJP and government-backed independent MLAs at his residence today at 11:30 am.\n\nThis gathering is anticipated to be instrumental in devising a strategy for potential government formation with the support of independent MLAs.\n\nSimultaneously, JJP leader Dushyant Chautala had also called for a meeting of party MLAs in Delhi around 11 am.\n\nSpeculation emerge that significant decisions may be taken during this session, including the party's stance on fielding candidates for the Hisar and Bhiwani-Mahendragarh Lok Sabha seats.\n\nMeanwhile, reports have also hinted at a complete Cabinet reshuffle, with the BJP likely to exclude JJP representatives and instead seek the support of Independent MLAs.\n\nCurrently, in the 90-member Haryana Assembly, the BJP has 41 MLAs, while the Congress has 30, the JJP 10, and there are 7 Independents, apart from an MLA each of the INLD (Indian National Lok Dal) and Haryana Lokhit Party.\n\nAlso Read:Chinese 'Research Vessel' Monitored India's Agni-5 Missile Test: Report\n\nNayan Dwivedi is Staff Writer at Swarajya.\n\nJoin ourWhatsApp channel- no spam, only sharp analysis\n\nComments↓\n\nAbout Swarajya\n\nShaping the modern Indian's worldview, speaking on behalf of those invested in the cultural and economic prosperity of India. Published since 1956.\n\nSwarajya is a publication by Kovai Media Private Limited.\n\nUseful Links\n\nUseful Links\n\nParticipate\n\nStay Connected"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Topic: CM Manohar Lal Khattar",
    "link": "https://theprint.in/tag/cm-manohar-lal-khattar/",
    "source": "Google",
    "snippet": "... Manohar Lal Khattar. Topic: CM Manohar Lal Khattar. Heavyweight missing in action. Why BJP kept its 2-term Haryana CM Khattar away from poll campaign.",
    "date": "N/A",
    "content": "Required fields are marked*\n\n\n\nName*\n\nEmail*\n\n\n\nΔ\n\nBJP may win 25-30 seats.\n\nNotwithstanding Khattar deliberately being kept away from BJP’s poll campaigning for Haryana Assembly elections, its results may not be any different. In fact, this party appears to be on a highly slippery political pitch this time around, for some well known reasons.\n\nCopyright © 2025 Printline Media Pvt. Ltd. All rights reserved."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar- Meet the new Power, Housing and ...",
    "link": "https://en.theharyanastory.com/article/691/manohar-lal-khattar-meet-the-new-power-housing-and-urban-affairs-minister",
    "source": "Google",
    "snippet": "Former Haryana Chief Minister and BJP veteran from Haryana, Manohar Lal Khattar, has been appointed as the Power minister in Modi 3.0.",
    "date": "Jun 10, 2024",
    "content": "ALL RIGHTS RESERVED\n\nFormer Haryana Chief Minister and BJP veteran from Haryana, Manohar Lal Khattar, has been appointed as the Power minister in Modi 3.0. Along with Khattar, the six-time North Goa MP Shripad Yesso Naik, will serve as the Minister of State for the portfolio. Along with the power ministry, Khattar has also been assigned the key portfolio of Housing and Urban Affairs in the new Cabinet. After the change of guard in Haryana in March 2024, it was expected, looking at his long experience in public service that ML Khattar would move to Delhi after the Lok Sabha elections.\n\nAfter resigning from the CM post Khattar contested from Karnal constituency and secured a victory with a substantial margin of 2,32,577 votes. Born on May 5, 1954, in Nindana village of Rohtak district, Manohar Lal Khattar spent his early life in rural Haryana. Notably, before entering politics, Khattar was associated with the Sangh Parivar for many years. Khattar joined the Rashtriya Swayamsevak Sangh (RSS) in 1977 and became a full-time pracharak (worker) in 1980. Later he joined the Bharatiya Janata Party (BJP) in 1994.  Known as a loyal party man and committed to the ideology, Khattar climbed the political ladder, becoming the party's national executive member.  This is when working as a grass-root party worker, Khattar worked with Narendra Modi who spent many years in the state overseeing the party’s work.\n\nRecalling his old days with Manohar Lal Khattar, PM Modi during the inauguration of the Dwarka expressway in Haryana in March 2023, said, “Manohar Lal and I are old friends. He used to have a motorcycle which he used to ride and I used to sit at the back of the bike. We used to often take rides on motorcycles in Haryana.”\n\nDuring his two stints as the Chief Minister of Haryana, Khattar took several important decisions and initiatives that transformed the lives of “Desi” Haryanvis. Khattar government introduced the 'Parivar Pehchan Patra' scheme, under which the Haryana government issues every family a unique family identity. It led to transparent and fast delivery of services which made lives easier for lakhs of Haryanvis living in villages. Khattar is also credited with introducing pre-qualification conditions for the candidates contesting panchayat elections and ensuring transparent recruitment. Khattar’s corruption-free rule in Haryana is also hailed for the improvement in the sex ratio, an issue which particularly earned a bad name to Haryana.\n\nKhattar government during his nearly 10-year tenure specially focused on backward regions of Haryana. Villages of South Haryana that had never seen regular water supply got permanent tap connections and regular water supply under the fair delivery of schemes like “Har Ghar Jal se Nal”. For the villagers used to a 4-hour electricity pattern in the day, 24-hour electricity was a distant dream for them. Khattar government made sure the 24-hour electricity facility reached every village of Haryana.\n\nSilencing the critics who attacked his 10-year tenure after the change of guard in the BJP government, Khattar had said “The reality is when I had served as the chief minister for eight to eight-and-a-half years, I told Prime Minister Narendra Modi that in any person's life, if he hands over the baton to anyone on his own will, there cannot be a matter of greater happiness. I had said this to him about myself more than a year ago”. Sworn into the new cabinet, the “Tau” of Haryana is all set to begin his new innings as parliamentarian and cabinet minister. The team of “The Haryana Story” congratulates and wishes good luck to the new Power minister of India.\n\n\n\n\n\n\n\n© THS MEDIA PRIVATE LIMITED"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "In Haryana politics, should Manohar Lal Khattar be seen as ...",
    "link": "https://www.quora.com/In-Haryana-politics-should-Manohar-Lal-Khattar-be-seen-as-a-BJP-leader-or-an-independent-leader",
    "source": "Google",
    "snippet": "Manohar Lal Khattar was born in the Baniyani village in Rohtak district. He was an RSS Pracharak and worked behind the curtains in the BJP for a ...",
    "date": "N/A",
    "content": "Something went wrong. Wait a moment and try again."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Modi 3.0: Former Haryana CM Manohar Lal Khattar gets ...",
    "link": "https://www.businesstoday.in/india/story/modi-30-former-haryana-cm-manohar-lal-khattar-gets-power-housing-and-urban-affairs-432791-2024-06-10",
    "source": "Google",
    "snippet": "Former Haryana Chief Minister Manohar Lal Khattar has been appointed as the Power Minister in Modi 3.0, alongside six-time North Goa MP Shripad Yesso Naik.",
    "date": "Jun 10, 2024",
    "content": "Home\n\nMarket\n\nBT TV\n\nReels\n\nMenu\n\nFormer Haryana Chief Minister Manohar Lal Khattar has been appointed as the Power Minister in Modi 3.0, alongside six-time North Goa MP Shripad Yesso Naik, who will serve as the Minister of State for the portfolio.\n\nIn addition to this role, Khattar has also been assigned Housing and Urban Affairs in the new Cabinet.\n\nKhattar, 70, served as Haryana's chief minister until March 12, when he was succeeded by Nayab Singh Saini.\n\nRecently, he contested from the Karnal constituency in the Lok Sabha elections, securing a victory with a substantial margin of 2,32,577 votes.\n\nA crucial portfolio, global rating agency Moody’s has expressed strong confidence in the growth trajectory of India’s power sector. Moody’s highlighted that investments in renewable energy and electricity transmission will continue to drive the sector over the next six to seven years, projecting power demand in India to grow by 5 to 6 percent annually during this period.\n\nThe agency also noted that coal-based generation capacity additions will likely support baseload requirements.\n\nMoody’s pointed out that renewable energy companies, which are largely funded by debt, will experience high financial leverage over the next three years. However, the industry benefits from consistent government regulations and policies that support the transition to renewable energy, enabling power companies to progress despite high debt levels.\n\nThe rating agency emphasized the importance of the renewable energy sector, stating that India needs to add around 44 gigawatts (GW) to meet its target of 500 GW of renewable energy capacity by 2030. Achieving this target will require an investment of $190 billion to $215 billion over the next seven years. Additionally, an estimated $150 billion to $170 billion will be needed for electricity transmission, distribution, and energy storage to accommodate the incremental renewable energy capacity.\n\nMoody’s highlighted that strong policy support has enabled India to increase the share of renewable energy in its power capacity mix to around 43 percent in the fiscal year 2023-2024. Continued policy support will help India make significant progress towards its 2030 transition targets and its 2070 net-zero targets. The country aims to achieve 500 GW of renewable energy installed capacity by 2030 and has set a target to produce 5 million tonnes of green hydrogen by 2030, supported by 125 GW of renewable energy capacity.\n\nCopyright ©2025Living Media India Limited. For reprint rights: Syndications Today. India Today Group."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "An old, unrelated photo is being shared as visuals of ...",
    "link": "https://factly.in/an-old-unrelated-photo-is-being-shared-as-visuals-of-manohar-lal-khattar-vacating-his-official-residence-after-his-resignation/",
    "source": "Google",
    "snippet": "Claim: The viral image shows former Haryana Chief Minister Manohar Lal Khattar vacating his official residence carrying minimum luggage. Fact: ...",
    "date": "Mar 21, 2024",
    "content": "A photograph (hereandhere) allegedly depicting former Haryana Chief Minister Manohar Lal Khattar vacating his official residence has been increasingly shared on various social media platforms. The claim is that this photograph was captured when Khattar packed his belongings to leave his official residence soon after his resignation. We fact-check this claim through this article.\n\nClaim:The viral image shows former Haryana Chief Minister Manohar Lal Khattar vacating his official residence carrying minimum luggage.\n\nFact:The image in question is an old one, which has been available on the internet since 2019, long before Khattar’s resignation as the Chief Minister on 12 March 2024. Thus, the claim attached to the post isFalse.\n\nTo verify the authenticity of the viral claim, we performed a reverse image search. This led us to several old posts (here,here, andhere) on social media, dating back to 2019 and 2020, that featured the same image but attached to different contexts, such as the farm bills of 2020.\n\nThis evidence confirms that the image predates Khattar’s resignation as the Chief Minister, which took place on 12 March 2024 (hereandhere). Hence, it could not possibly be a photograph of Khattar vacating his official residence post-resignation.\n\nAdditionally, a thorough search through recent news reports and Manohar Lal Khattar’sofficial social media handlesdid not yield any posts or information about him leaving his official residence carrying minimum luggage.\n\nA careful comparison of the viral image with photos of Manohar Lal Khattar raises doubts if the person in the viral image is indeed Khattar. However, we could not independently verify the identity of the person in the viral image and the context. Its availability on the internet way before Manohar Lal Khattar’s resignation proves that it has nothing to with what is being claimed in the viral post.\n\nTo sum up,the photograph in the viral claim predates Manohar Lal Khattar’s resignation and does not depict him vacating his official residence after resignation.\n\n\n\nComments are closed.\n\nFACTLY is one of the well known Data Journalism/Public Information portals in India. Each news story on FACTLY is backed by factual evidence/data from official sources that is either available in the public domain or that is collated/gathered/collected using tools such as the Right to Information (RTI)."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar Net Worth: Former Haryana CM has ...",
    "link": "https://www.timesnownews.com/business-economy/industry/manohar-lal-khattar-net-worth-former-haryana-cm-has-net-worth-of-over-2-crore-article-110840289",
    "source": "Google",
    "snippet": "Khattar has a net worth of over Rs 2 crore. According to the information, the 70-year-old Khattar declared moveable assets worth Rs 2.14 crore.",
    "date": "Jun 9, 2024",
    "content": "Theme\n\nBusiness\n\nPersonal Finance\n\nMarkets\n\nCompanies\n\nEconomy\n\nIndustry\n\nReal Estate\n\nUpdated Jun 9, 2024, 16:52 IST\n\nManohar Lal Khattar Net Worth: Former Haryana CM has Net Worth of over 2 Crore\n\nParas Bisht is an Assistant Editor in ET NOW and Times NOW Business Section. He writes on Personal Finance, Stocks, General News.View More\n\nnews\n\nbusiness\n\nindustry\n\nFollow us :\n\n© 2025 Bennett, Coleman & Company Limited"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Manohar Lal Khattar takes charge as Power Minister",
    "link": "https://www.yugmarg.com/news/26881-manohar-lal-khattar-takes-charge-as-power-minister",
    "source": "Google",
    "snippet": "Manohar Lal Khattar won from Karnal defeating Congress' Divyanshu Budhiraja by a margin of 232577 votes. Khattar was the Chief Minister till ...",
    "date": "Jun 11, 2024",
    "content": "New Delhi : Former Chief Minister of Haryana Manohar Lal Khattar assumed charge as Power Minister on Tuesday. ML Khattar has been given charge of two ministries in the Narendra Modi-led cabinet - Power and Housing and Urban Affairs Ministries.\n\n\n\nKhattar has replaced RK Singh who lost elections from Arrah in Bihar. In a post in Hindi on X, Manohar Lal Khattar wrote, \"Took charge as Union Power Minister today. Under the successful leadership of Prime Minister Narendra Modi, the Ministry of Energy will continuously work for 'Developed India'.\"\n\nManohar Lal Khattar won from Karnal defeating Congress' Divyanshu Budhiraja by a margin of 232577 votes. Khattar was the Chief Minister till March this year when the Bharatiya Janata Party suddenly chose to drop him from the post and field him for the Lok Sabha.\n\nHe was replaced by Nayab Singh Saini as the Chief Minister. Khattar, a former Rashtriya Swayamsevak Sangh pracharak has served as the Chief Minister for two terms from October 2014 and has been representing Karnal Legislative Assembly since 2014.\n\nIn the 2019 Vidhan Sabha elections, he defeated Congress' Tarlochan Singh by a margin of 45,188 votes. In 2014, Khattar won against Independent Candidate Jai Parkash Gupta by a margin of 63,773 votes.\n\nKhattar was the Organizational General Secretary of the BJP in Haryana during 2000-2014 and started the publication of Bhajpa Ki Baat magazine in October 2000.\n\nBJP-led National Democratic Alliance has won its third successive term in Lok Sabha polls. The NDA won 293 seats in the Lok Sabha polls with BJP getting 240 seats."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Power Minister Manohar Lal Khattar arrives in Kathmandu ...",
    "link": "https://www.tribuneindia.com/news/world/power-minister-manohar-lal-khattar-arrives-in-kathmandu-on-two-day-visit/",
    "source": "Google",
    "snippet": "Minister for Power and Minister for Housing and Urban Affairs Manohar Lal Khattar arrived in Kathmandu for a two-day visit on Tuesday.",
    "date": "Apr 22, 2025",
    "content": "Kathmandu [Nepal], April 22 (ANI): Minister for Power and Minister for Housing and Urban Affairs Manohar Lal Khattar arrived in Kathmandu for a two-day visit on Tuesday.\n\n\n\nKhattar arrived in Kathmandu at the invitation of Nepali Minister for Energy, Water Resources and Irrigation- Dipak Khadka. During his visit to India on February 12, Minister Khadka had extended an invitation to Indian Power Minister Khattar to visit Nepal.\n\nMinister Khattar is scheduled to inspect the Arun-3 Hydropower Project being constructed by the SJVN Arun-3 Power Development Company (SAPDC), which is owned by the Indian company Satluj Jal Vidyut Nigam (SJVN).\n\n\n\nKhattar will inspect the power house and dam area of the Arun-3 Hydropower Project. Minister for Energy, Water Resources and Irrigation Khadka will also visit Arun-3. SJVN is currently constructing 900 MW Arun-3 Hydropower Project in Sankhuwasabh district.\n\nMost of the structural work of the project has reached the final stage. The company is working to complete the project as quickly as possible. Similarly, SJVN's subsidiary, SAPDC, is also constructing the 669 MW Lower Arun Hydropower Project.\n\n\n\nSimilarly, Minister Khadka and Indian Minister Khattar will jointly inaugurate the Inaruwa-Basantapur-Baneshwor-Tumlingtar 200 kV transmission line and 220/133/33 kV Tumlingtar substation, 220/33 kV Baneshwor substation and 220/133/33 kV Basantapur substation under the Koshi Corridor 220 kV transmission line, which were completed with the assistance of the government of India, at Tumlingtar in Sankhuwasabha.\n\nBoth ministers will also sign an agreement on the transmission line to be built with joint investment by the two countries, and take forward the construction process.\n\nKhattar is scheduled to discuss Indian investment in other hydropower projects as well as new projects with Minister Khadka.\n\nMinister Khattar will also visit Muktinath Temple in Mustang on April 23. The visiting Indian Minister is scheduled to pay a courtesy call on Prime Minister KP Sharma Oli and Deputy Prime Minister and Ministers. (ANI)\n\n(The story has come from a syndicated feed and has not been edited by the Tribune Staff.)\n\nTake your experience further with Premium access.Thought-provoking Opinions, Expert Analysis, In-depth Insights and other Member Only Benefits\n\nAlready a Member?Sign In Now\n\nThe Tribune, now published from Chandigarh, started publication on February 2, 1881, in Lahore (now in Pakistan). It was started by Sardar Dyal Singh Majithia, a public-spirited philanthropist, and is run by a trust comprising five eminent persons as trustees.The Tribune, the largest selling English daily in North India, publishes news and views without any bias or prejudice of any kind. Restraint and moderation, rather than agitational language and partisanship, are the hallmarks of the newspaper. It is an independent newspaper in the real sense of the term.The Tribune has two sister publications, Punjabi Tribune (in Punjabi) and Dainik Tribune (in Hindi).\n\nRemembering Sardar Dyal Singh Majithia"
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Power minister Manohar Lal Khattar assumes office, ...",
    "link": "https://www.livemint.com/news/india/power-minister-manohar-lal-khattar-assumes-office-discusses-capacity-addition-battery-storage-11718112918534.html",
    "source": "Google",
    "snippet": "Former Haryana minister Manohar Lal Khattar has been allocated portfolios of power, and housing and urban development in PM Narendra Modi's ...",
    "date": "Jun 11, 2024",
    "content": "On his first day in office on Tuesday, newly appointed power minister, Manohar Lal Khattar, monitored the country's power supply situation and discussed the addition of power generation, transmission, and battery storage capacities in a meeting with officials and chiefs of public utilities.\n\nEarlier in the day, Khattar assumed charge of the ministry in the presence of his predecessor, Raj Kumar Singh. Minister of State for Power, Shripad Yesso Naik, was also present on the occasion.\n\nTwo officials aware of the matter said that during the first meeting post-assuming charge, the minister discussed capacity addition with a focus on battery storage.\n\n\"The meeting focused on transmission capacity addition, storage capacity addition...also generation capacity addition. We talked about battery storage, basically storage capacity,\" said one of the two people mentioned above.\n\nCapacity addition across segments has gained significance as the government looks at meeting the rising power demand. The Centre aims to set up an additional 80 GW of coal-fired capacity by 2032.\n\nExpansion and upgradation of the transmission network is key with the government's ambitious plan to add 500 GW of non-fossil generation capacity by 2030 and integrate the green capacity into the grid. Further, battery storage is essential for storing renewable power, which is intermittent, and for maintaining grid stability. Last September, the Union Cabinet approved₹3,760 crore in viability gap funding for battery energy storage systems.\n\nKhattar, the Lok Sabha member from Karnal, assumes charge of the power ministry at a time when the power demand in the country is very high due to soaring temperatures. The peak demand hit a record high of 246 GW on 29 May 2024, and is expected to touch 260 GW in this summer.\n\nEnsuring uninterrupted availability of power would be an important and immediate responsibility of the minister.\n\nOn Tuesday, Khattar also assumed charge of the housing and urban affairs ministry.\n\nStay updated with the latestTrending,India,WorldandUnited Statesnews. Follow all the latest updates onIsrael Iran Conflicthere on Livemint.\n\nDownload the Mint app and read premium stories\n\nLog in to our website to save your bookmarks. It'll just take a moment."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Molitics | A controversial video has surfaced showing Manohar ...",
    "link": "https://www.instagram.com/reel/DJ_sqUHOyis/?hl=en",
    "source": "Google",
    "snippet": "A controversial video has surfaced showing Manohar Lal Dhakad, associated with the BJP in Mandsaur, Madhya Pradesh, in an explicit act with a woman on the ...",
    "date": "N/A",
    "content": ""
  },
  {
    "query": "Manohar lal Khattar",
    "title": "Govt sets up task force to roll out India Energy Stack ...",
    "link": "https://www.ap7am.com/en/103896/govt-sets-up-task-force-to-roll-out-india-energy-stack-for-digital-push-to-power-sector",
    "source": "Google",
    "snippet": "Speaking on this development, Minister of Power Manohar Lal Khattar said, \"There is an urgent need for developing robust Digital Public ...",
    "date": "3 days ago",
    "content": "New Delhi, June 28 : The Ministry of Power has announced the launch of a task force to conceive the India Energy Stack, a pioneering initiative aimed at creating a unified, secure, and interoperable digital infrastructure for the country's energy sector.The India Energy Stack will play a vital role in integrating renewable energy, enhancing DISCOM efficiency, and delivering transparent, reliable, and future-ready power services, the official statement said.As India charts its path to becoming a $5 trillion economy and advances towards its Net Zero commitments, the power sector faces both unprecedented opportunities and complex challenges.Rapid growth in renewable energy, electric vehicles, and consumer participation in energy markets is transforming the sector, but fragmented systems and a lack of seamless digital integration remain key barriers, the statement explained.To address these, the Ministry of Power is reimagining the sector's digital foundation through the India Energy Stack - a Digital Public Infrastructure (DPI) that will provide a standardised, secure, and open platform to manage, monitor, and innovate across the electricity value chain.The IES will offer unique IDs for consumers, assets, and transactions with real-time, consent-based data sharing. It will also offer Open APIs for seamless system integration and tools for consumer empowerment, market access, and innovation.Speaking on this development, Minister of Power Manohar Lal Khattar said, \"There is an urgent need for developing robust Digital Public Infrastructure in the power sector to manage the country's rising demand, ensure grid stability, and empower consumers. DPI, such as India Energy Stack, will play a vital role in integrating renewable energy, enhancing DISCOM efficiency, and delivering transparent, reliable, and future-ready power services.\"\"What Aadhaar did for identity and UPI achieved for digital payments, the India Energy Stack (IES) will accomplish for the power sector - unlocking seamless, secure, and consumer-centric energy services for every citizen,\" the minister added.Apart from conceiving the IES, the Ministry will undertake a 12-month Proof of Concept to demonstrate IES through real-world use cases in partnership with selected utilities. This includes piloting the Utility Intelligence Platform (UIP), a modular, analytics-driven application built on IES to support utilities, policymakers, and consumers with real-time insights and smarter energy management.To guide these above initiatives, the Ministry has constituted a dedicated Task Force comprising experts from the technology, power sector, and regulatory domains, which will steer the development, pilot implementation, and nationwide scale-up of the India Energy Stack.This initiative, being spearheaded by the Ministry of Power, will come up with an India Energy Stack White Paper for public consultation.It will also undertake pilot testing of the Utility Intelligence Platform with DISCOMs in Mumbai, Gujarat and Delhi and draw up a national roadmap for the rollout of the India Energy Stack."
  },
  {
    "query": "Manohar lal Khattar",
    "title": "BJP distances itself from Manohar Lal Khattar's remarks, ...",
    "link": "https://m.economictimes.com/news/politics-and-nation/bjp-distances-itself-from-manohar-lal-khattars-remarks-calls-them-wrong/articleshow/49411877.cms",
    "source": "Google",
    "snippet": "BJP today dissociated itself from the views of Haryana Chief Minister Manohar Lal Khattar that Muslims will have to quit eating beef and said ...",
    "date": "Oct 16, 2015",
    "content": "\n\n(Catch all theBusiness News,Breaking News,Budget 2025Events andLatest NewsUpdates onThe Economic Times.)\n\nSubscribe toThe Economic Times Primeand read theET ePaperonline.\n\n(Catch all theBusiness News,Breaking News,Budget 2025Events andLatest NewsUpdates onThe Economic Times.)\n\nSubscribe toThe Economic Times Primeand read theET ePaperonline.\n\n\n\nThe bike taxi dreams of Rapido, Uber, and Ola just got a jolt. But they’re winning public favour\n\nSecond only to L&T, but controversies may weaken this infra powerhouse’s growth story\n\nPunit Goenka reloads Zee with Bullet and OTT focus. Can he beat mighty rivals?\n\n3 critical hurdles in India’s quest for rare earth independence\n\nHDB Financial may be cheaper than Bajaj Fin, but what about returns?\n\nWhy Sebi must give up veto power over market infra institutions\n\nPM's light-hearted chat with Shubhanshu Shukla\n\nHouthis launch ballistic missile at Israel\n\nIran mourns commanders killed in Israeli strikes\n\n‘I love you...’: Trump's viral moment with reporter\n\nBJP's Sambit Patra addresses a press conference\n\nTensions rise as Israel strikes Lebanon again\n\nShefali Jariwala dies at 42\n\n‘Stubborn mule’: Trump blasts Fed Chair Powell\n\nCJI BR Gavai gets teary-eyed recalling his father's dream\n\nTrump says he spared Iran’s Khamenei during Israel strike\n\nHot on Web\n\nIn Case you missed it\n\nTop Searched Companies\n\nTop Calculators\n\nTop Prime Articles\n\nTop Commodities\n\nTop Slideshow\n\nPrivate Companies\n\nTop Story Listing\n\nTop Definitions\n\nLatest News\n\nFollow us on:\n\nFind this comment offensive?\n\nChoose your reason below and click on the Report button. This will alert our moderators to take action\n\nReason for reporting:\n\nYour Reason has been Reported to the admin.\n\nLog In/Connect with:\n\nWill be displayed\n\nWill not be displayed\n\nWill be displayed\n\nStories you might be interested in"
  }
]